<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
/*
 * Copyright (C) 2004 PathScale, Inc
 */

#अगर_अघोषित __REGISTERS_H
#घोषणा __REGISTERS_H

#समावेश <sysdep/ptrace.h>
#समावेश <sysdep/archसमलाँघ.स>

बाह्य पूर्णांक save_i387_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *fp_regs);
बाह्य पूर्णांक restore_i387_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *fp_regs);
बाह्य पूर्णांक save_fp_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *fp_regs);
बाह्य पूर्णांक restore_fp_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *fp_regs);
बाह्य पूर्णांक save_fpx_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *fp_regs);
बाह्य पूर्णांक restore_fpx_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *fp_regs);
बाह्य पूर्णांक save_रेजिस्टरs(पूर्णांक pid, काष्ठा uml_pt_regs *regs);
बाह्य पूर्णांक restore_रेजिस्टरs(पूर्णांक pid, काष्ठा uml_pt_regs *regs);
बाह्य पूर्णांक init_रेजिस्टरs(पूर्णांक pid);
बाह्य व्योम get_safe_रेजिस्टरs(अचिन्हित दीर्घ *regs, अचिन्हित दीर्घ *fp_regs);
बाह्य अचिन्हित दीर्घ get_thपढ़ो_reg(पूर्णांक reg, लाँघ_बफ *buf);
बाह्य पूर्णांक get_fp_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *regs);
बाह्य पूर्णांक put_fp_रेजिस्टरs(पूर्णांक pid, अचिन्हित दीर्घ *regs);

#पूर्ण_अगर
