<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0-only
/*
 * wm8962.c  --  WM8962 ALSA SoC Audio driver
 *
 * Copyright 2010-2 Wolfson Microelectronics plc
 *
 * Author: Mark Brown <broonie@खोलोsource.wolfsonmicro.com>
 */

#समावेश <linux/module.h>
#समावेश <linux/moduleparam.h>
#समावेश <linux/init.h>
#समावेश <linux/clk.h>
#समावेश <linux/delay.h>
#समावेश <linux/pm.h>
#समावेश <linux/gcd.h>
#समावेश <linux/gpio/driver.h>
#समावेश <linux/i2c.h>
#समावेश <linux/input.h>
#समावेश <linux/pm_runसमय.स>
#समावेश <linux/regmap.h>
#समावेश <linux/regulator/consumer.h>
#समावेश <linux/slab.h>
#समावेश <linux/workqueue.h>
#समावेश <linux/mutex.h>
#समावेश <sound/core.h>
#समावेश <sound/jack.h>
#समावेश <sound/pcm.h>
#समावेश <sound/pcm_params.h>
#समावेश <sound/soc.h>
#समावेश <sound/initval.h>
#समावेश <sound/tlv.h>
#समावेश <sound/wm8962.h>
#समावेश <trace/events/asoc.h>

#समावेश "wm8962.h"

#घोषणा WM8962_NUM_SUPPLIES 8
अटल स्थिर अक्षर *wm8962_supply_names[WM8962_NUM_SUPPLIES] = अणु
	"DCVDD",
	"DBVDD",
	"AVDD",
	"CPVDD",
	"MICVDD",
	"PLLVDD",
	"SPKVDD1",
	"SPKVDD2",
पूर्ण;

/* codec निजी data */
काष्ठा wm8962_priv अणु
	काष्ठा wm8962_pdata pdata;
	काष्ठा regmap *regmap;
	काष्ठा snd_soc_component *component;

	पूर्णांक sysclk;
	पूर्णांक sysclk_rate;

	पूर्णांक bclk;  /* Desired BCLK */
	पूर्णांक lrclk;

	काष्ठा completion fll_lock;
	पूर्णांक fll_src;
	पूर्णांक fll_fref;
	पूर्णांक fll_fout;

	काष्ठा mutex dsp2_ena_lock;
	u16 dsp2_ena;

	काष्ठा delayed_work mic_work;
	काष्ठा snd_soc_jack *jack;

	काष्ठा regulator_bulk_data supplies[WM8962_NUM_SUPPLIES];
	काष्ठा notअगरier_block disable_nb[WM8962_NUM_SUPPLIES];

	काष्ठा input_dev *beep;
	काष्ठा work_काष्ठा beep_work;
	पूर्णांक beep_rate;

#अगर_घोषित CONFIG_GPIOLIB
	काष्ठा gpio_chip gpio_chip;
#पूर्ण_अगर

	पूर्णांक irq;
पूर्ण;

/* We can't use the same notअगरier block क्रम more than one supply and
 * there's no way I can see to get from a callback to the caller
 * except container_of().
 */
#घोषणा WM8962_REGULATOR_EVENT(n) \
अटल पूर्णांक wm8962_regulator_event_##n(काष्ठा notअगरier_block *nb, \
				    अचिन्हित दीर्घ event, व्योम *data)	\
अणु \
	काष्ठा wm8962_priv *wm8962 = container_of(nb, काष्ठा wm8962_priv, \
						  disable_nb[n]); \
	अगर (event & REGULATOR_EVENT_DISABLE) अणु \
		regcache_mark_dirty(wm8962->regmap);	\
	पूर्ण \
	वापस 0; \
पूर्ण

WM8962_REGULATOR_EVENT(0)
WM8962_REGULATOR_EVENT(1)
WM8962_REGULATOR_EVENT(2)
WM8962_REGULATOR_EVENT(3)
WM8962_REGULATOR_EVENT(4)
WM8962_REGULATOR_EVENT(5)
WM8962_REGULATOR_EVENT(6)
WM8962_REGULATOR_EVENT(7)

अटल स्थिर काष्ठा reg_शेष wm8962_reg[] = अणु
	अणु 0, 0x009F पूर्ण,   /* R0     - Left Input volume */
	अणु 1, 0x049F पूर्ण,   /* R1     - Right Input volume */
	अणु 2, 0x0000 पूर्ण,   /* R2     - HPOUTL volume */
	अणु 3, 0x0000 पूर्ण,   /* R3     - HPOUTR volume */

	अणु 5, 0x0018 पूर्ण,   /* R5     - ADC & DAC Control 1 */
	अणु 6, 0x2008 पूर्ण,   /* R6     - ADC & DAC Control 2 */
	अणु 7, 0x000A पूर्ण,   /* R7     - Audio Interface 0 */
	अणु 8, 0x01E4 पूर्ण,   /* R8     - Clocking2 */
	अणु 9, 0x0300 पूर्ण,   /* R9     - Audio Interface 1 */
	अणु 10, 0x00C0 पूर्ण,  /* R10    - Left DAC volume */
	अणु 11, 0x00C0 पूर्ण,  /* R11    - Right DAC volume */

	अणु 14, 0x0040 पूर्ण,   /* R14    - Audio Interface 2 */
	अणु 15, 0x6243 पूर्ण,   /* R15    - Software Reset */

	अणु 17, 0x007B पूर्ण,   /* R17    - ALC1 */
	अणु 18, 0x0000 पूर्ण,   /* R18    - ALC2 */
	अणु 19, 0x1C32 पूर्ण,   /* R19    - ALC3 */
	अणु 20, 0x3200 पूर्ण,   /* R20    - Noise Gate */
	अणु 21, 0x00C0 पूर्ण,   /* R21    - Left ADC volume */
	अणु 22, 0x00C0 पूर्ण,   /* R22    - Right ADC volume */
	अणु 23, 0x0160 पूर्ण,   /* R23    - Additional control(1) */
	अणु 24, 0x0000 पूर्ण,   /* R24    - Additional control(2) */
	अणु 25, 0x0000 पूर्ण,   /* R25    - Pwr Mgmt (1) */
	अणु 26, 0x0000 पूर्ण,   /* R26    - Pwr Mgmt (2) */
	अणु 27, 0x0010 पूर्ण,   /* R27    - Additional Control (3) */
	अणु 28, 0x0000 पूर्ण,   /* R28    - Anti-pop */

	अणु 30, 0x005E पूर्ण,   /* R30    - Clocking 3 */
	अणु 31, 0x0000 पूर्ण,   /* R31    - Input mixer control (1) */
	अणु 32, 0x0145 पूर्ण,   /* R32    - Left input mixer volume */
	अणु 33, 0x0145 पूर्ण,   /* R33    - Right input mixer volume */
	अणु 34, 0x0009 पूर्ण,   /* R34    - Input mixer control (2) */
	अणु 35, 0x0003 पूर्ण,   /* R35    - Input bias control */
	अणु 37, 0x0008 पूर्ण,   /* R37    - Left input PGA control */
	अणु 38, 0x0008 पूर्ण,   /* R38    - Right input PGA control */

	अणु 40, 0x0000 पूर्ण,   /* R40    - SPKOUTL volume */
	अणु 41, 0x0000 पूर्ण,   /* R41    - SPKOUTR volume */

	अणु 49, 0x0010 पूर्ण,   /* R49    - Class D Control 1 */
	अणु 51, 0x0003 पूर्ण,   /* R51    - Class D Control 2 */

	अणु 56, 0x0506 पूर्ण,   /* R56    - Clocking 4 */
	अणु 57, 0x0000 पूर्ण,   /* R57    - DAC DSP Mixing (1) */
	अणु 58, 0x0000 पूर्ण,   /* R58    - DAC DSP Mixing (2) */

	अणु 60, 0x0300 पूर्ण,   /* R60    - DC Servo 0 */
	अणु 61, 0x0300 पूर्ण,   /* R61    - DC Servo 1 */

	अणु 64, 0x0810 पूर्ण,   /* R64    - DC Servo 4 */

	अणु 68, 0x001B पूर्ण,   /* R68    - Analogue PGA Bias */
	अणु 69, 0x0000 पूर्ण,   /* R69    - Analogue HP 0 */

	अणु 71, 0x01FB पूर्ण,   /* R71    - Analogue HP 2 */
	अणु 72, 0x0000 पूर्ण,   /* R72    - Charge Pump 1 */

	अणु 82, 0x0004 पूर्ण,   /* R82    - Charge Pump B */

	अणु 87, 0x0000 पूर्ण,   /* R87    - Write Sequencer Control 1 */

	अणु 90, 0x0000 पूर्ण,   /* R90    - Write Sequencer Control 2 */

	अणु 93, 0x0000 पूर्ण,   /* R93    - Write Sequencer Control 3 */
	अणु 94, 0x0000 पूर्ण,   /* R94    - Control Interface */

	अणु 99, 0x0000 पूर्ण,   /* R99    - Mixer Enables */
	अणु 100, 0x0000 पूर्ण,   /* R100   - Headphone Mixer (1) */
	अणु 101, 0x0000 पूर्ण,   /* R101   - Headphone Mixer (2) */
	अणु 102, 0x013F पूर्ण,   /* R102   - Headphone Mixer (3) */
	अणु 103, 0x013F पूर्ण,   /* R103   - Headphone Mixer (4) */

	अणु 105, 0x0000 पूर्ण,   /* R105   - Speaker Mixer (1) */
	अणु 106, 0x0000 पूर्ण,   /* R106   - Speaker Mixer (2) */
	अणु 107, 0x013F पूर्ण,   /* R107   - Speaker Mixer (3) */
	अणु 108, 0x013F पूर्ण,   /* R108   - Speaker Mixer (4) */
	अणु 109, 0x0003 पूर्ण,   /* R109   - Speaker Mixer (5) */
	अणु 110, 0x0002 पूर्ण,   /* R110   - Beep Generator (1) */

	अणु 115, 0x0006 पूर्ण,   /* R115   - Oscillator Trim (3) */
	अणु 116, 0x0026 पूर्ण,   /* R116   - Oscillator Trim (4) */

	अणु 119, 0x0000 पूर्ण,   /* R119   - Oscillator Trim (7) */

	अणु 124, 0x0011 पूर्ण,   /* R124   - Analogue Clocking1 */
	अणु 125, 0x004B पूर्ण,   /* R125   - Analogue Clocking2 */
	अणु 126, 0x000D पूर्ण,   /* R126   - Analogue Clocking3 */
	अणु 127, 0x0000 पूर्ण,   /* R127   - PLL Software Reset */

	अणु 131, 0x0000 पूर्ण,   /* R131   - PLL 4 */

	अणु 136, 0x0067 पूर्ण,   /* R136   - PLL 9 */
	अणु 137, 0x001C पूर्ण,   /* R137   - PLL 10 */
	अणु 138, 0x0071 पूर्ण,   /* R138   - PLL 11 */
	अणु 139, 0x00C7 पूर्ण,   /* R139   - PLL 12 */
	अणु 140, 0x0067 पूर्ण,   /* R140   - PLL 13 */
	अणु 141, 0x0048 पूर्ण,   /* R141   - PLL 14 */
	अणु 142, 0x0022 पूर्ण,   /* R142   - PLL 15 */
	अणु 143, 0x0097 पूर्ण,   /* R143   - PLL 16 */

	अणु 155, 0x000C पूर्ण,   /* R155   - FLL Control (1) */
	अणु 156, 0x0039 पूर्ण,   /* R156   - FLL Control (2) */
	अणु 157, 0x0180 पूर्ण,   /* R157   - FLL Control (3) */

	अणु 159, 0x0032 पूर्ण,   /* R159   - FLL Control (5) */
	अणु 160, 0x0018 पूर्ण,   /* R160   - FLL Control (6) */
	अणु 161, 0x007D पूर्ण,   /* R161   - FLL Control (7) */
	अणु 162, 0x0008 पूर्ण,   /* R162   - FLL Control (8) */

	अणु 252, 0x0005 पूर्ण,   /* R252   - General test 1 */

	अणु 256, 0x0000 पूर्ण,   /* R256   - DF1 */
	अणु 257, 0x0000 पूर्ण,   /* R257   - DF2 */
	अणु 258, 0x0000 पूर्ण,   /* R258   - DF3 */
	अणु 259, 0x0000 पूर्ण,   /* R259   - DF4 */
	अणु 260, 0x0000 पूर्ण,   /* R260   - DF5 */
	अणु 261, 0x0000 पूर्ण,   /* R261   - DF6 */
	अणु 262, 0x0000 पूर्ण,   /* R262   - DF7 */

	अणु 264, 0x0000 पूर्ण,   /* R264   - LHPF1 */
	अणु 265, 0x0000 पूर्ण,   /* R265   - LHPF2 */

	अणु 268, 0x0000 पूर्ण,   /* R268   - THREED1 */
	अणु 269, 0x0000 पूर्ण,   /* R269   - THREED2 */
	अणु 270, 0x0000 पूर्ण,   /* R270   - THREED3 */
	अणु 271, 0x0000 पूर्ण,   /* R271   - THREED4 */

	अणु 276, 0x000C पूर्ण,   /* R276   - DRC 1 */
	अणु 277, 0x0925 पूर्ण,   /* R277   - DRC 2 */
	अणु 278, 0x0000 पूर्ण,   /* R278   - DRC 3 */
	अणु 279, 0x0000 पूर्ण,   /* R279   - DRC 4 */
	अणु 280, 0x0000 पूर्ण,   /* R280   - DRC 5 */

	अणु 285, 0x0000 पूर्ण,   /* R285   - Tloopback */

	अणु 335, 0x0004 पूर्ण,   /* R335   - EQ1 */
	अणु 336, 0x6318 पूर्ण,   /* R336   - EQ2 */
	अणु 337, 0x6300 पूर्ण,   /* R337   - EQ3 */
	अणु 338, 0x0FCA पूर्ण,   /* R338   - EQ4 */
	अणु 339, 0x0400 पूर्ण,   /* R339   - EQ5 */
	अणु 340, 0x00D8 पूर्ण,   /* R340   - EQ6 */
	अणु 341, 0x1EB5 पूर्ण,   /* R341   - EQ7 */
	अणु 342, 0xF145 पूर्ण,   /* R342   - EQ8 */
	अणु 343, 0x0B75 पूर्ण,   /* R343   - EQ9 */
	अणु 344, 0x01C5 पूर्ण,   /* R344   - EQ10 */
	अणु 345, 0x1C58 पूर्ण,   /* R345   - EQ11 */
	अणु 346, 0xF373 पूर्ण,   /* R346   - EQ12 */
	अणु 347, 0x0A54 पूर्ण,   /* R347   - EQ13 */
	अणु 348, 0x0558 पूर्ण,   /* R348   - EQ14 */
	अणु 349, 0x168E पूर्ण,   /* R349   - EQ15 */
	अणु 350, 0xF829 पूर्ण,   /* R350   - EQ16 */
	अणु 351, 0x07AD पूर्ण,   /* R351   - EQ17 */
	अणु 352, 0x1103 पूर्ण,   /* R352   - EQ18 */
	अणु 353, 0x0564 पूर्ण,   /* R353   - EQ19 */
	अणु 354, 0x0559 पूर्ण,   /* R354   - EQ20 */
	अणु 355, 0x4000 पूर्ण,   /* R355   - EQ21 */
	अणु 356, 0x6318 पूर्ण,   /* R356   - EQ22 */
	अणु 357, 0x6300 पूर्ण,   /* R357   - EQ23 */
	अणु 358, 0x0FCA पूर्ण,   /* R358   - EQ24 */
	अणु 359, 0x0400 पूर्ण,   /* R359   - EQ25 */
	अणु 360, 0x00D8 पूर्ण,   /* R360   - EQ26 */
	अणु 361, 0x1EB5 पूर्ण,   /* R361   - EQ27 */
	अणु 362, 0xF145 पूर्ण,   /* R362   - EQ28 */
	अणु 363, 0x0B75 पूर्ण,   /* R363   - EQ29 */
	अणु 364, 0x01C5 पूर्ण,   /* R364   - EQ30 */
	अणु 365, 0x1C58 पूर्ण,   /* R365   - EQ31 */
	अणु 366, 0xF373 पूर्ण,   /* R366   - EQ32 */
	अणु 367, 0x0A54 पूर्ण,   /* R367   - EQ33 */
	अणु 368, 0x0558 पूर्ण,   /* R368   - EQ34 */
	अणु 369, 0x168E पूर्ण,   /* R369   - EQ35 */
	अणु 370, 0xF829 पूर्ण,   /* R370   - EQ36 */
	अणु 371, 0x07AD पूर्ण,   /* R371   - EQ37 */
	अणु 372, 0x1103 पूर्ण,   /* R372   - EQ38 */
	अणु 373, 0x0564 पूर्ण,   /* R373   - EQ39 */
	अणु 374, 0x0559 पूर्ण,   /* R374   - EQ40 */
	अणु 375, 0x4000 पूर्ण,   /* R375   - EQ41 */

	अणु 513, 0x0000 पूर्ण,   /* R513   - GPIO 2 */
	अणु 514, 0x0000 पूर्ण,   /* R514   - GPIO 3 */

	अणु 516, 0x8100 पूर्ण,   /* R516   - GPIO 5 */
	अणु 517, 0x8100 पूर्ण,   /* R517   - GPIO 6 */

	अणु 568, 0x0030 पूर्ण,   /* R568   - Interrupt Status 1 Mask */
	अणु 569, 0xFFED पूर्ण,   /* R569   - Interrupt Status 2 Mask */

	अणु 576, 0x0000 पूर्ण,   /* R576   - Interrupt Control */

	अणु 584, 0x002D पूर्ण,   /* R584   - IRQ Debounce */

	अणु 586, 0x0000 पूर्ण,   /* R586   -  MICINT Source Pol */

	अणु 768, 0x1C00 पूर्ण,   /* R768   - DSP2 Power Management */

	अणु 8192, 0x0000 पूर्ण,   /* R8192  - DSP2 Inकाष्ठाion RAM 0 */

	अणु 9216, 0x0030 पूर्ण,   /* R9216  - DSP2 Address RAM 2 */
	अणु 9217, 0x0000 पूर्ण,   /* R9217  - DSP2 Address RAM 1 */
	अणु 9218, 0x0000 पूर्ण,   /* R9218  - DSP2 Address RAM 0 */

	अणु 12288, 0x0000 पूर्ण,   /* R12288 - DSP2 Data1 RAM 1 */
	अणु 12289, 0x0000 पूर्ण,   /* R12289 - DSP2 Data1 RAM 0 */

	अणु 13312, 0x0000 पूर्ण,   /* R13312 - DSP2 Data2 RAM 1 */
	अणु 13313, 0x0000 पूर्ण,   /* R13313 - DSP2 Data2 RAM 0 */

	अणु 14336, 0x0000 पूर्ण,   /* R14336 - DSP2 Data3 RAM 1 */
	अणु 14337, 0x0000 पूर्ण,   /* R14337 - DSP2 Data3 RAM 0 */

	अणु 15360, 0x000A पूर्ण,   /* R15360 - DSP2 Coeff RAM 0 */

	अणु 16384, 0x0000 पूर्ण,   /* R16384 - RETUNEADC_SHARED_COEFF_1 */
	अणु 16385, 0x0000 पूर्ण,   /* R16385 - RETUNEADC_SHARED_COEFF_0 */
	अणु 16386, 0x0000 पूर्ण,   /* R16386 - RETUNEDAC_SHARED_COEFF_1 */
	अणु 16387, 0x0000 पूर्ण,   /* R16387 - RETUNEDAC_SHARED_COEFF_0 */
	अणु 16388, 0x0000 पूर्ण,   /* R16388 - SOUNDSTAGE_ENABLES_1 */
	अणु 16389, 0x0000 पूर्ण,   /* R16389 - SOUNDSTAGE_ENABLES_0 */

	अणु 16896, 0x0002 पूर्ण,   /* R16896 - HDBASS_AI_1 */
	अणु 16897, 0xBD12 पूर्ण,   /* R16897 - HDBASS_AI_0 */
	अणु 16898, 0x007C पूर्ण,   /* R16898 - HDBASS_AR_1 */
	अणु 16899, 0x586C पूर्ण,   /* R16899 - HDBASS_AR_0 */
	अणु 16900, 0x0053 पूर्ण,   /* R16900 - HDBASS_B_1 */
	अणु 16901, 0x8121 पूर्ण,   /* R16901 - HDBASS_B_0 */
	अणु 16902, 0x003F पूर्ण,   /* R16902 - HDBASS_K_1 */
	अणु 16903, 0x8BD8 पूर्ण,   /* R16903 - HDBASS_K_0 */
	अणु 16904, 0x0032 पूर्ण,   /* R16904 - HDBASS_N1_1 */
	अणु 16905, 0xF52D पूर्ण,   /* R16905 - HDBASS_N1_0 */
	अणु 16906, 0x0065 पूर्ण,   /* R16906 - HDBASS_N2_1 */
	अणु 16907, 0xAC8C पूर्ण,   /* R16907 - HDBASS_N2_0 */
	अणु 16908, 0x006B पूर्ण,   /* R16908 - HDBASS_N3_1 */
	अणु 16909, 0xE087 पूर्ण,   /* R16909 - HDBASS_N3_0 */
	अणु 16910, 0x0072 पूर्ण,   /* R16910 - HDBASS_N4_1 */
	अणु 16911, 0x1483 पूर्ण,   /* R16911 - HDBASS_N4_0 */
	अणु 16912, 0x0072 पूर्ण,   /* R16912 - HDBASS_N5_1 */
	अणु 16913, 0x1483 पूर्ण,   /* R16913 - HDBASS_N5_0 */
	अणु 16914, 0x0043 पूर्ण,   /* R16914 - HDBASS_X1_1 */
	अणु 16915, 0x3525 पूर्ण,   /* R16915 - HDBASS_X1_0 */
	अणु 16916, 0x0006 पूर्ण,   /* R16916 - HDBASS_X2_1 */
	अणु 16917, 0x6A4A पूर्ण,   /* R16917 - HDBASS_X2_0 */
	अणु 16918, 0x0043 पूर्ण,   /* R16918 - HDBASS_X3_1 */
	अणु 16919, 0x6079 पूर्ण,   /* R16919 - HDBASS_X3_0 */
	अणु 16920, 0x0008 पूर्ण,   /* R16920 - HDBASS_ATK_1 */
	अणु 16921, 0x0000 पूर्ण,   /* R16921 - HDBASS_ATK_0 */
	अणु 16922, 0x0001 पूर्ण,   /* R16922 - HDBASS_DCY_1 */
	अणु 16923, 0x0000 पूर्ण,   /* R16923 - HDBASS_DCY_0 */
	अणु 16924, 0x0059 पूर्ण,   /* R16924 - HDBASS_PG_1 */
	अणु 16925, 0x999A पूर्ण,   /* R16925 - HDBASS_PG_0 */

	अणु 17408, 0x0083 पूर्ण,   /* R17408 - HPF_C_1 */
	अणु 17409, 0x98AD पूर्ण,   /* R17409 - HPF_C_0 */

	अणु 17920, 0x007F पूर्ण,   /* R17920 - ADCL_RETUNE_C1_1 */
	अणु 17921, 0xFFFF पूर्ण,   /* R17921 - ADCL_RETUNE_C1_0 */
	अणु 17922, 0x0000 पूर्ण,   /* R17922 - ADCL_RETUNE_C2_1 */
	अणु 17923, 0x0000 पूर्ण,   /* R17923 - ADCL_RETUNE_C2_0 */
	अणु 17924, 0x0000 पूर्ण,   /* R17924 - ADCL_RETUNE_C3_1 */
	अणु 17925, 0x0000 पूर्ण,   /* R17925 - ADCL_RETUNE_C3_0 */
	अणु 17926, 0x0000 पूर्ण,   /* R17926 - ADCL_RETUNE_C4_1 */
	अणु 17927, 0x0000 पूर्ण,   /* R17927 - ADCL_RETUNE_C4_0 */
	अणु 17928, 0x0000 पूर्ण,   /* R17928 - ADCL_RETUNE_C5_1 */
	अणु 17929, 0x0000 पूर्ण,   /* R17929 - ADCL_RETUNE_C5_0 */
	अणु 17930, 0x0000 पूर्ण,   /* R17930 - ADCL_RETUNE_C6_1 */
	अणु 17931, 0x0000 पूर्ण,   /* R17931 - ADCL_RETUNE_C6_0 */
	अणु 17932, 0x0000 पूर्ण,   /* R17932 - ADCL_RETUNE_C7_1 */
	अणु 17933, 0x0000 पूर्ण,   /* R17933 - ADCL_RETUNE_C7_0 */
	अणु 17934, 0x0000 पूर्ण,   /* R17934 - ADCL_RETUNE_C8_1 */
	अणु 17935, 0x0000 पूर्ण,   /* R17935 - ADCL_RETUNE_C8_0 */
	अणु 17936, 0x0000 पूर्ण,   /* R17936 - ADCL_RETUNE_C9_1 */
	अणु 17937, 0x0000 पूर्ण,   /* R17937 - ADCL_RETUNE_C9_0 */
	अणु 17938, 0x0000 पूर्ण,   /* R17938 - ADCL_RETUNE_C10_1 */
	अणु 17939, 0x0000 पूर्ण,   /* R17939 - ADCL_RETUNE_C10_0 */
	अणु 17940, 0x0000 पूर्ण,   /* R17940 - ADCL_RETUNE_C11_1 */
	अणु 17941, 0x0000 पूर्ण,   /* R17941 - ADCL_RETUNE_C11_0 */
	अणु 17942, 0x0000 पूर्ण,   /* R17942 - ADCL_RETUNE_C12_1 */
	अणु 17943, 0x0000 पूर्ण,   /* R17943 - ADCL_RETUNE_C12_0 */
	अणु 17944, 0x0000 पूर्ण,   /* R17944 - ADCL_RETUNE_C13_1 */
	अणु 17945, 0x0000 पूर्ण,   /* R17945 - ADCL_RETUNE_C13_0 */
	अणु 17946, 0x0000 पूर्ण,   /* R17946 - ADCL_RETUNE_C14_1 */
	अणु 17947, 0x0000 पूर्ण,   /* R17947 - ADCL_RETUNE_C14_0 */
	अणु 17948, 0x0000 पूर्ण,   /* R17948 - ADCL_RETUNE_C15_1 */
	अणु 17949, 0x0000 पूर्ण,   /* R17949 - ADCL_RETUNE_C15_0 */
	अणु 17950, 0x0000 पूर्ण,   /* R17950 - ADCL_RETUNE_C16_1 */
	अणु 17951, 0x0000 पूर्ण,   /* R17951 - ADCL_RETUNE_C16_0 */
	अणु 17952, 0x0000 पूर्ण,   /* R17952 - ADCL_RETUNE_C17_1 */
	अणु 17953, 0x0000 पूर्ण,   /* R17953 - ADCL_RETUNE_C17_0 */
	अणु 17954, 0x0000 पूर्ण,   /* R17954 - ADCL_RETUNE_C18_1 */
	अणु 17955, 0x0000 पूर्ण,   /* R17955 - ADCL_RETUNE_C18_0 */
	अणु 17956, 0x0000 पूर्ण,   /* R17956 - ADCL_RETUNE_C19_1 */
	अणु 17957, 0x0000 पूर्ण,   /* R17957 - ADCL_RETUNE_C19_0 */
	अणु 17958, 0x0000 पूर्ण,   /* R17958 - ADCL_RETUNE_C20_1 */
	अणु 17959, 0x0000 पूर्ण,   /* R17959 - ADCL_RETUNE_C20_0 */
	अणु 17960, 0x0000 पूर्ण,   /* R17960 - ADCL_RETUNE_C21_1 */
	अणु 17961, 0x0000 पूर्ण,   /* R17961 - ADCL_RETUNE_C21_0 */
	अणु 17962, 0x0000 पूर्ण,   /* R17962 - ADCL_RETUNE_C22_1 */
	अणु 17963, 0x0000 पूर्ण,   /* R17963 - ADCL_RETUNE_C22_0 */
	अणु 17964, 0x0000 पूर्ण,   /* R17964 - ADCL_RETUNE_C23_1 */
	अणु 17965, 0x0000 पूर्ण,   /* R17965 - ADCL_RETUNE_C23_0 */
	अणु 17966, 0x0000 पूर्ण,   /* R17966 - ADCL_RETUNE_C24_1 */
	अणु 17967, 0x0000 पूर्ण,   /* R17967 - ADCL_RETUNE_C24_0 */
	अणु 17968, 0x0000 पूर्ण,   /* R17968 - ADCL_RETUNE_C25_1 */
	अणु 17969, 0x0000 पूर्ण,   /* R17969 - ADCL_RETUNE_C25_0 */
	अणु 17970, 0x0000 पूर्ण,   /* R17970 - ADCL_RETUNE_C26_1 */
	अणु 17971, 0x0000 पूर्ण,   /* R17971 - ADCL_RETUNE_C26_0 */
	अणु 17972, 0x0000 पूर्ण,   /* R17972 - ADCL_RETUNE_C27_1 */
	अणु 17973, 0x0000 पूर्ण,   /* R17973 - ADCL_RETUNE_C27_0 */
	अणु 17974, 0x0000 पूर्ण,   /* R17974 - ADCL_RETUNE_C28_1 */
	अणु 17975, 0x0000 पूर्ण,   /* R17975 - ADCL_RETUNE_C28_0 */
	अणु 17976, 0x0000 पूर्ण,   /* R17976 - ADCL_RETUNE_C29_1 */
	अणु 17977, 0x0000 पूर्ण,   /* R17977 - ADCL_RETUNE_C29_0 */
	अणु 17978, 0x0000 पूर्ण,   /* R17978 - ADCL_RETUNE_C30_1 */
	अणु 17979, 0x0000 पूर्ण,   /* R17979 - ADCL_RETUNE_C30_0 */
	अणु 17980, 0x0000 पूर्ण,   /* R17980 - ADCL_RETUNE_C31_1 */
	अणु 17981, 0x0000 पूर्ण,   /* R17981 - ADCL_RETUNE_C31_0 */
	अणु 17982, 0x0000 पूर्ण,   /* R17982 - ADCL_RETUNE_C32_1 */
	अणु 17983, 0x0000 पूर्ण,   /* R17983 - ADCL_RETUNE_C32_0 */

	अणु 18432, 0x0020 पूर्ण,   /* R18432 - RETUNEADC_PG2_1 */
	अणु 18433, 0x0000 पूर्ण,   /* R18433 - RETUNEADC_PG2_0 */
	अणु 18434, 0x0040 पूर्ण,   /* R18434 - RETUNEADC_PG_1 */
	अणु 18435, 0x0000 पूर्ण,   /* R18435 - RETUNEADC_PG_0 */

	अणु 18944, 0x007F पूर्ण,   /* R18944 - ADCR_RETUNE_C1_1 */
	अणु 18945, 0xFFFF पूर्ण,   /* R18945 - ADCR_RETUNE_C1_0 */
	अणु 18946, 0x0000 पूर्ण,   /* R18946 - ADCR_RETUNE_C2_1 */
	अणु 18947, 0x0000 पूर्ण,   /* R18947 - ADCR_RETUNE_C2_0 */
	अणु 18948, 0x0000 पूर्ण,   /* R18948 - ADCR_RETUNE_C3_1 */
	अणु 18949, 0x0000 पूर्ण,   /* R18949 - ADCR_RETUNE_C3_0 */
	अणु 18950, 0x0000 पूर्ण,   /* R18950 - ADCR_RETUNE_C4_1 */
	अणु 18951, 0x0000 पूर्ण,   /* R18951 - ADCR_RETUNE_C4_0 */
	अणु 18952, 0x0000 पूर्ण,   /* R18952 - ADCR_RETUNE_C5_1 */
	अणु 18953, 0x0000 पूर्ण,   /* R18953 - ADCR_RETUNE_C5_0 */
	अणु 18954, 0x0000 पूर्ण,   /* R18954 - ADCR_RETUNE_C6_1 */
	अणु 18955, 0x0000 पूर्ण,   /* R18955 - ADCR_RETUNE_C6_0 */
	अणु 18956, 0x0000 पूर्ण,   /* R18956 - ADCR_RETUNE_C7_1 */
	अणु 18957, 0x0000 पूर्ण,   /* R18957 - ADCR_RETUNE_C7_0 */
	अणु 18958, 0x0000 पूर्ण,   /* R18958 - ADCR_RETUNE_C8_1 */
	अणु 18959, 0x0000 पूर्ण,   /* R18959 - ADCR_RETUNE_C8_0 */
	अणु 18960, 0x0000 पूर्ण,   /* R18960 - ADCR_RETUNE_C9_1 */
	अणु 18961, 0x0000 पूर्ण,   /* R18961 - ADCR_RETUNE_C9_0 */
	अणु 18962, 0x0000 पूर्ण,   /* R18962 - ADCR_RETUNE_C10_1 */
	अणु 18963, 0x0000 पूर्ण,   /* R18963 - ADCR_RETUNE_C10_0 */
	अणु 18964, 0x0000 पूर्ण,   /* R18964 - ADCR_RETUNE_C11_1 */
	अणु 18965, 0x0000 पूर्ण,   /* R18965 - ADCR_RETUNE_C11_0 */
	अणु 18966, 0x0000 पूर्ण,   /* R18966 - ADCR_RETUNE_C12_1 */
	अणु 18967, 0x0000 पूर्ण,   /* R18967 - ADCR_RETUNE_C12_0 */
	अणु 18968, 0x0000 पूर्ण,   /* R18968 - ADCR_RETUNE_C13_1 */
	अणु 18969, 0x0000 पूर्ण,   /* R18969 - ADCR_RETUNE_C13_0 */
	अणु 18970, 0x0000 पूर्ण,   /* R18970 - ADCR_RETUNE_C14_1 */
	अणु 18971, 0x0000 पूर्ण,   /* R18971 - ADCR_RETUNE_C14_0 */
	अणु 18972, 0x0000 पूर्ण,   /* R18972 - ADCR_RETUNE_C15_1 */
	अणु 18973, 0x0000 पूर्ण,   /* R18973 - ADCR_RETUNE_C15_0 */
	अणु 18974, 0x0000 पूर्ण,   /* R18974 - ADCR_RETUNE_C16_1 */
	अणु 18975, 0x0000 पूर्ण,   /* R18975 - ADCR_RETUNE_C16_0 */
	अणु 18976, 0x0000 पूर्ण,   /* R18976 - ADCR_RETUNE_C17_1 */
	अणु 18977, 0x0000 पूर्ण,   /* R18977 - ADCR_RETUNE_C17_0 */
	अणु 18978, 0x0000 पूर्ण,   /* R18978 - ADCR_RETUNE_C18_1 */
	अणु 18979, 0x0000 पूर्ण,   /* R18979 - ADCR_RETUNE_C18_0 */
	अणु 18980, 0x0000 पूर्ण,   /* R18980 - ADCR_RETUNE_C19_1 */
	अणु 18981, 0x0000 पूर्ण,   /* R18981 - ADCR_RETUNE_C19_0 */
	अणु 18982, 0x0000 पूर्ण,   /* R18982 - ADCR_RETUNE_C20_1 */
	अणु 18983, 0x0000 पूर्ण,   /* R18983 - ADCR_RETUNE_C20_0 */
	अणु 18984, 0x0000 पूर्ण,   /* R18984 - ADCR_RETUNE_C21_1 */
	अणु 18985, 0x0000 पूर्ण,   /* R18985 - ADCR_RETUNE_C21_0 */
	अणु 18986, 0x0000 पूर्ण,   /* R18986 - ADCR_RETUNE_C22_1 */
	अणु 18987, 0x0000 पूर्ण,   /* R18987 - ADCR_RETUNE_C22_0 */
	अणु 18988, 0x0000 पूर्ण,   /* R18988 - ADCR_RETUNE_C23_1 */
	अणु 18989, 0x0000 पूर्ण,   /* R18989 - ADCR_RETUNE_C23_0 */
	अणु 18990, 0x0000 पूर्ण,   /* R18990 - ADCR_RETUNE_C24_1 */
	अणु 18991, 0x0000 पूर्ण,   /* R18991 - ADCR_RETUNE_C24_0 */
	अणु 18992, 0x0000 पूर्ण,   /* R18992 - ADCR_RETUNE_C25_1 */
	अणु 18993, 0x0000 पूर्ण,   /* R18993 - ADCR_RETUNE_C25_0 */
	अणु 18994, 0x0000 पूर्ण,   /* R18994 - ADCR_RETUNE_C26_1 */
	अणु 18995, 0x0000 पूर्ण,   /* R18995 - ADCR_RETUNE_C26_0 */
	अणु 18996, 0x0000 पूर्ण,   /* R18996 - ADCR_RETUNE_C27_1 */
	अणु 18997, 0x0000 पूर्ण,   /* R18997 - ADCR_RETUNE_C27_0 */
	अणु 18998, 0x0000 पूर्ण,   /* R18998 - ADCR_RETUNE_C28_1 */
	अणु 18999, 0x0000 पूर्ण,   /* R18999 - ADCR_RETUNE_C28_0 */
	अणु 19000, 0x0000 पूर्ण,   /* R19000 - ADCR_RETUNE_C29_1 */
	अणु 19001, 0x0000 पूर्ण,   /* R19001 - ADCR_RETUNE_C29_0 */
	अणु 19002, 0x0000 पूर्ण,   /* R19002 - ADCR_RETUNE_C30_1 */
	अणु 19003, 0x0000 पूर्ण,   /* R19003 - ADCR_RETUNE_C30_0 */
	अणु 19004, 0x0000 पूर्ण,   /* R19004 - ADCR_RETUNE_C31_1 */
	अणु 19005, 0x0000 पूर्ण,   /* R19005 - ADCR_RETUNE_C31_0 */
	अणु 19006, 0x0000 पूर्ण,   /* R19006 - ADCR_RETUNE_C32_1 */
	अणु 19007, 0x0000 पूर्ण,   /* R19007 - ADCR_RETUNE_C32_0 */

	अणु 19456, 0x007F पूर्ण,   /* R19456 - DACL_RETUNE_C1_1 */
	अणु 19457, 0xFFFF पूर्ण,   /* R19457 - DACL_RETUNE_C1_0 */
	अणु 19458, 0x0000 पूर्ण,   /* R19458 - DACL_RETUNE_C2_1 */
	अणु 19459, 0x0000 पूर्ण,   /* R19459 - DACL_RETUNE_C2_0 */
	अणु 19460, 0x0000 पूर्ण,   /* R19460 - DACL_RETUNE_C3_1 */
	अणु 19461, 0x0000 पूर्ण,   /* R19461 - DACL_RETUNE_C3_0 */
	अणु 19462, 0x0000 पूर्ण,   /* R19462 - DACL_RETUNE_C4_1 */
	अणु 19463, 0x0000 पूर्ण,   /* R19463 - DACL_RETUNE_C4_0 */
	अणु 19464, 0x0000 पूर्ण,   /* R19464 - DACL_RETUNE_C5_1 */
	अणु 19465, 0x0000 पूर्ण,   /* R19465 - DACL_RETUNE_C5_0 */
	अणु 19466, 0x0000 पूर्ण,   /* R19466 - DACL_RETUNE_C6_1 */
	अणु 19467, 0x0000 पूर्ण,   /* R19467 - DACL_RETUNE_C6_0 */
	अणु 19468, 0x0000 पूर्ण,   /* R19468 - DACL_RETUNE_C7_1 */
	अणु 19469, 0x0000 पूर्ण,   /* R19469 - DACL_RETUNE_C7_0 */
	अणु 19470, 0x0000 पूर्ण,   /* R19470 - DACL_RETUNE_C8_1 */
	अणु 19471, 0x0000 पूर्ण,   /* R19471 - DACL_RETUNE_C8_0 */
	अणु 19472, 0x0000 पूर्ण,   /* R19472 - DACL_RETUNE_C9_1 */
	अणु 19473, 0x0000 पूर्ण,   /* R19473 - DACL_RETUNE_C9_0 */
	अणु 19474, 0x0000 पूर्ण,   /* R19474 - DACL_RETUNE_C10_1 */
	अणु 19475, 0x0000 पूर्ण,   /* R19475 - DACL_RETUNE_C10_0 */
	अणु 19476, 0x0000 पूर्ण,   /* R19476 - DACL_RETUNE_C11_1 */
	अणु 19477, 0x0000 पूर्ण,   /* R19477 - DACL_RETUNE_C11_0 */
	अणु 19478, 0x0000 पूर्ण,   /* R19478 - DACL_RETUNE_C12_1 */
	अणु 19479, 0x0000 पूर्ण,   /* R19479 - DACL_RETUNE_C12_0 */
	अणु 19480, 0x0000 पूर्ण,   /* R19480 - DACL_RETUNE_C13_1 */
	अणु 19481, 0x0000 पूर्ण,   /* R19481 - DACL_RETUNE_C13_0 */
	अणु 19482, 0x0000 पूर्ण,   /* R19482 - DACL_RETUNE_C14_1 */
	अणु 19483, 0x0000 पूर्ण,   /* R19483 - DACL_RETUNE_C14_0 */
	अणु 19484, 0x0000 पूर्ण,   /* R19484 - DACL_RETUNE_C15_1 */
	अणु 19485, 0x0000 पूर्ण,   /* R19485 - DACL_RETUNE_C15_0 */
	अणु 19486, 0x0000 पूर्ण,   /* R19486 - DACL_RETUNE_C16_1 */
	अणु 19487, 0x0000 पूर्ण,   /* R19487 - DACL_RETUNE_C16_0 */
	अणु 19488, 0x0000 पूर्ण,   /* R19488 - DACL_RETUNE_C17_1 */
	अणु 19489, 0x0000 पूर्ण,   /* R19489 - DACL_RETUNE_C17_0 */
	अणु 19490, 0x0000 पूर्ण,   /* R19490 - DACL_RETUNE_C18_1 */
	अणु 19491, 0x0000 पूर्ण,   /* R19491 - DACL_RETUNE_C18_0 */
	अणु 19492, 0x0000 पूर्ण,   /* R19492 - DACL_RETUNE_C19_1 */
	अणु 19493, 0x0000 पूर्ण,   /* R19493 - DACL_RETUNE_C19_0 */
	अणु 19494, 0x0000 पूर्ण,   /* R19494 - DACL_RETUNE_C20_1 */
	अणु 19495, 0x0000 पूर्ण,   /* R19495 - DACL_RETUNE_C20_0 */
	अणु 19496, 0x0000 पूर्ण,   /* R19496 - DACL_RETUNE_C21_1 */
	अणु 19497, 0x0000 पूर्ण,   /* R19497 - DACL_RETUNE_C21_0 */
	अणु 19498, 0x0000 पूर्ण,   /* R19498 - DACL_RETUNE_C22_1 */
	अणु 19499, 0x0000 पूर्ण,   /* R19499 - DACL_RETUNE_C22_0 */
	अणु 19500, 0x0000 पूर्ण,   /* R19500 - DACL_RETUNE_C23_1 */
	अणु 19501, 0x0000 पूर्ण,   /* R19501 - DACL_RETUNE_C23_0 */
	अणु 19502, 0x0000 पूर्ण,   /* R19502 - DACL_RETUNE_C24_1 */
	अणु 19503, 0x0000 पूर्ण,   /* R19503 - DACL_RETUNE_C24_0 */
	अणु 19504, 0x0000 पूर्ण,   /* R19504 - DACL_RETUNE_C25_1 */
	अणु 19505, 0x0000 पूर्ण,   /* R19505 - DACL_RETUNE_C25_0 */
	अणु 19506, 0x0000 पूर्ण,   /* R19506 - DACL_RETUNE_C26_1 */
	अणु 19507, 0x0000 पूर्ण,   /* R19507 - DACL_RETUNE_C26_0 */
	अणु 19508, 0x0000 पूर्ण,   /* R19508 - DACL_RETUNE_C27_1 */
	अणु 19509, 0x0000 पूर्ण,   /* R19509 - DACL_RETUNE_C27_0 */
	अणु 19510, 0x0000 पूर्ण,   /* R19510 - DACL_RETUNE_C28_1 */
	अणु 19511, 0x0000 पूर्ण,   /* R19511 - DACL_RETUNE_C28_0 */
	अणु 19512, 0x0000 पूर्ण,   /* R19512 - DACL_RETUNE_C29_1 */
	अणु 19513, 0x0000 पूर्ण,   /* R19513 - DACL_RETUNE_C29_0 */
	अणु 19514, 0x0000 पूर्ण,   /* R19514 - DACL_RETUNE_C30_1 */
	अणु 19515, 0x0000 पूर्ण,   /* R19515 - DACL_RETUNE_C30_0 */
	अणु 19516, 0x0000 पूर्ण,   /* R19516 - DACL_RETUNE_C31_1 */
	अणु 19517, 0x0000 पूर्ण,   /* R19517 - DACL_RETUNE_C31_0 */
	अणु 19518, 0x0000 पूर्ण,   /* R19518 - DACL_RETUNE_C32_1 */
	अणु 19519, 0x0000 पूर्ण,   /* R19519 - DACL_RETUNE_C32_0 */

	अणु 19968, 0x0020 पूर्ण,   /* R19968 - RETUNEDAC_PG2_1 */
	अणु 19969, 0x0000 पूर्ण,   /* R19969 - RETUNEDAC_PG2_0 */
	अणु 19970, 0x0040 पूर्ण,   /* R19970 - RETUNEDAC_PG_1 */
	अणु 19971, 0x0000 पूर्ण,   /* R19971 - RETUNEDAC_PG_0 */

	अणु 20480, 0x007F पूर्ण,   /* R20480 - DACR_RETUNE_C1_1 */
	अणु 20481, 0xFFFF पूर्ण,   /* R20481 - DACR_RETUNE_C1_0 */
	अणु 20482, 0x0000 पूर्ण,   /* R20482 - DACR_RETUNE_C2_1 */
	अणु 20483, 0x0000 पूर्ण,   /* R20483 - DACR_RETUNE_C2_0 */
	अणु 20484, 0x0000 पूर्ण,   /* R20484 - DACR_RETUNE_C3_1 */
	अणु 20485, 0x0000 पूर्ण,   /* R20485 - DACR_RETUNE_C3_0 */
	अणु 20486, 0x0000 पूर्ण,   /* R20486 - DACR_RETUNE_C4_1 */
	अणु 20487, 0x0000 पूर्ण,   /* R20487 - DACR_RETUNE_C4_0 */
	अणु 20488, 0x0000 पूर्ण,   /* R20488 - DACR_RETUNE_C5_1 */
	अणु 20489, 0x0000 पूर्ण,   /* R20489 - DACR_RETUNE_C5_0 */
	अणु 20490, 0x0000 पूर्ण,   /* R20490 - DACR_RETUNE_C6_1 */
	अणु 20491, 0x0000 पूर्ण,   /* R20491 - DACR_RETUNE_C6_0 */
	अणु 20492, 0x0000 पूर्ण,   /* R20492 - DACR_RETUNE_C7_1 */
	अणु 20493, 0x0000 पूर्ण,   /* R20493 - DACR_RETUNE_C7_0 */
	अणु 20494, 0x0000 पूर्ण,   /* R20494 - DACR_RETUNE_C8_1 */
	अणु 20495, 0x0000 पूर्ण,   /* R20495 - DACR_RETUNE_C8_0 */
	अणु 20496, 0x0000 पूर्ण,   /* R20496 - DACR_RETUNE_C9_1 */
	अणु 20497, 0x0000 पूर्ण,   /* R20497 - DACR_RETUNE_C9_0 */
	अणु 20498, 0x0000 पूर्ण,   /* R20498 - DACR_RETUNE_C10_1 */
	अणु 20499, 0x0000 पूर्ण,   /* R20499 - DACR_RETUNE_C10_0 */
	अणु 20500, 0x0000 पूर्ण,   /* R20500 - DACR_RETUNE_C11_1 */
	अणु 20501, 0x0000 पूर्ण,   /* R20501 - DACR_RETUNE_C11_0 */
	अणु 20502, 0x0000 पूर्ण,   /* R20502 - DACR_RETUNE_C12_1 */
	अणु 20503, 0x0000 पूर्ण,   /* R20503 - DACR_RETUNE_C12_0 */
	अणु 20504, 0x0000 पूर्ण,   /* R20504 - DACR_RETUNE_C13_1 */
	अणु 20505, 0x0000 पूर्ण,   /* R20505 - DACR_RETUNE_C13_0 */
	अणु 20506, 0x0000 पूर्ण,   /* R20506 - DACR_RETUNE_C14_1 */
	अणु 20507, 0x0000 पूर्ण,   /* R20507 - DACR_RETUNE_C14_0 */
	अणु 20508, 0x0000 पूर्ण,   /* R20508 - DACR_RETUNE_C15_1 */
	अणु 20509, 0x0000 पूर्ण,   /* R20509 - DACR_RETUNE_C15_0 */
	अणु 20510, 0x0000 पूर्ण,   /* R20510 - DACR_RETUNE_C16_1 */
	अणु 20511, 0x0000 पूर्ण,   /* R20511 - DACR_RETUNE_C16_0 */
	अणु 20512, 0x0000 पूर्ण,   /* R20512 - DACR_RETUNE_C17_1 */
	अणु 20513, 0x0000 पूर्ण,   /* R20513 - DACR_RETUNE_C17_0 */
	अणु 20514, 0x0000 पूर्ण,   /* R20514 - DACR_RETUNE_C18_1 */
	अणु 20515, 0x0000 पूर्ण,   /* R20515 - DACR_RETUNE_C18_0 */
	अणु 20516, 0x0000 पूर्ण,   /* R20516 - DACR_RETUNE_C19_1 */
	अणु 20517, 0x0000 पूर्ण,   /* R20517 - DACR_RETUNE_C19_0 */
	अणु 20518, 0x0000 पूर्ण,   /* R20518 - DACR_RETUNE_C20_1 */
	अणु 20519, 0x0000 पूर्ण,   /* R20519 - DACR_RETUNE_C20_0 */
	अणु 20520, 0x0000 पूर्ण,   /* R20520 - DACR_RETUNE_C21_1 */
	अणु 20521, 0x0000 पूर्ण,   /* R20521 - DACR_RETUNE_C21_0 */
	अणु 20522, 0x0000 पूर्ण,   /* R20522 - DACR_RETUNE_C22_1 */
	अणु 20523, 0x0000 पूर्ण,   /* R20523 - DACR_RETUNE_C22_0 */
	अणु 20524, 0x0000 पूर्ण,   /* R20524 - DACR_RETUNE_C23_1 */
	अणु 20525, 0x0000 पूर्ण,   /* R20525 - DACR_RETUNE_C23_0 */
	अणु 20526, 0x0000 पूर्ण,   /* R20526 - DACR_RETUNE_C24_1 */
	अणु 20527, 0x0000 पूर्ण,   /* R20527 - DACR_RETUNE_C24_0 */
	अणु 20528, 0x0000 पूर्ण,   /* R20528 - DACR_RETUNE_C25_1 */
	अणु 20529, 0x0000 पूर्ण,   /* R20529 - DACR_RETUNE_C25_0 */
	अणु 20530, 0x0000 पूर्ण,   /* R20530 - DACR_RETUNE_C26_1 */
	अणु 20531, 0x0000 पूर्ण,   /* R20531 - DACR_RETUNE_C26_0 */
	अणु 20532, 0x0000 पूर्ण,   /* R20532 - DACR_RETUNE_C27_1 */
	अणु 20533, 0x0000 पूर्ण,   /* R20533 - DACR_RETUNE_C27_0 */
	अणु 20534, 0x0000 पूर्ण,   /* R20534 - DACR_RETUNE_C28_1 */
	अणु 20535, 0x0000 पूर्ण,   /* R20535 - DACR_RETUNE_C28_0 */
	अणु 20536, 0x0000 पूर्ण,   /* R20536 - DACR_RETUNE_C29_1 */
	अणु 20537, 0x0000 पूर्ण,   /* R20537 - DACR_RETUNE_C29_0 */
	अणु 20538, 0x0000 पूर्ण,   /* R20538 - DACR_RETUNE_C30_1 */
	अणु 20539, 0x0000 पूर्ण,   /* R20539 - DACR_RETUNE_C30_0 */
	अणु 20540, 0x0000 पूर्ण,   /* R20540 - DACR_RETUNE_C31_1 */
	अणु 20541, 0x0000 पूर्ण,   /* R20541 - DACR_RETUNE_C31_0 */
	अणु 20542, 0x0000 पूर्ण,   /* R20542 - DACR_RETUNE_C32_1 */
	अणु 20543, 0x0000 पूर्ण,   /* R20543 - DACR_RETUNE_C32_0 */

	अणु 20992, 0x008C पूर्ण,   /* R20992 - VSS_XHD2_1 */
	अणु 20993, 0x0200 पूर्ण,   /* R20993 - VSS_XHD2_0 */
	अणु 20994, 0x0035 पूर्ण,   /* R20994 - VSS_XHD3_1 */
	अणु 20995, 0x0700 पूर्ण,   /* R20995 - VSS_XHD3_0 */
	अणु 20996, 0x003A पूर्ण,   /* R20996 - VSS_XHN1_1 */
	अणु 20997, 0x4100 पूर्ण,   /* R20997 - VSS_XHN1_0 */
	अणु 20998, 0x008B पूर्ण,   /* R20998 - VSS_XHN2_1 */
	अणु 20999, 0x7D00 पूर्ण,   /* R20999 - VSS_XHN2_0 */
	अणु 21000, 0x003A पूर्ण,   /* R21000 - VSS_XHN3_1 */
	अणु 21001, 0x4100 पूर्ण,   /* R21001 - VSS_XHN3_0 */
	अणु 21002, 0x008C पूर्ण,   /* R21002 - VSS_XLA_1 */
	अणु 21003, 0xFEE8 पूर्ण,   /* R21003 - VSS_XLA_0 */
	अणु 21004, 0x0078 पूर्ण,   /* R21004 - VSS_XLB_1 */
	अणु 21005, 0x0000 पूर्ण,   /* R21005 - VSS_XLB_0 */
	अणु 21006, 0x003F पूर्ण,   /* R21006 - VSS_XLG_1 */
	अणु 21007, 0xB260 पूर्ण,   /* R21007 - VSS_XLG_0 */
	अणु 21008, 0x002D पूर्ण,   /* R21008 - VSS_PG2_1 */
	अणु 21009, 0x1818 पूर्ण,   /* R21009 - VSS_PG2_0 */
	अणु 21010, 0x0020 पूर्ण,   /* R21010 - VSS_PG_1 */
	अणु 21011, 0x0000 पूर्ण,   /* R21011 - VSS_PG_0 */
	अणु 21012, 0x00F1 पूर्ण,   /* R21012 - VSS_XTD1_1 */
	अणु 21013, 0x8340 पूर्ण,   /* R21013 - VSS_XTD1_0 */
	अणु 21014, 0x00FB पूर्ण,   /* R21014 - VSS_XTD2_1 */
	अणु 21015, 0x8300 पूर्ण,   /* R21015 - VSS_XTD2_0 */
	अणु 21016, 0x00EE पूर्ण,   /* R21016 - VSS_XTD3_1 */
	अणु 21017, 0xAEC0 पूर्ण,   /* R21017 - VSS_XTD3_0 */
	अणु 21018, 0x00FB पूर्ण,   /* R21018 - VSS_XTD4_1 */
	अणु 21019, 0xAC40 पूर्ण,   /* R21019 - VSS_XTD4_0 */
	अणु 21020, 0x00F1 पूर्ण,   /* R21020 - VSS_XTD5_1 */
	अणु 21021, 0x7F80 पूर्ण,   /* R21021 - VSS_XTD5_0 */
	अणु 21022, 0x00F4 पूर्ण,   /* R21022 - VSS_XTD6_1 */
	अणु 21023, 0x3B40 पूर्ण,   /* R21023 - VSS_XTD6_0 */
	अणु 21024, 0x00F5 पूर्ण,   /* R21024 - VSS_XTD7_1 */
	अणु 21025, 0xFB00 पूर्ण,   /* R21025 - VSS_XTD7_0 */
	अणु 21026, 0x00EA पूर्ण,   /* R21026 - VSS_XTD8_1 */
	अणु 21027, 0x10C0 पूर्ण,   /* R21027 - VSS_XTD8_0 */
	अणु 21028, 0x00FC पूर्ण,   /* R21028 - VSS_XTD9_1 */
	अणु 21029, 0xC580 पूर्ण,   /* R21029 - VSS_XTD9_0 */
	अणु 21030, 0x00E2 पूर्ण,   /* R21030 - VSS_XTD10_1 */
	अणु 21031, 0x75C0 पूर्ण,   /* R21031 - VSS_XTD10_0 */
	अणु 21032, 0x0004 पूर्ण,   /* R21032 - VSS_XTD11_1 */
	अणु 21033, 0xB480 पूर्ण,   /* R21033 - VSS_XTD11_0 */
	अणु 21034, 0x00D4 पूर्ण,   /* R21034 - VSS_XTD12_1 */
	अणु 21035, 0xF980 पूर्ण,   /* R21035 - VSS_XTD12_0 */
	अणु 21036, 0x0004 पूर्ण,   /* R21036 - VSS_XTD13_1 */
	अणु 21037, 0x9140 पूर्ण,   /* R21037 - VSS_XTD13_0 */
	अणु 21038, 0x00D8 पूर्ण,   /* R21038 - VSS_XTD14_1 */
	अणु 21039, 0xA480 पूर्ण,   /* R21039 - VSS_XTD14_0 */
	अणु 21040, 0x0002 पूर्ण,   /* R21040 - VSS_XTD15_1 */
	अणु 21041, 0x3DC0 पूर्ण,   /* R21041 - VSS_XTD15_0 */
	अणु 21042, 0x00CF पूर्ण,   /* R21042 - VSS_XTD16_1 */
	अणु 21043, 0x7A80 पूर्ण,   /* R21043 - VSS_XTD16_0 */
	अणु 21044, 0x00DC पूर्ण,   /* R21044 - VSS_XTD17_1 */
	अणु 21045, 0x0600 पूर्ण,   /* R21045 - VSS_XTD17_0 */
	अणु 21046, 0x00F2 पूर्ण,   /* R21046 - VSS_XTD18_1 */
	अणु 21047, 0xDAC0 पूर्ण,   /* R21047 - VSS_XTD18_0 */
	अणु 21048, 0x00BA पूर्ण,   /* R21048 - VSS_XTD19_1 */
	अणु 21049, 0xF340 पूर्ण,   /* R21049 - VSS_XTD19_0 */
	अणु 21050, 0x000A पूर्ण,   /* R21050 - VSS_XTD20_1 */
	अणु 21051, 0x7940 पूर्ण,   /* R21051 - VSS_XTD20_0 */
	अणु 21052, 0x001C पूर्ण,   /* R21052 - VSS_XTD21_1 */
	अणु 21053, 0x0680 पूर्ण,   /* R21053 - VSS_XTD21_0 */
	अणु 21054, 0x00FD पूर्ण,   /* R21054 - VSS_XTD22_1 */
	अणु 21055, 0x2D00 पूर्ण,   /* R21055 - VSS_XTD22_0 */
	अणु 21056, 0x001C पूर्ण,   /* R21056 - VSS_XTD23_1 */
	अणु 21057, 0xE840 पूर्ण,   /* R21057 - VSS_XTD23_0 */
	अणु 21058, 0x000D पूर्ण,   /* R21058 - VSS_XTD24_1 */
	अणु 21059, 0xDC40 पूर्ण,   /* R21059 - VSS_XTD24_0 */
	अणु 21060, 0x00FC पूर्ण,   /* R21060 - VSS_XTD25_1 */
	अणु 21061, 0x9D00 पूर्ण,   /* R21061 - VSS_XTD25_0 */
	अणु 21062, 0x0009 पूर्ण,   /* R21062 - VSS_XTD26_1 */
	अणु 21063, 0x5580 पूर्ण,   /* R21063 - VSS_XTD26_0 */
	अणु 21064, 0x00FE पूर्ण,   /* R21064 - VSS_XTD27_1 */
	अणु 21065, 0x7E80 पूर्ण,   /* R21065 - VSS_XTD27_0 */
	अणु 21066, 0x000E पूर्ण,   /* R21066 - VSS_XTD28_1 */
	अणु 21067, 0xAB40 पूर्ण,   /* R21067 - VSS_XTD28_0 */
	अणु 21068, 0x00F9 पूर्ण,   /* R21068 - VSS_XTD29_1 */
	अणु 21069, 0x9880 पूर्ण,   /* R21069 - VSS_XTD29_0 */
	अणु 21070, 0x0009 पूर्ण,   /* R21070 - VSS_XTD30_1 */
	अणु 21071, 0x87C0 पूर्ण,   /* R21071 - VSS_XTD30_0 */
	अणु 21072, 0x00FD पूर्ण,   /* R21072 - VSS_XTD31_1 */
	अणु 21073, 0x2C40 पूर्ण,   /* R21073 - VSS_XTD31_0 */
	अणु 21074, 0x0009 पूर्ण,   /* R21074 - VSS_XTD32_1 */
	अणु 21075, 0x4800 पूर्ण,   /* R21075 - VSS_XTD32_0 */
	अणु 21076, 0x0003 पूर्ण,   /* R21076 - VSS_XTS1_1 */
	अणु 21077, 0x5F40 पूर्ण,   /* R21077 - VSS_XTS1_0 */
	अणु 21078, 0x0000 पूर्ण,   /* R21078 - VSS_XTS2_1 */
	अणु 21079, 0x8700 पूर्ण,   /* R21079 - VSS_XTS2_0 */
	अणु 21080, 0x00FA पूर्ण,   /* R21080 - VSS_XTS3_1 */
	अणु 21081, 0xE4C0 पूर्ण,   /* R21081 - VSS_XTS3_0 */
	अणु 21082, 0x0000 पूर्ण,   /* R21082 - VSS_XTS4_1 */
	अणु 21083, 0x0B40 पूर्ण,   /* R21083 - VSS_XTS4_0 */
	अणु 21084, 0x0004 पूर्ण,   /* R21084 - VSS_XTS5_1 */
	अणु 21085, 0xE180 पूर्ण,   /* R21085 - VSS_XTS5_0 */
	अणु 21086, 0x0001 पूर्ण,   /* R21086 - VSS_XTS6_1 */
	अणु 21087, 0x1F40 पूर्ण,   /* R21087 - VSS_XTS6_0 */
	अणु 21088, 0x00F8 पूर्ण,   /* R21088 - VSS_XTS7_1 */
	अणु 21089, 0xB000 पूर्ण,   /* R21089 - VSS_XTS7_0 */
	अणु 21090, 0x00FB पूर्ण,   /* R21090 - VSS_XTS8_1 */
	अणु 21091, 0xCBC0 पूर्ण,   /* R21091 - VSS_XTS8_0 */
	अणु 21092, 0x0004 पूर्ण,   /* R21092 - VSS_XTS9_1 */
	अणु 21093, 0xF380 पूर्ण,   /* R21093 - VSS_XTS9_0 */
	अणु 21094, 0x0007 पूर्ण,   /* R21094 - VSS_XTS10_1 */
	अणु 21095, 0xDF40 पूर्ण,   /* R21095 - VSS_XTS10_0 */
	अणु 21096, 0x00FF पूर्ण,   /* R21096 - VSS_XTS11_1 */
	अणु 21097, 0x0700 पूर्ण,   /* R21097 - VSS_XTS11_0 */
	अणु 21098, 0x00EF पूर्ण,   /* R21098 - VSS_XTS12_1 */
	अणु 21099, 0xD700 पूर्ण,   /* R21099 - VSS_XTS12_0 */
	अणु 21100, 0x00FB पूर्ण,   /* R21100 - VSS_XTS13_1 */
	अणु 21101, 0xAF40 पूर्ण,   /* R21101 - VSS_XTS13_0 */
	अणु 21102, 0x0010 पूर्ण,   /* R21102 - VSS_XTS14_1 */
	अणु 21103, 0x8A80 पूर्ण,   /* R21103 - VSS_XTS14_0 */
	अणु 21104, 0x0011 पूर्ण,   /* R21104 - VSS_XTS15_1 */
	अणु 21105, 0x07C0 पूर्ण,   /* R21105 - VSS_XTS15_0 */
	अणु 21106, 0x00E0 पूर्ण,   /* R21106 - VSS_XTS16_1 */
	अणु 21107, 0x0800 पूर्ण,   /* R21107 - VSS_XTS16_0 */
	अणु 21108, 0x00D2 पूर्ण,   /* R21108 - VSS_XTS17_1 */
	अणु 21109, 0x7600 पूर्ण,   /* R21109 - VSS_XTS17_0 */
	अणु 21110, 0x0020 पूर्ण,   /* R21110 - VSS_XTS18_1 */
	अणु 21111, 0xCF40 पूर्ण,   /* R21111 - VSS_XTS18_0 */
	अणु 21112, 0x0030 पूर्ण,   /* R21112 - VSS_XTS19_1 */
	अणु 21113, 0x2340 पूर्ण,   /* R21113 - VSS_XTS19_0 */
	अणु 21114, 0x00FD पूर्ण,   /* R21114 - VSS_XTS20_1 */
	अणु 21115, 0x69C0 पूर्ण,   /* R21115 - VSS_XTS20_0 */
	अणु 21116, 0x0028 पूर्ण,   /* R21116 - VSS_XTS21_1 */
	अणु 21117, 0x3500 पूर्ण,   /* R21117 - VSS_XTS21_0 */
	अणु 21118, 0x0006 पूर्ण,   /* R21118 - VSS_XTS22_1 */
	अणु 21119, 0x3300 पूर्ण,   /* R21119 - VSS_XTS22_0 */
	अणु 21120, 0x00D9 पूर्ण,   /* R21120 - VSS_XTS23_1 */
	अणु 21121, 0xF6C0 पूर्ण,   /* R21121 - VSS_XTS23_0 */
	अणु 21122, 0x00F3 पूर्ण,   /* R21122 - VSS_XTS24_1 */
	अणु 21123, 0x3340 पूर्ण,   /* R21123 - VSS_XTS24_0 */
	अणु 21124, 0x000F पूर्ण,   /* R21124 - VSS_XTS25_1 */
	अणु 21125, 0x4200 पूर्ण,   /* R21125 - VSS_XTS25_0 */
	अणु 21126, 0x0004 पूर्ण,   /* R21126 - VSS_XTS26_1 */
	अणु 21127, 0x0C80 पूर्ण,   /* R21127 - VSS_XTS26_0 */
	अणु 21128, 0x00FB पूर्ण,   /* R21128 - VSS_XTS27_1 */
	अणु 21129, 0x3F80 पूर्ण,   /* R21129 - VSS_XTS27_0 */
	अणु 21130, 0x00F7 पूर्ण,   /* R21130 - VSS_XTS28_1 */
	अणु 21131, 0x57C0 पूर्ण,   /* R21131 - VSS_XTS28_0 */
	अणु 21132, 0x0003 पूर्ण,   /* R21132 - VSS_XTS29_1 */
	अणु 21133, 0x5400 पूर्ण,   /* R21133 - VSS_XTS29_0 */
	अणु 21134, 0x0000 पूर्ण,   /* R21134 - VSS_XTS30_1 */
	अणु 21135, 0xC6C0 पूर्ण,   /* R21135 - VSS_XTS30_0 */
	अणु 21136, 0x0003 पूर्ण,   /* R21136 - VSS_XTS31_1 */
	अणु 21137, 0x12C0 पूर्ण,   /* R21137 - VSS_XTS31_0 */
	अणु 21138, 0x00FD पूर्ण,   /* R21138 - VSS_XTS32_1 */
	अणु 21139, 0x8580 पूर्ण,   /* R21139 - VSS_XTS32_0 */
पूर्ण;

अटल bool wm8962_अस्थिर_रेजिस्टर(काष्ठा device *dev, अचिन्हित पूर्णांक reg)
अणु
	चयन (reg) अणु
	हाल WM8962_CLOCKING1:
	हाल WM8962_SOFTWARE_RESET:
	हाल WM8962_THERMAL_SHUTDOWN_STATUS:
	हाल WM8962_ADDITIONAL_CONTROL_4:
	हाल WM8962_DC_SERVO_6:
	हाल WM8962_INTERRUPT_STATUS_1:
	हाल WM8962_INTERRUPT_STATUS_2:
	हाल WM8962_DSP2_EXECCONTROL:
		वापस true;
	शेष:
		वापस false;
	पूर्ण
पूर्ण

अटल bool wm8962_पढ़ोable_रेजिस्टर(काष्ठा device *dev, अचिन्हित पूर्णांक reg)
अणु
	चयन (reg) अणु
	हाल WM8962_LEFT_INPUT_VOLUME:
	हाल WM8962_RIGHT_INPUT_VOLUME:
	हाल WM8962_HPOUTL_VOLUME:
	हाल WM8962_HPOUTR_VOLUME:
	हाल WM8962_CLOCKING1:
	हाल WM8962_ADC_DAC_CONTROL_1:
	हाल WM8962_ADC_DAC_CONTROL_2:
	हाल WM8962_AUDIO_INTERFACE_0:
	हाल WM8962_CLOCKING2:
	हाल WM8962_AUDIO_INTERFACE_1:
	हाल WM8962_LEFT_DAC_VOLUME:
	हाल WM8962_RIGHT_DAC_VOLUME:
	हाल WM8962_AUDIO_INTERFACE_2:
	हाल WM8962_SOFTWARE_RESET:
	हाल WM8962_ALC1:
	हाल WM8962_ALC2:
	हाल WM8962_ALC3:
	हाल WM8962_NOISE_GATE:
	हाल WM8962_LEFT_ADC_VOLUME:
	हाल WM8962_RIGHT_ADC_VOLUME:
	हाल WM8962_ADDITIONAL_CONTROL_1:
	हाल WM8962_ADDITIONAL_CONTROL_2:
	हाल WM8962_PWR_MGMT_1:
	हाल WM8962_PWR_MGMT_2:
	हाल WM8962_ADDITIONAL_CONTROL_3:
	हाल WM8962_ANTI_POP:
	हाल WM8962_CLOCKING_3:
	हाल WM8962_INPUT_MIXER_CONTROL_1:
	हाल WM8962_LEFT_INPUT_MIXER_VOLUME:
	हाल WM8962_RIGHT_INPUT_MIXER_VOLUME:
	हाल WM8962_INPUT_MIXER_CONTROL_2:
	हाल WM8962_INPUT_BIAS_CONTROL:
	हाल WM8962_LEFT_INPUT_PGA_CONTROL:
	हाल WM8962_RIGHT_INPUT_PGA_CONTROL:
	हाल WM8962_SPKOUTL_VOLUME:
	हाल WM8962_SPKOUTR_VOLUME:
	हाल WM8962_THERMAL_SHUTDOWN_STATUS:
	हाल WM8962_ADDITIONAL_CONTROL_4:
	हाल WM8962_CLASS_D_CONTROL_1:
	हाल WM8962_CLASS_D_CONTROL_2:
	हाल WM8962_CLOCKING_4:
	हाल WM8962_DAC_DSP_MIXING_1:
	हाल WM8962_DAC_DSP_MIXING_2:
	हाल WM8962_DC_SERVO_0:
	हाल WM8962_DC_SERVO_1:
	हाल WM8962_DC_SERVO_4:
	हाल WM8962_DC_SERVO_6:
	हाल WM8962_ANALOGUE_PGA_BIAS:
	हाल WM8962_ANALOGUE_HP_0:
	हाल WM8962_ANALOGUE_HP_2:
	हाल WM8962_CHARGE_PUMP_1:
	हाल WM8962_CHARGE_PUMP_B:
	हाल WM8962_WRITE_SEQUENCER_CONTROL_1:
	हाल WM8962_WRITE_SEQUENCER_CONTROL_2:
	हाल WM8962_WRITE_SEQUENCER_CONTROL_3:
	हाल WM8962_CONTROL_INTERFACE:
	हाल WM8962_MIXER_ENABLES:
	हाल WM8962_HEADPHONE_MIXER_1:
	हाल WM8962_HEADPHONE_MIXER_2:
	हाल WM8962_HEADPHONE_MIXER_3:
	हाल WM8962_HEADPHONE_MIXER_4:
	हाल WM8962_SPEAKER_MIXER_1:
	हाल WM8962_SPEAKER_MIXER_2:
	हाल WM8962_SPEAKER_MIXER_3:
	हाल WM8962_SPEAKER_MIXER_4:
	हाल WM8962_SPEAKER_MIXER_5:
	हाल WM8962_BEEP_GENERATOR_1:
	हाल WM8962_OSCILLATOR_TRIM_3:
	हाल WM8962_OSCILLATOR_TRIM_4:
	हाल WM8962_OSCILLATOR_TRIM_7:
	हाल WM8962_ANALOGUE_CLOCKING1:
	हाल WM8962_ANALOGUE_CLOCKING2:
	हाल WM8962_ANALOGUE_CLOCKING3:
	हाल WM8962_PLL_SOFTWARE_RESET:
	हाल WM8962_PLL2:
	हाल WM8962_PLL_4:
	हाल WM8962_PLL_9:
	हाल WM8962_PLL_10:
	हाल WM8962_PLL_11:
	हाल WM8962_PLL_12:
	हाल WM8962_PLL_13:
	हाल WM8962_PLL_14:
	हाल WM8962_PLL_15:
	हाल WM8962_PLL_16:
	हाल WM8962_FLL_CONTROL_1:
	हाल WM8962_FLL_CONTROL_2:
	हाल WM8962_FLL_CONTROL_3:
	हाल WM8962_FLL_CONTROL_5:
	हाल WM8962_FLL_CONTROL_6:
	हाल WM8962_FLL_CONTROL_7:
	हाल WM8962_FLL_CONTROL_8:
	हाल WM8962_GENERAL_TEST_1:
	हाल WM8962_DF1:
	हाल WM8962_DF2:
	हाल WM8962_DF3:
	हाल WM8962_DF4:
	हाल WM8962_DF5:
	हाल WM8962_DF6:
	हाल WM8962_DF7:
	हाल WM8962_LHPF1:
	हाल WM8962_LHPF2:
	हाल WM8962_THREED1:
	हाल WM8962_THREED2:
	हाल WM8962_THREED3:
	हाल WM8962_THREED4:
	हाल WM8962_DRC_1:
	हाल WM8962_DRC_2:
	हाल WM8962_DRC_3:
	हाल WM8962_DRC_4:
	हाल WM8962_DRC_5:
	हाल WM8962_TLOOPBACK:
	हाल WM8962_EQ1:
	हाल WM8962_EQ2:
	हाल WM8962_EQ3:
	हाल WM8962_EQ4:
	हाल WM8962_EQ5:
	हाल WM8962_EQ6:
	हाल WM8962_EQ7:
	हाल WM8962_EQ8:
	हाल WM8962_EQ9:
	हाल WM8962_EQ10:
	हाल WM8962_EQ11:
	हाल WM8962_EQ12:
	हाल WM8962_EQ13:
	हाल WM8962_EQ14:
	हाल WM8962_EQ15:
	हाल WM8962_EQ16:
	हाल WM8962_EQ17:
	हाल WM8962_EQ18:
	हाल WM8962_EQ19:
	हाल WM8962_EQ20:
	हाल WM8962_EQ21:
	हाल WM8962_EQ22:
	हाल WM8962_EQ23:
	हाल WM8962_EQ24:
	हाल WM8962_EQ25:
	हाल WM8962_EQ26:
	हाल WM8962_EQ27:
	हाल WM8962_EQ28:
	हाल WM8962_EQ29:
	हाल WM8962_EQ30:
	हाल WM8962_EQ31:
	हाल WM8962_EQ32:
	हाल WM8962_EQ33:
	हाल WM8962_EQ34:
	हाल WM8962_EQ35:
	हाल WM8962_EQ36:
	हाल WM8962_EQ37:
	हाल WM8962_EQ38:
	हाल WM8962_EQ39:
	हाल WM8962_EQ40:
	हाल WM8962_EQ41:
	हाल WM8962_GPIO_2:
	हाल WM8962_GPIO_3:
	हाल WM8962_GPIO_5:
	हाल WM8962_GPIO_6:
	हाल WM8962_INTERRUPT_STATUS_1:
	हाल WM8962_INTERRUPT_STATUS_2:
	हाल WM8962_INTERRUPT_STATUS_1_MASK:
	हाल WM8962_INTERRUPT_STATUS_2_MASK:
	हाल WM8962_INTERRUPT_CONTROL:
	हाल WM8962_IRQ_DEBOUNCE:
	हाल WM8962_MICINT_SOURCE_POL:
	हाल WM8962_DSP2_POWER_MANAGEMENT:
	हाल WM8962_DSP2_EXECCONTROL:
	हाल WM8962_DSP2_INSTRUCTION_RAM_0:
	हाल WM8962_DSP2_ADDRESS_RAM_2:
	हाल WM8962_DSP2_ADDRESS_RAM_1:
	हाल WM8962_DSP2_ADDRESS_RAM_0:
	हाल WM8962_DSP2_DATA1_RAM_1:
	हाल WM8962_DSP2_DATA1_RAM_0:
	हाल WM8962_DSP2_DATA2_RAM_1:
	हाल WM8962_DSP2_DATA2_RAM_0:
	हाल WM8962_DSP2_DATA3_RAM_1:
	हाल WM8962_DSP2_DATA3_RAM_0:
	हाल WM8962_DSP2_COEFF_RAM_0:
	हाल WM8962_RETUNEADC_SHARED_COEFF_1:
	हाल WM8962_RETUNEADC_SHARED_COEFF_0:
	हाल WM8962_RETUNEDAC_SHARED_COEFF_1:
	हाल WM8962_RETUNEDAC_SHARED_COEFF_0:
	हाल WM8962_SOUNDSTAGE_ENABLES_1:
	हाल WM8962_SOUNDSTAGE_ENABLES_0:
	हाल WM8962_HDBASS_AI_1:
	हाल WM8962_HDBASS_AI_0:
	हाल WM8962_HDBASS_AR_1:
	हाल WM8962_HDBASS_AR_0:
	हाल WM8962_HDBASS_B_1:
	हाल WM8962_HDBASS_B_0:
	हाल WM8962_HDBASS_K_1:
	हाल WM8962_HDBASS_K_0:
	हाल WM8962_HDBASS_N1_1:
	हाल WM8962_HDBASS_N1_0:
	हाल WM8962_HDBASS_N2_1:
	हाल WM8962_HDBASS_N2_0:
	हाल WM8962_HDBASS_N3_1:
	हाल WM8962_HDBASS_N3_0:
	हाल WM8962_HDBASS_N4_1:
	हाल WM8962_HDBASS_N4_0:
	हाल WM8962_HDBASS_N5_1:
	हाल WM8962_HDBASS_N5_0:
	हाल WM8962_HDBASS_X1_1:
	हाल WM8962_HDBASS_X1_0:
	हाल WM8962_HDBASS_X2_1:
	हाल WM8962_HDBASS_X2_0:
	हाल WM8962_HDBASS_X3_1:
	हाल WM8962_HDBASS_X3_0:
	हाल WM8962_HDBASS_ATK_1:
	हाल WM8962_HDBASS_ATK_0:
	हाल WM8962_HDBASS_DCY_1:
	हाल WM8962_HDBASS_DCY_0:
	हाल WM8962_HDBASS_PG_1:
	हाल WM8962_HDBASS_PG_0:
	हाल WM8962_HPF_C_1:
	हाल WM8962_HPF_C_0:
	हाल WM8962_ADCL_RETUNE_C1_1:
	हाल WM8962_ADCL_RETUNE_C1_0:
	हाल WM8962_ADCL_RETUNE_C2_1:
	हाल WM8962_ADCL_RETUNE_C2_0:
	हाल WM8962_ADCL_RETUNE_C3_1:
	हाल WM8962_ADCL_RETUNE_C3_0:
	हाल WM8962_ADCL_RETUNE_C4_1:
	हाल WM8962_ADCL_RETUNE_C4_0:
	हाल WM8962_ADCL_RETUNE_C5_1:
	हाल WM8962_ADCL_RETUNE_C5_0:
	हाल WM8962_ADCL_RETUNE_C6_1:
	हाल WM8962_ADCL_RETUNE_C6_0:
	हाल WM8962_ADCL_RETUNE_C7_1:
	हाल WM8962_ADCL_RETUNE_C7_0:
	हाल WM8962_ADCL_RETUNE_C8_1:
	हाल WM8962_ADCL_RETUNE_C8_0:
	हाल WM8962_ADCL_RETUNE_C9_1:
	हाल WM8962_ADCL_RETUNE_C9_0:
	हाल WM8962_ADCL_RETUNE_C10_1:
	हाल WM8962_ADCL_RETUNE_C10_0:
	हाल WM8962_ADCL_RETUNE_C11_1:
	हाल WM8962_ADCL_RETUNE_C11_0:
	हाल WM8962_ADCL_RETUNE_C12_1:
	हाल WM8962_ADCL_RETUNE_C12_0:
	हाल WM8962_ADCL_RETUNE_C13_1:
	हाल WM8962_ADCL_RETUNE_C13_0:
	हाल WM8962_ADCL_RETUNE_C14_1:
	हाल WM8962_ADCL_RETUNE_C14_0:
	हाल WM8962_ADCL_RETUNE_C15_1:
	हाल WM8962_ADCL_RETUNE_C15_0:
	हाल WM8962_ADCL_RETUNE_C16_1:
	हाल WM8962_ADCL_RETUNE_C16_0:
	हाल WM8962_ADCL_RETUNE_C17_1:
	हाल WM8962_ADCL_RETUNE_C17_0:
	हाल WM8962_ADCL_RETUNE_C18_1:
	हाल WM8962_ADCL_RETUNE_C18_0:
	हाल WM8962_ADCL_RETUNE_C19_1:
	हाल WM8962_ADCL_RETUNE_C19_0:
	हाल WM8962_ADCL_RETUNE_C20_1:
	हाल WM8962_ADCL_RETUNE_C20_0:
	हाल WM8962_ADCL_RETUNE_C21_1:
	हाल WM8962_ADCL_RETUNE_C21_0:
	हाल WM8962_ADCL_RETUNE_C22_1:
	हाल WM8962_ADCL_RETUNE_C22_0:
	हाल WM8962_ADCL_RETUNE_C23_1:
	हाल WM8962_ADCL_RETUNE_C23_0:
	हाल WM8962_ADCL_RETUNE_C24_1:
	हाल WM8962_ADCL_RETUNE_C24_0:
	हाल WM8962_ADCL_RETUNE_C25_1:
	हाल WM8962_ADCL_RETUNE_C25_0:
	हाल WM8962_ADCL_RETUNE_C26_1:
	हाल WM8962_ADCL_RETUNE_C26_0:
	हाल WM8962_ADCL_RETUNE_C27_1:
	हाल WM8962_ADCL_RETUNE_C27_0:
	हाल WM8962_ADCL_RETUNE_C28_1:
	हाल WM8962_ADCL_RETUNE_C28_0:
	हाल WM8962_ADCL_RETUNE_C29_1:
	हाल WM8962_ADCL_RETUNE_C29_0:
	हाल WM8962_ADCL_RETUNE_C30_1:
	हाल WM8962_ADCL_RETUNE_C30_0:
	हाल WM8962_ADCL_RETUNE_C31_1:
	हाल WM8962_ADCL_RETUNE_C31_0:
	हाल WM8962_ADCL_RETUNE_C32_1:
	हाल WM8962_ADCL_RETUNE_C32_0:
	हाल WM8962_RETUNEADC_PG2_1:
	हाल WM8962_RETUNEADC_PG2_0:
	हाल WM8962_RETUNEADC_PG_1:
	हाल WM8962_RETUNEADC_PG_0:
	हाल WM8962_ADCR_RETUNE_C1_1:
	हाल WM8962_ADCR_RETUNE_C1_0:
	हाल WM8962_ADCR_RETUNE_C2_1:
	हाल WM8962_ADCR_RETUNE_C2_0:
	हाल WM8962_ADCR_RETUNE_C3_1:
	हाल WM8962_ADCR_RETUNE_C3_0:
	हाल WM8962_ADCR_RETUNE_C4_1:
	हाल WM8962_ADCR_RETUNE_C4_0:
	हाल WM8962_ADCR_RETUNE_C5_1:
	हाल WM8962_ADCR_RETUNE_C5_0:
	हाल WM8962_ADCR_RETUNE_C6_1:
	हाल WM8962_ADCR_RETUNE_C6_0:
	हाल WM8962_ADCR_RETUNE_C7_1:
	हाल WM8962_ADCR_RETUNE_C7_0:
	हाल WM8962_ADCR_RETUNE_C8_1:
	हाल WM8962_ADCR_RETUNE_C8_0:
	हाल WM8962_ADCR_RETUNE_C9_1:
	हाल WM8962_ADCR_RETUNE_C9_0:
	हाल WM8962_ADCR_RETUNE_C10_1:
	हाल WM8962_ADCR_RETUNE_C10_0:
	हाल WM8962_ADCR_RETUNE_C11_1:
	हाल WM8962_ADCR_RETUNE_C11_0:
	हाल WM8962_ADCR_RETUNE_C12_1:
	हाल WM8962_ADCR_RETUNE_C12_0:
	हाल WM8962_ADCR_RETUNE_C13_1:
	हाल WM8962_ADCR_RETUNE_C13_0:
	हाल WM8962_ADCR_RETUNE_C14_1:
	हाल WM8962_ADCR_RETUNE_C14_0:
	हाल WM8962_ADCR_RETUNE_C15_1:
	हाल WM8962_ADCR_RETUNE_C15_0:
	हाल WM8962_ADCR_RETUNE_C16_1:
	हाल WM8962_ADCR_RETUNE_C16_0:
	हाल WM8962_ADCR_RETUNE_C17_1:
	हाल WM8962_ADCR_RETUNE_C17_0:
	हाल WM8962_ADCR_RETUNE_C18_1:
	हाल WM8962_ADCR_RETUNE_C18_0:
	हाल WM8962_ADCR_RETUNE_C19_1:
	हाल WM8962_ADCR_RETUNE_C19_0:
	हाल WM8962_ADCR_RETUNE_C20_1:
	हाल WM8962_ADCR_RETUNE_C20_0:
	हाल WM8962_ADCR_RETUNE_C21_1:
	हाल WM8962_ADCR_RETUNE_C21_0:
	हाल WM8962_ADCR_RETUNE_C22_1:
	हाल WM8962_ADCR_RETUNE_C22_0:
	हाल WM8962_ADCR_RETUNE_C23_1:
	हाल WM8962_ADCR_RETUNE_C23_0:
	हाल WM8962_ADCR_RETUNE_C24_1:
	हाल WM8962_ADCR_RETUNE_C24_0:
	हाल WM8962_ADCR_RETUNE_C25_1:
	हाल WM8962_ADCR_RETUNE_C25_0:
	हाल WM8962_ADCR_RETUNE_C26_1:
	हाल WM8962_ADCR_RETUNE_C26_0:
	हाल WM8962_ADCR_RETUNE_C27_1:
	हाल WM8962_ADCR_RETUNE_C27_0:
	हाल WM8962_ADCR_RETUNE_C28_1:
	हाल WM8962_ADCR_RETUNE_C28_0:
	हाल WM8962_ADCR_RETUNE_C29_1:
	हाल WM8962_ADCR_RETUNE_C29_0:
	हाल WM8962_ADCR_RETUNE_C30_1:
	हाल WM8962_ADCR_RETUNE_C30_0:
	हाल WM8962_ADCR_RETUNE_C31_1:
	हाल WM8962_ADCR_RETUNE_C31_0:
	हाल WM8962_ADCR_RETUNE_C32_1:
	हाल WM8962_ADCR_RETUNE_C32_0:
	हाल WM8962_DACL_RETUNE_C1_1:
	हाल WM8962_DACL_RETUNE_C1_0:
	हाल WM8962_DACL_RETUNE_C2_1:
	हाल WM8962_DACL_RETUNE_C2_0:
	हाल WM8962_DACL_RETUNE_C3_1:
	हाल WM8962_DACL_RETUNE_C3_0:
	हाल WM8962_DACL_RETUNE_C4_1:
	हाल WM8962_DACL_RETUNE_C4_0:
	हाल WM8962_DACL_RETUNE_C5_1:
	हाल WM8962_DACL_RETUNE_C5_0:
	हाल WM8962_DACL_RETUNE_C6_1:
	हाल WM8962_DACL_RETUNE_C6_0:
	हाल WM8962_DACL_RETUNE_C7_1:
	हाल WM8962_DACL_RETUNE_C7_0:
	हाल WM8962_DACL_RETUNE_C8_1:
	हाल WM8962_DACL_RETUNE_C8_0:
	हाल WM8962_DACL_RETUNE_C9_1:
	हाल WM8962_DACL_RETUNE_C9_0:
	हाल WM8962_DACL_RETUNE_C10_1:
	हाल WM8962_DACL_RETUNE_C10_0:
	हाल WM8962_DACL_RETUNE_C11_1:
	हाल WM8962_DACL_RETUNE_C11_0:
	हाल WM8962_DACL_RETUNE_C12_1:
	हाल WM8962_DACL_RETUNE_C12_0:
	हाल WM8962_DACL_RETUNE_C13_1:
	हाल WM8962_DACL_RETUNE_C13_0:
	हाल WM8962_DACL_RETUNE_C14_1:
	हाल WM8962_DACL_RETUNE_C14_0:
	हाल WM8962_DACL_RETUNE_C15_1:
	हाल WM8962_DACL_RETUNE_C15_0:
	हाल WM8962_DACL_RETUNE_C16_1:
	हाल WM8962_DACL_RETUNE_C16_0:
	हाल WM8962_DACL_RETUNE_C17_1:
	हाल WM8962_DACL_RETUNE_C17_0:
	हाल WM8962_DACL_RETUNE_C18_1:
	हाल WM8962_DACL_RETUNE_C18_0:
	हाल WM8962_DACL_RETUNE_C19_1:
	हाल WM8962_DACL_RETUNE_C19_0:
	हाल WM8962_DACL_RETUNE_C20_1:
	हाल WM8962_DACL_RETUNE_C20_0:
	हाल WM8962_DACL_RETUNE_C21_1:
	हाल WM8962_DACL_RETUNE_C21_0:
	हाल WM8962_DACL_RETUNE_C22_1:
	हाल WM8962_DACL_RETUNE_C22_0:
	हाल WM8962_DACL_RETUNE_C23_1:
	हाल WM8962_DACL_RETUNE_C23_0:
	हाल WM8962_DACL_RETUNE_C24_1:
	हाल WM8962_DACL_RETUNE_C24_0:
	हाल WM8962_DACL_RETUNE_C25_1:
	हाल WM8962_DACL_RETUNE_C25_0:
	हाल WM8962_DACL_RETUNE_C26_1:
	हाल WM8962_DACL_RETUNE_C26_0:
	हाल WM8962_DACL_RETUNE_C27_1:
	हाल WM8962_DACL_RETUNE_C27_0:
	हाल WM8962_DACL_RETUNE_C28_1:
	हाल WM8962_DACL_RETUNE_C28_0:
	हाल WM8962_DACL_RETUNE_C29_1:
	हाल WM8962_DACL_RETUNE_C29_0:
	हाल WM8962_DACL_RETUNE_C30_1:
	हाल WM8962_DACL_RETUNE_C30_0:
	हाल WM8962_DACL_RETUNE_C31_1:
	हाल WM8962_DACL_RETUNE_C31_0:
	हाल WM8962_DACL_RETUNE_C32_1:
	हाल WM8962_DACL_RETUNE_C32_0:
	हाल WM8962_RETUNEDAC_PG2_1:
	हाल WM8962_RETUNEDAC_PG2_0:
	हाल WM8962_RETUNEDAC_PG_1:
	हाल WM8962_RETUNEDAC_PG_0:
	हाल WM8962_DACR_RETUNE_C1_1:
	हाल WM8962_DACR_RETUNE_C1_0:
	हाल WM8962_DACR_RETUNE_C2_1:
	हाल WM8962_DACR_RETUNE_C2_0:
	हाल WM8962_DACR_RETUNE_C3_1:
	हाल WM8962_DACR_RETUNE_C3_0:
	हाल WM8962_DACR_RETUNE_C4_1:
	हाल WM8962_DACR_RETUNE_C4_0:
	हाल WM8962_DACR_RETUNE_C5_1:
	हाल WM8962_DACR_RETUNE_C5_0:
	हाल WM8962_DACR_RETUNE_C6_1:
	हाल WM8962_DACR_RETUNE_C6_0:
	हाल WM8962_DACR_RETUNE_C7_1:
	हाल WM8962_DACR_RETUNE_C7_0:
	हाल WM8962_DACR_RETUNE_C8_1:
	हाल WM8962_DACR_RETUNE_C8_0:
	हाल WM8962_DACR_RETUNE_C9_1:
	हाल WM8962_DACR_RETUNE_C9_0:
	हाल WM8962_DACR_RETUNE_C10_1:
	हाल WM8962_DACR_RETUNE_C10_0:
	हाल WM8962_DACR_RETUNE_C11_1:
	हाल WM8962_DACR_RETUNE_C11_0:
	हाल WM8962_DACR_RETUNE_C12_1:
	हाल WM8962_DACR_RETUNE_C12_0:
	हाल WM8962_DACR_RETUNE_C13_1:
	हाल WM8962_DACR_RETUNE_C13_0:
	हाल WM8962_DACR_RETUNE_C14_1:
	हाल WM8962_DACR_RETUNE_C14_0:
	हाल WM8962_DACR_RETUNE_C15_1:
	हाल WM8962_DACR_RETUNE_C15_0:
	हाल WM8962_DACR_RETUNE_C16_1:
	हाल WM8962_DACR_RETUNE_C16_0:
	हाल WM8962_DACR_RETUNE_C17_1:
	हाल WM8962_DACR_RETUNE_C17_0:
	हाल WM8962_DACR_RETUNE_C18_1:
	हाल WM8962_DACR_RETUNE_C18_0:
	हाल WM8962_DACR_RETUNE_C19_1:
	हाल WM8962_DACR_RETUNE_C19_0:
	हाल WM8962_DACR_RETUNE_C20_1:
	हाल WM8962_DACR_RETUNE_C20_0:
	हाल WM8962_DACR_RETUNE_C21_1:
	हाल WM8962_DACR_RETUNE_C21_0:
	हाल WM8962_DACR_RETUNE_C22_1:
	हाल WM8962_DACR_RETUNE_C22_0:
	हाल WM8962_DACR_RETUNE_C23_1:
	हाल WM8962_DACR_RETUNE_C23_0:
	हाल WM8962_DACR_RETUNE_C24_1:
	हाल WM8962_DACR_RETUNE_C24_0:
	हाल WM8962_DACR_RETUNE_C25_1:
	हाल WM8962_DACR_RETUNE_C25_0:
	हाल WM8962_DACR_RETUNE_C26_1:
	हाल WM8962_DACR_RETUNE_C26_0:
	हाल WM8962_DACR_RETUNE_C27_1:
	हाल WM8962_DACR_RETUNE_C27_0:
	हाल WM8962_DACR_RETUNE_C28_1:
	हाल WM8962_DACR_RETUNE_C28_0:
	हाल WM8962_DACR_RETUNE_C29_1:
	हाल WM8962_DACR_RETUNE_C29_0:
	हाल WM8962_DACR_RETUNE_C30_1:
	हाल WM8962_DACR_RETUNE_C30_0:
	हाल WM8962_DACR_RETUNE_C31_1:
	हाल WM8962_DACR_RETUNE_C31_0:
	हाल WM8962_DACR_RETUNE_C32_1:
	हाल WM8962_DACR_RETUNE_C32_0:
	हाल WM8962_VSS_XHD2_1:
	हाल WM8962_VSS_XHD2_0:
	हाल WM8962_VSS_XHD3_1:
	हाल WM8962_VSS_XHD3_0:
	हाल WM8962_VSS_XHN1_1:
	हाल WM8962_VSS_XHN1_0:
	हाल WM8962_VSS_XHN2_1:
	हाल WM8962_VSS_XHN2_0:
	हाल WM8962_VSS_XHN3_1:
	हाल WM8962_VSS_XHN3_0:
	हाल WM8962_VSS_XLA_1:
	हाल WM8962_VSS_XLA_0:
	हाल WM8962_VSS_XLB_1:
	हाल WM8962_VSS_XLB_0:
	हाल WM8962_VSS_XLG_1:
	हाल WM8962_VSS_XLG_0:
	हाल WM8962_VSS_PG2_1:
	हाल WM8962_VSS_PG2_0:
	हाल WM8962_VSS_PG_1:
	हाल WM8962_VSS_PG_0:
	हाल WM8962_VSS_XTD1_1:
	हाल WM8962_VSS_XTD1_0:
	हाल WM8962_VSS_XTD2_1:
	हाल WM8962_VSS_XTD2_0:
	हाल WM8962_VSS_XTD3_1:
	हाल WM8962_VSS_XTD3_0:
	हाल WM8962_VSS_XTD4_1:
	हाल WM8962_VSS_XTD4_0:
	हाल WM8962_VSS_XTD5_1:
	हाल WM8962_VSS_XTD5_0:
	हाल WM8962_VSS_XTD6_1:
	हाल WM8962_VSS_XTD6_0:
	हाल WM8962_VSS_XTD7_1:
	हाल WM8962_VSS_XTD7_0:
	हाल WM8962_VSS_XTD8_1:
	हाल WM8962_VSS_XTD8_0:
	हाल WM8962_VSS_XTD9_1:
	हाल WM8962_VSS_XTD9_0:
	हाल WM8962_VSS_XTD10_1:
	हाल WM8962_VSS_XTD10_0:
	हाल WM8962_VSS_XTD11_1:
	हाल WM8962_VSS_XTD11_0:
	हाल WM8962_VSS_XTD12_1:
	हाल WM8962_VSS_XTD12_0:
	हाल WM8962_VSS_XTD13_1:
	हाल WM8962_VSS_XTD13_0:
	हाल WM8962_VSS_XTD14_1:
	हाल WM8962_VSS_XTD14_0:
	हाल WM8962_VSS_XTD15_1:
	हाल WM8962_VSS_XTD15_0:
	हाल WM8962_VSS_XTD16_1:
	हाल WM8962_VSS_XTD16_0:
	हाल WM8962_VSS_XTD17_1:
	हाल WM8962_VSS_XTD17_0:
	हाल WM8962_VSS_XTD18_1:
	हाल WM8962_VSS_XTD18_0:
	हाल WM8962_VSS_XTD19_1:
	हाल WM8962_VSS_XTD19_0:
	हाल WM8962_VSS_XTD20_1:
	हाल WM8962_VSS_XTD20_0:
	हाल WM8962_VSS_XTD21_1:
	हाल WM8962_VSS_XTD21_0:
	हाल WM8962_VSS_XTD22_1:
	हाल WM8962_VSS_XTD22_0:
	हाल WM8962_VSS_XTD23_1:
	हाल WM8962_VSS_XTD23_0:
	हाल WM8962_VSS_XTD24_1:
	हाल WM8962_VSS_XTD24_0:
	हाल WM8962_VSS_XTD25_1:
	हाल WM8962_VSS_XTD25_0:
	हाल WM8962_VSS_XTD26_1:
	हाल WM8962_VSS_XTD26_0:
	हाल WM8962_VSS_XTD27_1:
	हाल WM8962_VSS_XTD27_0:
	हाल WM8962_VSS_XTD28_1:
	हाल WM8962_VSS_XTD28_0:
	हाल WM8962_VSS_XTD29_1:
	हाल WM8962_VSS_XTD29_0:
	हाल WM8962_VSS_XTD30_1:
	हाल WM8962_VSS_XTD30_0:
	हाल WM8962_VSS_XTD31_1:
	हाल WM8962_VSS_XTD31_0:
	हाल WM8962_VSS_XTD32_1:
	हाल WM8962_VSS_XTD32_0:
	हाल WM8962_VSS_XTS1_1:
	हाल WM8962_VSS_XTS1_0:
	हाल WM8962_VSS_XTS2_1:
	हाल WM8962_VSS_XTS2_0:
	हाल WM8962_VSS_XTS3_1:
	हाल WM8962_VSS_XTS3_0:
	हाल WM8962_VSS_XTS4_1:
	हाल WM8962_VSS_XTS4_0:
	हाल WM8962_VSS_XTS5_1:
	हाल WM8962_VSS_XTS5_0:
	हाल WM8962_VSS_XTS6_1:
	हाल WM8962_VSS_XTS6_0:
	हाल WM8962_VSS_XTS7_1:
	हाल WM8962_VSS_XTS7_0:
	हाल WM8962_VSS_XTS8_1:
	हाल WM8962_VSS_XTS8_0:
	हाल WM8962_VSS_XTS9_1:
	हाल WM8962_VSS_XTS9_0:
	हाल WM8962_VSS_XTS10_1:
	हाल WM8962_VSS_XTS10_0:
	हाल WM8962_VSS_XTS11_1:
	हाल WM8962_VSS_XTS11_0:
	हाल WM8962_VSS_XTS12_1:
	हाल WM8962_VSS_XTS12_0:
	हाल WM8962_VSS_XTS13_1:
	हाल WM8962_VSS_XTS13_0:
	हाल WM8962_VSS_XTS14_1:
	हाल WM8962_VSS_XTS14_0:
	हाल WM8962_VSS_XTS15_1:
	हाल WM8962_VSS_XTS15_0:
	हाल WM8962_VSS_XTS16_1:
	हाल WM8962_VSS_XTS16_0:
	हाल WM8962_VSS_XTS17_1:
	हाल WM8962_VSS_XTS17_0:
	हाल WM8962_VSS_XTS18_1:
	हाल WM8962_VSS_XTS18_0:
	हाल WM8962_VSS_XTS19_1:
	हाल WM8962_VSS_XTS19_0:
	हाल WM8962_VSS_XTS20_1:
	हाल WM8962_VSS_XTS20_0:
	हाल WM8962_VSS_XTS21_1:
	हाल WM8962_VSS_XTS21_0:
	हाल WM8962_VSS_XTS22_1:
	हाल WM8962_VSS_XTS22_0:
	हाल WM8962_VSS_XTS23_1:
	हाल WM8962_VSS_XTS23_0:
	हाल WM8962_VSS_XTS24_1:
	हाल WM8962_VSS_XTS24_0:
	हाल WM8962_VSS_XTS25_1:
	हाल WM8962_VSS_XTS25_0:
	हाल WM8962_VSS_XTS26_1:
	हाल WM8962_VSS_XTS26_0:
	हाल WM8962_VSS_XTS27_1:
	हाल WM8962_VSS_XTS27_0:
	हाल WM8962_VSS_XTS28_1:
	हाल WM8962_VSS_XTS28_0:
	हाल WM8962_VSS_XTS29_1:
	हाल WM8962_VSS_XTS29_0:
	हाल WM8962_VSS_XTS30_1:
	हाल WM8962_VSS_XTS30_0:
	हाल WM8962_VSS_XTS31_1:
	हाल WM8962_VSS_XTS31_0:
	हाल WM8962_VSS_XTS32_1:
	हाल WM8962_VSS_XTS32_0:
		वापस true;
	शेष:
		वापस false;
	पूर्ण
पूर्ण

अटल पूर्णांक wm8962_reset(काष्ठा wm8962_priv *wm8962)
अणु
	पूर्णांक ret;

	ret = regmap_ग_लिखो(wm8962->regmap, WM8962_SOFTWARE_RESET, 0x6243);
	अगर (ret != 0)
		वापस ret;

	वापस regmap_ग_लिखो(wm8962->regmap, WM8962_PLL_SOFTWARE_RESET, 0);
पूर्ण

अटल स्थिर DECLARE_TLV_DB_SCALE(inpga_tlv, -2325, 75, 0);
अटल स्थिर DECLARE_TLV_DB_SCALE(mixin_tlv, -1500, 300, 0);
अटल स्थिर DECLARE_TLV_DB_RANGE(mixinpga_tlv,
	0, 1, TLV_DB_SCALE_ITEM(0, 600, 0),
	2, 2, TLV_DB_SCALE_ITEM(1300, 1300, 0),
	3, 4, TLV_DB_SCALE_ITEM(1800, 200, 0),
	5, 5, TLV_DB_SCALE_ITEM(2400, 0, 0),
	6, 7, TLV_DB_SCALE_ITEM(2700, 300, 0)
);
अटल स्थिर DECLARE_TLV_DB_SCALE(beep_tlv, -9600, 600, 1);
अटल स्थिर DECLARE_TLV_DB_SCALE(digital_tlv, -7200, 75, 1);
अटल स्थिर DECLARE_TLV_DB_SCALE(st_tlv, -3600, 300, 0);
अटल स्थिर DECLARE_TLV_DB_SCALE(inmix_tlv, -600, 600, 0);
अटल स्थिर DECLARE_TLV_DB_SCALE(bypass_tlv, -1500, 300, 0);
अटल स्थिर DECLARE_TLV_DB_SCALE(out_tlv, -12100, 100, 1);
अटल स्थिर DECLARE_TLV_DB_SCALE(hp_tlv, -700, 100, 0);
अटल स्थिर DECLARE_TLV_DB_RANGE(classd_tlv,
	0, 6, TLV_DB_SCALE_ITEM(0, 150, 0),
	7, 7, TLV_DB_SCALE_ITEM(1200, 0, 0)
);
अटल स्थिर DECLARE_TLV_DB_SCALE(eq_tlv, -1200, 100, 0);

अटल पूर्णांक wm8962_dsp2_ग_लिखो_config(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	वापस regcache_sync_region(wm8962->regmap,
				    WM8962_HDBASS_AI_1, WM8962_MAX_REGISTER);
पूर्ण

अटल पूर्णांक wm8962_dsp2_set_enable(काष्ठा snd_soc_component *component, u16 val)
अणु
	u16 adcl = snd_soc_component_पढ़ो(component, WM8962_LEFT_ADC_VOLUME);
	u16 adcr = snd_soc_component_पढ़ो(component, WM8962_RIGHT_ADC_VOLUME);
	u16 dac = snd_soc_component_पढ़ो(component, WM8962_ADC_DAC_CONTROL_1);

	/* Mute the ADCs and DACs */
	snd_soc_component_ग_लिखो(component, WM8962_LEFT_ADC_VOLUME, 0);
	snd_soc_component_ग_लिखो(component, WM8962_RIGHT_ADC_VOLUME, WM8962_ADC_VU);
	snd_soc_component_update_bits(component, WM8962_ADC_DAC_CONTROL_1,
			    WM8962_DAC_MUTE, WM8962_DAC_MUTE);

	snd_soc_component_ग_लिखो(component, WM8962_SOUNDSTAGE_ENABLES_0, val);

	/* Restore the ADCs and DACs */
	snd_soc_component_ग_लिखो(component, WM8962_LEFT_ADC_VOLUME, adcl);
	snd_soc_component_ग_लिखो(component, WM8962_RIGHT_ADC_VOLUME, adcr);
	snd_soc_component_update_bits(component, WM8962_ADC_DAC_CONTROL_1,
			    WM8962_DAC_MUTE, dac);

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_dsp2_start(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	wm8962_dsp2_ग_लिखो_config(component);

	snd_soc_component_ग_लिखो(component, WM8962_DSP2_EXECCONTROL, WM8962_DSP2_RUNR);

	wm8962_dsp2_set_enable(component, wm8962->dsp2_ena);

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_dsp2_stop(काष्ठा snd_soc_component *component)
अणु
	wm8962_dsp2_set_enable(component, 0);

	snd_soc_component_ग_लिखो(component, WM8962_DSP2_EXECCONTROL, WM8962_DSP2_STOP);

	वापस 0;
पूर्ण

#घोषणा WM8962_DSP2_ENABLE(xname, xshअगरt) \
अणु	.अगरace = SNDRV_CTL_ELEM_IFACE_MIXER, .name = xname, \
	.info = wm8962_dsp2_ena_info, \
	.get = wm8962_dsp2_ena_get, .put = wm8962_dsp2_ena_put, \
	.निजी_value = xshअगरt पूर्ण

अटल पूर्णांक wm8962_dsp2_ena_info(काष्ठा snd_kcontrol *kcontrol,
				काष्ठा snd_ctl_elem_info *uinfo)
अणु
	uinfo->type = SNDRV_CTL_ELEM_TYPE_BOOLEAN;

	uinfo->count = 1;
	uinfo->value.पूर्णांकeger.min = 0;
	uinfo->value.पूर्णांकeger.max = 1;

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_dsp2_ena_get(काष्ठा snd_kcontrol *kcontrol,
			       काष्ठा snd_ctl_elem_value *ucontrol)
अणु
	पूर्णांक shअगरt = kcontrol->निजी_value;
	काष्ठा snd_soc_component *component = snd_soc_kcontrol_component(kcontrol);
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	ucontrol->value.पूर्णांकeger.value[0] = !!(wm8962->dsp2_ena & 1 << shअगरt);

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_dsp2_ena_put(काष्ठा snd_kcontrol *kcontrol,
			       काष्ठा snd_ctl_elem_value *ucontrol)
अणु
	पूर्णांक shअगरt = kcontrol->निजी_value;
	काष्ठा snd_soc_component *component = snd_soc_kcontrol_component(kcontrol);
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	पूर्णांक old = wm8962->dsp2_ena;
	पूर्णांक ret = 0;
	पूर्णांक dsp2_running = snd_soc_component_पढ़ो(component, WM8962_DSP2_POWER_MANAGEMENT) &
		WM8962_DSP2_ENA;

	mutex_lock(&wm8962->dsp2_ena_lock);

	अगर (ucontrol->value.पूर्णांकeger.value[0])
		wm8962->dsp2_ena |= 1 << shअगरt;
	अन्यथा
		wm8962->dsp2_ena &= ~(1 << shअगरt);

	अगर (wm8962->dsp2_ena == old)
		जाओ out;

	ret = 1;

	अगर (dsp2_running) अणु
		अगर (wm8962->dsp2_ena)
			wm8962_dsp2_set_enable(component, wm8962->dsp2_ena);
		अन्यथा
			wm8962_dsp2_stop(component);
	पूर्ण

out:
	mutex_unlock(&wm8962->dsp2_ena_lock);

	वापस ret;
पूर्ण

/* The VU bits क्रम the headphones are in a dअगरferent रेजिस्टर to the mute
 * bits and only take effect on the PGA अगर it is actually घातered.
 */
अटल पूर्णांक wm8962_put_hp_sw(काष्ठा snd_kcontrol *kcontrol,
			    काष्ठा snd_ctl_elem_value *ucontrol)
अणु
	काष्ठा snd_soc_component *component = snd_soc_kcontrol_component(kcontrol);
	पूर्णांक ret;

	/* Apply the update (अगर any) */
        ret = snd_soc_put_volsw(kcontrol, ucontrol);
	अगर (ret == 0)
		वापस 0;

	/* If the left PGA is enabled hit that VU bit... */
	ret = snd_soc_component_पढ़ो(component, WM8962_PWR_MGMT_2);
	अगर (ret & WM8962_HPOUTL_PGA_ENA) अणु
		snd_soc_component_ग_लिखो(component, WM8962_HPOUTL_VOLUME,
			      snd_soc_component_पढ़ो(component, WM8962_HPOUTL_VOLUME));
		वापस 1;
	पूर्ण

	/* ...otherwise the right.  The VU is stereo. */
	अगर (ret & WM8962_HPOUTR_PGA_ENA)
		snd_soc_component_ग_लिखो(component, WM8962_HPOUTR_VOLUME,
			      snd_soc_component_पढ़ो(component, WM8962_HPOUTR_VOLUME));

	वापस 1;
पूर्ण

/* The VU bits क्रम the speakers are in a dअगरferent रेजिस्टर to the mute
 * bits and only take effect on the PGA अगर it is actually घातered.
 */
अटल पूर्णांक wm8962_put_spk_sw(काष्ठा snd_kcontrol *kcontrol,
			    काष्ठा snd_ctl_elem_value *ucontrol)
अणु
	काष्ठा snd_soc_component *component = snd_soc_kcontrol_component(kcontrol);
	पूर्णांक ret;

	/* Apply the update (अगर any) */
        ret = snd_soc_put_volsw(kcontrol, ucontrol);
	अगर (ret == 0)
		वापस 0;

	/* If the left PGA is enabled hit that VU bit... */
	ret = snd_soc_component_पढ़ो(component, WM8962_PWR_MGMT_2);
	अगर (ret & WM8962_SPKOUTL_PGA_ENA) अणु
		snd_soc_component_ग_लिखो(component, WM8962_SPKOUTL_VOLUME,
			      snd_soc_component_पढ़ो(component, WM8962_SPKOUTL_VOLUME));
		वापस 1;
	पूर्ण

	/* ...otherwise the right.  The VU is stereo. */
	अगर (ret & WM8962_SPKOUTR_PGA_ENA)
		snd_soc_component_ग_लिखो(component, WM8962_SPKOUTR_VOLUME,
			      snd_soc_component_पढ़ो(component, WM8962_SPKOUTR_VOLUME));

	वापस 1;
पूर्ण

अटल स्थिर अक्षर *cap_hpf_mode_text[] = अणु
	"Hi-fi", "Application"
पूर्ण;

अटल SOC_ENUM_SINGLE_DECL(cap_hpf_mode,
			    WM8962_ADC_DAC_CONTROL_2, 10, cap_hpf_mode_text);


अटल स्थिर अक्षर *cap_lhpf_mode_text[] = अणु
	"LPF", "HPF"
पूर्ण;

अटल SOC_ENUM_SINGLE_DECL(cap_lhpf_mode,
			    WM8962_LHPF1, 1, cap_lhpf_mode_text);

अटल स्थिर काष्ठा snd_kcontrol_new wm8962_snd_controls[] = अणु
SOC_DOUBLE("Input Mixer Switch", WM8962_INPUT_MIXER_CONTROL_1, 3, 2, 1, 1),

SOC_SINGLE_TLV("MIXINL IN2L Volume", WM8962_LEFT_INPUT_MIXER_VOLUME, 6, 7, 0,
	       mixin_tlv),
SOC_SINGLE_TLV("MIXINL PGA Volume", WM8962_LEFT_INPUT_MIXER_VOLUME, 3, 7, 0,
	       mixinpga_tlv),
SOC_SINGLE_TLV("MIXINL IN3L Volume", WM8962_LEFT_INPUT_MIXER_VOLUME, 0, 7, 0,
	       mixin_tlv),

SOC_SINGLE_TLV("MIXINR IN2R Volume", WM8962_RIGHT_INPUT_MIXER_VOLUME, 6, 7, 0,
	       mixin_tlv),
SOC_SINGLE_TLV("MIXINR PGA Volume", WM8962_RIGHT_INPUT_MIXER_VOLUME, 3, 7, 0,
	       mixinpga_tlv),
SOC_SINGLE_TLV("MIXINR IN3R Volume", WM8962_RIGHT_INPUT_MIXER_VOLUME, 0, 7, 0,
	       mixin_tlv),

SOC_DOUBLE_R_TLV("Digital Capture Volume", WM8962_LEFT_ADC_VOLUME,
		 WM8962_RIGHT_ADC_VOLUME, 1, 127, 0, digital_tlv),
SOC_DOUBLE_R_TLV("Capture Volume", WM8962_LEFT_INPUT_VOLUME,
		 WM8962_RIGHT_INPUT_VOLUME, 0, 63, 0, inpga_tlv),
SOC_DOUBLE_R("Capture Switch", WM8962_LEFT_INPUT_VOLUME,
	     WM8962_RIGHT_INPUT_VOLUME, 7, 1, 1),
SOC_DOUBLE_R("Capture ZC Switch", WM8962_LEFT_INPUT_VOLUME,
	     WM8962_RIGHT_INPUT_VOLUME, 6, 1, 1),
SOC_SINGLE("Capture HPF Switch", WM8962_ADC_DAC_CONTROL_1, 0, 1, 1),
SOC_ENUM("Capture HPF Mode", cap_hpf_mode),
SOC_SINGLE("Capture HPF Cutoff", WM8962_ADC_DAC_CONTROL_2, 7, 7, 0),
SOC_SINGLE("Capture LHPF Switch", WM8962_LHPF1, 0, 1, 0),
SOC_ENUM("Capture LHPF Mode", cap_lhpf_mode),

SOC_DOUBLE_R_TLV("Sidetone Volume", WM8962_DAC_DSP_MIXING_1,
		 WM8962_DAC_DSP_MIXING_2, 4, 12, 0, st_tlv),

SOC_DOUBLE_R_TLV("Digital Playback Volume", WM8962_LEFT_DAC_VOLUME,
		 WM8962_RIGHT_DAC_VOLUME, 1, 127, 0, digital_tlv),
SOC_SINGLE("DAC High Performance Switch", WM8962_ADC_DAC_CONTROL_2, 0, 1, 0),
SOC_SINGLE("DAC L/R Swap Switch", WM8962_AUDIO_INTERFACE_0, 5, 1, 0),
SOC_SINGLE("ADC L/R Swap Switch", WM8962_AUDIO_INTERFACE_0, 8, 1, 0),
SOC_SINGLE("DAC Monomix Switch", WM8962_DAC_DSP_MIXING_1, WM8962_DAC_MONOMIX_SHIFT, 1, 0),
SOC_SINGLE("ADC Monomix Switch", WM8962_THREED1, WM8962_ADC_MONOMIX_SHIFT, 1, 0),

SOC_SINGLE("ADC High Performance Switch", WM8962_ADDITIONAL_CONTROL_1,
	   5, 1, 0),

SOC_SINGLE_TLV("Beep Volume", WM8962_BEEP_GENERATOR_1, 4, 15, 0, beep_tlv),

SOC_DOUBLE_R_TLV("Headphone Volume", WM8962_HPOUTL_VOLUME,
		 WM8962_HPOUTR_VOLUME, 0, 127, 0, out_tlv),
SOC_DOUBLE_EXT("Headphone Switch", WM8962_PWR_MGMT_2, 1, 0, 1, 1,
	       snd_soc_get_volsw, wm8962_put_hp_sw),
SOC_DOUBLE_R("Headphone ZC Switch", WM8962_HPOUTL_VOLUME, WM8962_HPOUTR_VOLUME,
	     7, 1, 0),
SOC_DOUBLE_TLV("Headphone Aux Volume", WM8962_ANALOGUE_HP_2, 3, 6, 7, 0,
	       hp_tlv),

SOC_DOUBLE_R("Headphone Mixer Switch", WM8962_HEADPHONE_MIXER_3,
	     WM8962_HEADPHONE_MIXER_4, 8, 1, 1),

SOC_SINGLE_TLV("HPMIXL IN4L Volume", WM8962_HEADPHONE_MIXER_3,
	       3, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("HPMIXL IN4R Volume", WM8962_HEADPHONE_MIXER_3,
	       0, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("HPMIXL MIXINL Volume", WM8962_HEADPHONE_MIXER_3,
	       7, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("HPMIXL MIXINR Volume", WM8962_HEADPHONE_MIXER_3,
	       6, 1, 1, inmix_tlv),

SOC_SINGLE_TLV("HPMIXR IN4L Volume", WM8962_HEADPHONE_MIXER_4,
	       3, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("HPMIXR IN4R Volume", WM8962_HEADPHONE_MIXER_4,
	       0, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("HPMIXR MIXINL Volume", WM8962_HEADPHONE_MIXER_4,
	       7, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("HPMIXR MIXINR Volume", WM8962_HEADPHONE_MIXER_4,
	       6, 1, 1, inmix_tlv),

SOC_SINGLE_TLV("Speaker Boost Volume", WM8962_CLASS_D_CONTROL_2, 0, 7, 0,
	       classd_tlv),

SOC_SINGLE("EQ Switch", WM8962_EQ1, WM8962_EQ_ENA_SHIFT, 1, 0),
SOC_DOUBLE_R_TLV("EQ1 Volume", WM8962_EQ2, WM8962_EQ22,
		 WM8962_EQL_B1_GAIN_SHIFT, 31, 0, eq_tlv),
SOC_DOUBLE_R_TLV("EQ2 Volume", WM8962_EQ2, WM8962_EQ22,
		 WM8962_EQL_B2_GAIN_SHIFT, 31, 0, eq_tlv),
SOC_DOUBLE_R_TLV("EQ3 Volume", WM8962_EQ2, WM8962_EQ22,
		 WM8962_EQL_B3_GAIN_SHIFT, 31, 0, eq_tlv),
SOC_DOUBLE_R_TLV("EQ4 Volume", WM8962_EQ3, WM8962_EQ23,
		 WM8962_EQL_B4_GAIN_SHIFT, 31, 0, eq_tlv),
SOC_DOUBLE_R_TLV("EQ5 Volume", WM8962_EQ3, WM8962_EQ23,
		 WM8962_EQL_B5_GAIN_SHIFT, 31, 0, eq_tlv),
SND_SOC_BYTES("EQL Coefficients", WM8962_EQ4, 18),
SND_SOC_BYTES("EQR Coefficients", WM8962_EQ24, 18),


SOC_SINGLE("3D Switch", WM8962_THREED1, 0, 1, 0),
SND_SOC_BYTES_MASK("3D Coefficients", WM8962_THREED1, 4, WM8962_THREED_ENA),

SOC_SINGLE("DF1 Switch", WM8962_DF1, 0, 1, 0),
SND_SOC_BYTES_MASK("DF1 Coefficients", WM8962_DF1, 7, WM8962_DF1_ENA),

SOC_SINGLE("DRC Switch", WM8962_DRC_1, 0, 1, 0),
SND_SOC_BYTES_MASK("DRC Coefficients", WM8962_DRC_1, 5, WM8962_DRC_ENA),

WM8962_DSP2_ENABLE("VSS Switch", WM8962_VSS_ENA_SHIFT),
SND_SOC_BYTES("VSS Coefficients", WM8962_VSS_XHD2_1, 148),
WM8962_DSP2_ENABLE("HPF1 Switch", WM8962_HPF1_ENA_SHIFT),
WM8962_DSP2_ENABLE("HPF2 Switch", WM8962_HPF2_ENA_SHIFT),
SND_SOC_BYTES("HPF Coefficients", WM8962_LHPF2, 1),
WM8962_DSP2_ENABLE("HD Bass Switch", WM8962_HDBASS_ENA_SHIFT),
SND_SOC_BYTES("HD Bass Coefficients", WM8962_HDBASS_AI_1, 30),

SOC_DOUBLE("ALC Switch", WM8962_ALC1, WM8962_ALCL_ENA_SHIFT,
		WM8962_ALCR_ENA_SHIFT, 1, 0),
SND_SOC_BYTES_MASK("ALC Coefficients", WM8962_ALC1, 4,
		WM8962_ALCL_ENA_MASK | WM8962_ALCR_ENA_MASK),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new wm8962_spk_mono_controls[] = अणु
SOC_SINGLE_TLV("Speaker Volume", WM8962_SPKOUTL_VOLUME, 0, 127, 0, out_tlv),
SOC_SINGLE_EXT("Speaker Switch", WM8962_CLASS_D_CONTROL_1, 1, 1, 1,
	       snd_soc_get_volsw, wm8962_put_spk_sw),
SOC_SINGLE("Speaker ZC Switch", WM8962_SPKOUTL_VOLUME, 7, 1, 0),

SOC_SINGLE("Speaker Mixer Switch", WM8962_SPEAKER_MIXER_3, 8, 1, 1),
SOC_SINGLE_TLV("Speaker Mixer IN4L Volume", WM8962_SPEAKER_MIXER_3,
	       3, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("Speaker Mixer IN4R Volume", WM8962_SPEAKER_MIXER_3,
	       0, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("Speaker Mixer MIXINL Volume", WM8962_SPEAKER_MIXER_3,
	       7, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("Speaker Mixer MIXINR Volume", WM8962_SPEAKER_MIXER_3,
	       6, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("Speaker Mixer DACL Volume", WM8962_SPEAKER_MIXER_5,
	       7, 1, 0, inmix_tlv),
SOC_SINGLE_TLV("Speaker Mixer DACR Volume", WM8962_SPEAKER_MIXER_5,
	       6, 1, 0, inmix_tlv),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new wm8962_spk_stereo_controls[] = अणु
SOC_DOUBLE_R_TLV("Speaker Volume", WM8962_SPKOUTL_VOLUME,
		 WM8962_SPKOUTR_VOLUME, 0, 127, 0, out_tlv),
SOC_DOUBLE_EXT("Speaker Switch", WM8962_CLASS_D_CONTROL_1, 1, 0, 1, 1,
	       snd_soc_get_volsw, wm8962_put_spk_sw),
SOC_DOUBLE_R("Speaker ZC Switch", WM8962_SPKOUTL_VOLUME, WM8962_SPKOUTR_VOLUME,
	     7, 1, 0),

SOC_DOUBLE_R("Speaker Mixer Switch", WM8962_SPEAKER_MIXER_3,
	     WM8962_SPEAKER_MIXER_4, 8, 1, 1),

SOC_SINGLE_TLV("SPKOUTL Mixer IN4L Volume", WM8962_SPEAKER_MIXER_3,
	       3, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("SPKOUTL Mixer IN4R Volume", WM8962_SPEAKER_MIXER_3,
	       0, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("SPKOUTL Mixer MIXINL Volume", WM8962_SPEAKER_MIXER_3,
	       7, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("SPKOUTL Mixer MIXINR Volume", WM8962_SPEAKER_MIXER_3,
	       6, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("SPKOUTL Mixer DACL Volume", WM8962_SPEAKER_MIXER_5,
	       7, 1, 0, inmix_tlv),
SOC_SINGLE_TLV("SPKOUTL Mixer DACR Volume", WM8962_SPEAKER_MIXER_5,
	       6, 1, 0, inmix_tlv),

SOC_SINGLE_TLV("SPKOUTR Mixer IN4L Volume", WM8962_SPEAKER_MIXER_4,
	       3, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("SPKOUTR Mixer IN4R Volume", WM8962_SPEAKER_MIXER_4,
	       0, 7, 0, bypass_tlv),
SOC_SINGLE_TLV("SPKOUTR Mixer MIXINL Volume", WM8962_SPEAKER_MIXER_4,
	       7, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("SPKOUTR Mixer MIXINR Volume", WM8962_SPEAKER_MIXER_4,
	       6, 1, 1, inmix_tlv),
SOC_SINGLE_TLV("SPKOUTR Mixer DACL Volume", WM8962_SPEAKER_MIXER_5,
	       5, 1, 0, inmix_tlv),
SOC_SINGLE_TLV("SPKOUTR Mixer DACR Volume", WM8962_SPEAKER_MIXER_5,
	       4, 1, 0, inmix_tlv),
पूर्ण;

अटल पूर्णांक cp_event(काष्ठा snd_soc_dapm_widget *w,
		    काष्ठा snd_kcontrol *kcontrol, पूर्णांक event)
अणु
	चयन (event) अणु
	हाल SND_SOC_DAPM_POST_PMU:
		msleep(5);
		अवरोध;

	शेष:
		WARN(1, "Invalid event %d\n", event);
		वापस -EINVAL;
	पूर्ण

	वापस 0;
पूर्ण

अटल पूर्णांक hp_event(काष्ठा snd_soc_dapm_widget *w,
		    काष्ठा snd_kcontrol *kcontrol, पूर्णांक event)
अणु
	काष्ठा snd_soc_component *component = snd_soc_dapm_to_component(w->dapm);
	पूर्णांक समयout;
	पूर्णांक reg;
	पूर्णांक expected = (WM8962_DCS_STARTUP_DONE_HP1L |
			WM8962_DCS_STARTUP_DONE_HP1R);

	चयन (event) अणु
	हाल SND_SOC_DAPM_POST_PMU:
		snd_soc_component_update_bits(component, WM8962_ANALOGUE_HP_0,
				    WM8962_HP1L_ENA | WM8962_HP1R_ENA,
				    WM8962_HP1L_ENA | WM8962_HP1R_ENA);
		udelay(20);

		snd_soc_component_update_bits(component, WM8962_ANALOGUE_HP_0,
				    WM8962_HP1L_ENA_DLY | WM8962_HP1R_ENA_DLY,
				    WM8962_HP1L_ENA_DLY | WM8962_HP1R_ENA_DLY);

		/* Start the DC servo */
		snd_soc_component_update_bits(component, WM8962_DC_SERVO_1,
				    WM8962_HP1L_DCS_ENA | WM8962_HP1R_DCS_ENA |
				    WM8962_HP1L_DCS_STARTUP |
				    WM8962_HP1R_DCS_STARTUP,
				    WM8962_HP1L_DCS_ENA | WM8962_HP1R_DCS_ENA |
				    WM8962_HP1L_DCS_STARTUP |
				    WM8962_HP1R_DCS_STARTUP);

		/* Wait क्रम it to complete, should be well under 100ms */
		समयout = 0;
		करो अणु
			msleep(1);
			reg = snd_soc_component_पढ़ो(component, WM8962_DC_SERVO_6);
			अगर (reg < 0) अणु
				dev_err(component->dev,
					"Failed to read DCS status: %d\n",
					reg);
				जारी;
			पूर्ण
			dev_dbg(component->dev, "DCS status: %x\n", reg);
		पूर्ण जबतक (++समयout < 200 && (reg & expected) != expected);

		अगर ((reg & expected) != expected)
			dev_err(component->dev, "DC servo timed out\n");
		अन्यथा
			dev_dbg(component->dev, "DC servo complete after %dms\n",
				समयout);

		snd_soc_component_update_bits(component, WM8962_ANALOGUE_HP_0,
				    WM8962_HP1L_ENA_OUTP |
				    WM8962_HP1R_ENA_OUTP,
				    WM8962_HP1L_ENA_OUTP |
				    WM8962_HP1R_ENA_OUTP);
		udelay(20);

		snd_soc_component_update_bits(component, WM8962_ANALOGUE_HP_0,
				    WM8962_HP1L_RMV_SHORT |
				    WM8962_HP1R_RMV_SHORT,
				    WM8962_HP1L_RMV_SHORT |
				    WM8962_HP1R_RMV_SHORT);
		अवरोध;

	हाल SND_SOC_DAPM_PRE_PMD:
		snd_soc_component_update_bits(component, WM8962_ANALOGUE_HP_0,
				    WM8962_HP1L_RMV_SHORT |
				    WM8962_HP1R_RMV_SHORT, 0);

		udelay(20);

		snd_soc_component_update_bits(component, WM8962_DC_SERVO_1,
				    WM8962_HP1L_DCS_ENA | WM8962_HP1R_DCS_ENA |
				    WM8962_HP1L_DCS_STARTUP |
				    WM8962_HP1R_DCS_STARTUP,
				    0);

		snd_soc_component_update_bits(component, WM8962_ANALOGUE_HP_0,
				    WM8962_HP1L_ENA | WM8962_HP1R_ENA |
				    WM8962_HP1L_ENA_DLY | WM8962_HP1R_ENA_DLY |
				    WM8962_HP1L_ENA_OUTP |
				    WM8962_HP1R_ENA_OUTP, 0);
				    
		अवरोध;

	शेष:
		WARN(1, "Invalid event %d\n", event);
		वापस -EINVAL;
	
	पूर्ण

	वापस 0;
पूर्ण

/* VU bits क्रम the output PGAs only take effect जबतक the PGA is घातered */
अटल पूर्णांक out_pga_event(काष्ठा snd_soc_dapm_widget *w,
			 काष्ठा snd_kcontrol *kcontrol, पूर्णांक event)
अणु
	काष्ठा snd_soc_component *component = snd_soc_dapm_to_component(w->dapm);
	पूर्णांक reg;

	चयन (w->shअगरt) अणु
	हाल WM8962_HPOUTR_PGA_ENA_SHIFT:
		reg = WM8962_HPOUTR_VOLUME;
		अवरोध;
	हाल WM8962_HPOUTL_PGA_ENA_SHIFT:
		reg = WM8962_HPOUTL_VOLUME;
		अवरोध;
	हाल WM8962_SPKOUTR_PGA_ENA_SHIFT:
		reg = WM8962_SPKOUTR_VOLUME;
		अवरोध;
	हाल WM8962_SPKOUTL_PGA_ENA_SHIFT:
		reg = WM8962_SPKOUTL_VOLUME;
		अवरोध;
	शेष:
		WARN(1, "Invalid shift %d\n", w->shअगरt);
		वापस -EINVAL;
	पूर्ण

	चयन (event) अणु
	हाल SND_SOC_DAPM_POST_PMU:
		वापस snd_soc_component_ग_लिखो(component, reg,
			snd_soc_component_पढ़ो(component, reg));
	शेष:
		WARN(1, "Invalid event %d\n", event);
		वापस -EINVAL;
	पूर्ण
पूर्ण

अटल पूर्णांक dsp2_event(काष्ठा snd_soc_dapm_widget *w,
		      काष्ठा snd_kcontrol *kcontrol, पूर्णांक event)
अणु
	काष्ठा snd_soc_component *component = snd_soc_dapm_to_component(w->dapm);
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	चयन (event) अणु
	हाल SND_SOC_DAPM_POST_PMU:
		अगर (wm8962->dsp2_ena)
			wm8962_dsp2_start(component);
		अवरोध;

	हाल SND_SOC_DAPM_PRE_PMD:
		अगर (wm8962->dsp2_ena)
			wm8962_dsp2_stop(component);
		अवरोध;

	शेष:
		WARN(1, "Invalid event %d\n", event);
		वापस -EINVAL;
	पूर्ण

	वापस 0;
पूर्ण

अटल स्थिर अक्षर *st_text[] = अणु "None", "Left", "Right" पूर्ण;

अटल SOC_ENUM_SINGLE_DECL(str_क्रमागत,
			    WM8962_DAC_DSP_MIXING_1, 2, st_text);

अटल स्थिर काष्ठा snd_kcontrol_new str_mux =
	SOC_DAPM_ENUM("Right Sidetone", str_क्रमागत);

अटल SOC_ENUM_SINGLE_DECL(stl_क्रमागत,
			    WM8962_DAC_DSP_MIXING_2, 2, st_text);

अटल स्थिर काष्ठा snd_kcontrol_new stl_mux =
	SOC_DAPM_ENUM("Left Sidetone", stl_क्रमागत);

अटल स्थिर अक्षर *ouपंचांगux_text[] = अणु "DAC", "Mixer" पूर्ण;

अटल SOC_ENUM_SINGLE_DECL(spkoutr_क्रमागत,
			    WM8962_SPEAKER_MIXER_2, 7, ouपंचांगux_text);

अटल स्थिर काष्ठा snd_kcontrol_new spkoutr_mux =
	SOC_DAPM_ENUM("SPKOUTR Mux", spkoutr_क्रमागत);

अटल SOC_ENUM_SINGLE_DECL(spkoutl_क्रमागत,
			    WM8962_SPEAKER_MIXER_1, 7, ouपंचांगux_text);

अटल स्थिर काष्ठा snd_kcontrol_new spkoutl_mux =
	SOC_DAPM_ENUM("SPKOUTL Mux", spkoutl_क्रमागत);

अटल SOC_ENUM_SINGLE_DECL(hpoutr_क्रमागत,
			    WM8962_HEADPHONE_MIXER_2, 7, ouपंचांगux_text);

अटल स्थिर काष्ठा snd_kcontrol_new hpoutr_mux =
	SOC_DAPM_ENUM("HPOUTR Mux", hpoutr_क्रमागत);

अटल SOC_ENUM_SINGLE_DECL(hpoutl_क्रमागत,
			    WM8962_HEADPHONE_MIXER_1, 7, ouपंचांगux_text);

अटल स्थिर काष्ठा snd_kcontrol_new hpoutl_mux =
	SOC_DAPM_ENUM("HPOUTL Mux", hpoutl_क्रमागत);

अटल स्थिर काष्ठा snd_kcontrol_new inpgal[] = अणु
SOC_DAPM_SINGLE("IN1L Switch", WM8962_LEFT_INPUT_PGA_CONTROL, 3, 1, 0),
SOC_DAPM_SINGLE("IN2L Switch", WM8962_LEFT_INPUT_PGA_CONTROL, 2, 1, 0),
SOC_DAPM_SINGLE("IN3L Switch", WM8962_LEFT_INPUT_PGA_CONTROL, 1, 1, 0),
SOC_DAPM_SINGLE("IN4L Switch", WM8962_LEFT_INPUT_PGA_CONTROL, 0, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new inpgar[] = अणु
SOC_DAPM_SINGLE("IN1R Switch", WM8962_RIGHT_INPUT_PGA_CONTROL, 3, 1, 0),
SOC_DAPM_SINGLE("IN2R Switch", WM8962_RIGHT_INPUT_PGA_CONTROL, 2, 1, 0),
SOC_DAPM_SINGLE("IN3R Switch", WM8962_RIGHT_INPUT_PGA_CONTROL, 1, 1, 0),
SOC_DAPM_SINGLE("IN4R Switch", WM8962_RIGHT_INPUT_PGA_CONTROL, 0, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new mixinl[] = अणु
SOC_DAPM_SINGLE("IN2L Switch", WM8962_INPUT_MIXER_CONTROL_2, 5, 1, 0),
SOC_DAPM_SINGLE("IN3L Switch", WM8962_INPUT_MIXER_CONTROL_2, 4, 1, 0),
SOC_DAPM_SINGLE("PGA Switch", WM8962_INPUT_MIXER_CONTROL_2, 3, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new mixinr[] = अणु
SOC_DAPM_SINGLE("IN2R Switch", WM8962_INPUT_MIXER_CONTROL_2, 2, 1, 0),
SOC_DAPM_SINGLE("IN3R Switch", WM8962_INPUT_MIXER_CONTROL_2, 1, 1, 0),
SOC_DAPM_SINGLE("PGA Switch", WM8962_INPUT_MIXER_CONTROL_2, 0, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new hpmixl[] = अणु
SOC_DAPM_SINGLE("DACL Switch", WM8962_HEADPHONE_MIXER_1, 5, 1, 0),
SOC_DAPM_SINGLE("DACR Switch", WM8962_HEADPHONE_MIXER_1, 4, 1, 0),
SOC_DAPM_SINGLE("MIXINL Switch", WM8962_HEADPHONE_MIXER_1, 3, 1, 0),
SOC_DAPM_SINGLE("MIXINR Switch", WM8962_HEADPHONE_MIXER_1, 2, 1, 0),
SOC_DAPM_SINGLE("IN4L Switch", WM8962_HEADPHONE_MIXER_1, 1, 1, 0),
SOC_DAPM_SINGLE("IN4R Switch", WM8962_HEADPHONE_MIXER_1, 0, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new hpmixr[] = अणु
SOC_DAPM_SINGLE("DACL Switch", WM8962_HEADPHONE_MIXER_2, 5, 1, 0),
SOC_DAPM_SINGLE("DACR Switch", WM8962_HEADPHONE_MIXER_2, 4, 1, 0),
SOC_DAPM_SINGLE("MIXINL Switch", WM8962_HEADPHONE_MIXER_2, 3, 1, 0),
SOC_DAPM_SINGLE("MIXINR Switch", WM8962_HEADPHONE_MIXER_2, 2, 1, 0),
SOC_DAPM_SINGLE("IN4L Switch", WM8962_HEADPHONE_MIXER_2, 1, 1, 0),
SOC_DAPM_SINGLE("IN4R Switch", WM8962_HEADPHONE_MIXER_2, 0, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new spkmixl[] = अणु
SOC_DAPM_SINGLE("DACL Switch", WM8962_SPEAKER_MIXER_1, 5, 1, 0),
SOC_DAPM_SINGLE("DACR Switch", WM8962_SPEAKER_MIXER_1, 4, 1, 0),
SOC_DAPM_SINGLE("MIXINL Switch", WM8962_SPEAKER_MIXER_1, 3, 1, 0),
SOC_DAPM_SINGLE("MIXINR Switch", WM8962_SPEAKER_MIXER_1, 2, 1, 0),
SOC_DAPM_SINGLE("IN4L Switch", WM8962_SPEAKER_MIXER_1, 1, 1, 0),
SOC_DAPM_SINGLE("IN4R Switch", WM8962_SPEAKER_MIXER_1, 0, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_kcontrol_new spkmixr[] = अणु
SOC_DAPM_SINGLE("DACL Switch", WM8962_SPEAKER_MIXER_2, 5, 1, 0),
SOC_DAPM_SINGLE("DACR Switch", WM8962_SPEAKER_MIXER_2, 4, 1, 0),
SOC_DAPM_SINGLE("MIXINL Switch", WM8962_SPEAKER_MIXER_2, 3, 1, 0),
SOC_DAPM_SINGLE("MIXINR Switch", WM8962_SPEAKER_MIXER_2, 2, 1, 0),
SOC_DAPM_SINGLE("IN4L Switch", WM8962_SPEAKER_MIXER_2, 1, 1, 0),
SOC_DAPM_SINGLE("IN4R Switch", WM8962_SPEAKER_MIXER_2, 0, 1, 0),
पूर्ण;

अटल स्थिर काष्ठा snd_soc_dapm_widget wm8962_dapm_widमाला_लो[] = अणु
SND_SOC_DAPM_INPUT("IN1L"),
SND_SOC_DAPM_INPUT("IN1R"),
SND_SOC_DAPM_INPUT("IN2L"),
SND_SOC_DAPM_INPUT("IN2R"),
SND_SOC_DAPM_INPUT("IN3L"),
SND_SOC_DAPM_INPUT("IN3R"),
SND_SOC_DAPM_INPUT("IN4L"),
SND_SOC_DAPM_INPUT("IN4R"),
SND_SOC_DAPM_SIGGEN("Beep"),
SND_SOC_DAPM_INPUT("DMICDAT"),

SND_SOC_DAPM_SUPPLY("MICBIAS", WM8962_PWR_MGMT_1, 1, 0, शून्य, 0),

SND_SOC_DAPM_SUPPLY("Class G", WM8962_CHARGE_PUMP_B, 0, 1, शून्य, 0),
SND_SOC_DAPM_SUPPLY("SYSCLK", WM8962_CLOCKING2, 5, 0, शून्य, 0),
SND_SOC_DAPM_SUPPLY("Charge Pump", WM8962_CHARGE_PUMP_1, 0, 0, cp_event,
		    SND_SOC_DAPM_POST_PMU),
SND_SOC_DAPM_SUPPLY("TOCLK", WM8962_ADDITIONAL_CONTROL_1, 0, 0, शून्य, 0),
SND_SOC_DAPM_SUPPLY_S("DSP2", 1, WM8962_DSP2_POWER_MANAGEMENT,
		      WM8962_DSP2_ENA_SHIFT, 0, dsp2_event,
		      SND_SOC_DAPM_POST_PMU | SND_SOC_DAPM_PRE_PMD),
SND_SOC_DAPM_SUPPLY("TEMP_HP", WM8962_ADDITIONAL_CONTROL_4, 2, 0, शून्य, 0),
SND_SOC_DAPM_SUPPLY("TEMP_SPK", WM8962_ADDITIONAL_CONTROL_4, 1, 0, शून्य, 0),

SND_SOC_DAPM_MIXER("INPGAL", WM8962_LEFT_INPUT_PGA_CONTROL, 4, 0,
		   inpgal, ARRAY_SIZE(inpgal)),
SND_SOC_DAPM_MIXER("INPGAR", WM8962_RIGHT_INPUT_PGA_CONTROL, 4, 0,
		   inpgar, ARRAY_SIZE(inpgar)),
SND_SOC_DAPM_MIXER("MIXINL", WM8962_PWR_MGMT_1, 5, 0,
		   mixinl, ARRAY_SIZE(mixinl)),
SND_SOC_DAPM_MIXER("MIXINR", WM8962_PWR_MGMT_1, 4, 0,
		   mixinr, ARRAY_SIZE(mixinr)),

SND_SOC_DAPM_AIF_IN("DMIC_ENA", शून्य, 0, WM8962_PWR_MGMT_1, 10, 0),

SND_SOC_DAPM_ADC("ADCL", "Capture", WM8962_PWR_MGMT_1, 3, 0),
SND_SOC_DAPM_ADC("ADCR", "Capture", WM8962_PWR_MGMT_1, 2, 0),

SND_SOC_DAPM_MUX("STL", SND_SOC_NOPM, 0, 0, &stl_mux),
SND_SOC_DAPM_MUX("STR", SND_SOC_NOPM, 0, 0, &str_mux),

SND_SOC_DAPM_DAC("DACL", "Playback", WM8962_PWR_MGMT_2, 8, 0),
SND_SOC_DAPM_DAC("DACR", "Playback", WM8962_PWR_MGMT_2, 7, 0),

SND_SOC_DAPM_PGA("Left Bypass", SND_SOC_NOPM, 0, 0, शून्य, 0),
SND_SOC_DAPM_PGA("Right Bypass", SND_SOC_NOPM, 0, 0, शून्य, 0),

SND_SOC_DAPM_MIXER("HPMIXL", WM8962_MIXER_ENABLES, 3, 0,
		   hpmixl, ARRAY_SIZE(hpmixl)),
SND_SOC_DAPM_MIXER("HPMIXR", WM8962_MIXER_ENABLES, 2, 0,
		   hpmixr, ARRAY_SIZE(hpmixr)),

SND_SOC_DAPM_MUX_E("HPOUTL PGA", WM8962_PWR_MGMT_2, 6, 0, &hpoutl_mux,
		   out_pga_event, SND_SOC_DAPM_POST_PMU),
SND_SOC_DAPM_MUX_E("HPOUTR PGA", WM8962_PWR_MGMT_2, 5, 0, &hpoutr_mux,
		   out_pga_event, SND_SOC_DAPM_POST_PMU),

SND_SOC_DAPM_PGA_E("HPOUT", SND_SOC_NOPM, 0, 0, शून्य, 0, hp_event,
		   SND_SOC_DAPM_POST_PMU | SND_SOC_DAPM_PRE_PMD),

SND_SOC_DAPM_OUTPUT("HPOUTL"),
SND_SOC_DAPM_OUTPUT("HPOUTR"),
पूर्ण;

अटल स्थिर काष्ठा snd_soc_dapm_widget wm8962_dapm_spk_mono_widमाला_लो[] = अणु
SND_SOC_DAPM_MIXER("Speaker Mixer", WM8962_MIXER_ENABLES, 1, 0,
		   spkmixl, ARRAY_SIZE(spkmixl)),
SND_SOC_DAPM_MUX_E("Speaker PGA", WM8962_PWR_MGMT_2, 4, 0, &spkoutl_mux,
		   out_pga_event, SND_SOC_DAPM_POST_PMU),
SND_SOC_DAPM_PGA("Speaker Output", WM8962_CLASS_D_CONTROL_1, 7, 0, शून्य, 0),
SND_SOC_DAPM_OUTPUT("SPKOUT"),
पूर्ण;

अटल स्थिर काष्ठा snd_soc_dapm_widget wm8962_dapm_spk_stereo_widमाला_लो[] = अणु
SND_SOC_DAPM_MIXER("SPKOUTL Mixer", WM8962_MIXER_ENABLES, 1, 0,
		   spkmixl, ARRAY_SIZE(spkmixl)),
SND_SOC_DAPM_MIXER("SPKOUTR Mixer", WM8962_MIXER_ENABLES, 0, 0,
		   spkmixr, ARRAY_SIZE(spkmixr)),

SND_SOC_DAPM_MUX_E("SPKOUTL PGA", WM8962_PWR_MGMT_2, 4, 0, &spkoutl_mux,
		   out_pga_event, SND_SOC_DAPM_POST_PMU),
SND_SOC_DAPM_MUX_E("SPKOUTR PGA", WM8962_PWR_MGMT_2, 3, 0, &spkoutr_mux,
		   out_pga_event, SND_SOC_DAPM_POST_PMU),

SND_SOC_DAPM_PGA("SPKOUTR Output", WM8962_CLASS_D_CONTROL_1, 7, 0, शून्य, 0),
SND_SOC_DAPM_PGA("SPKOUTL Output", WM8962_CLASS_D_CONTROL_1, 6, 0, शून्य, 0),

SND_SOC_DAPM_OUTPUT("SPKOUTL"),
SND_SOC_DAPM_OUTPUT("SPKOUTR"),
पूर्ण;

अटल स्थिर काष्ठा snd_soc_dapm_route wm8962_पूर्णांकercon[] = अणु
	अणु "INPGAL", "IN1L Switch", "IN1L" पूर्ण,
	अणु "INPGAL", "IN2L Switch", "IN2L" पूर्ण,
	अणु "INPGAL", "IN3L Switch", "IN3L" पूर्ण,
	अणु "INPGAL", "IN4L Switch", "IN4L" पूर्ण,

	अणु "INPGAR", "IN1R Switch", "IN1R" पूर्ण,
	अणु "INPGAR", "IN2R Switch", "IN2R" पूर्ण,
	अणु "INPGAR", "IN3R Switch", "IN3R" पूर्ण,
	अणु "INPGAR", "IN4R Switch", "IN4R" पूर्ण,

	अणु "MIXINL", "IN2L Switch", "IN2L" पूर्ण,
	अणु "MIXINL", "IN3L Switch", "IN3L" पूर्ण,
	अणु "MIXINL", "PGA Switch", "INPGAL" पूर्ण,

	अणु "MIXINR", "IN2R Switch", "IN2R" पूर्ण,
	अणु "MIXINR", "IN3R Switch", "IN3R" पूर्ण,
	अणु "MIXINR", "PGA Switch", "INPGAR" पूर्ण,

	अणु "MICBIAS", शून्य, "SYSCLK" पूर्ण,

	अणु "DMIC_ENA", शून्य, "DMICDAT" पूर्ण,

	अणु "ADCL", शून्य, "SYSCLK" पूर्ण,
	अणु "ADCL", शून्य, "TOCLK" पूर्ण,
	अणु "ADCL", शून्य, "MIXINL" पूर्ण,
	अणु "ADCL", शून्य, "DMIC_ENA" पूर्ण,
	अणु "ADCL", शून्य, "DSP2" पूर्ण,

	अणु "ADCR", शून्य, "SYSCLK" पूर्ण,
	अणु "ADCR", शून्य, "TOCLK" पूर्ण,
	अणु "ADCR", शून्य, "MIXINR" पूर्ण,
	अणु "ADCR", शून्य, "DMIC_ENA" पूर्ण,
	अणु "ADCR", शून्य, "DSP2" पूर्ण,

	अणु "STL", "Left", "ADCL" पूर्ण,
	अणु "STL", "Right", "ADCR" पूर्ण,
	अणु "STL", शून्य, "Class G" पूर्ण,

	अणु "STR", "Left", "ADCL" पूर्ण,
	अणु "STR", "Right", "ADCR" पूर्ण,
	अणु "STR", शून्य, "Class G" पूर्ण,

	अणु "DACL", शून्य, "SYSCLK" पूर्ण,
	अणु "DACL", शून्य, "TOCLK" पूर्ण,
	अणु "DACL", शून्य, "Beep" पूर्ण,
	अणु "DACL", शून्य, "STL" पूर्ण,
	अणु "DACL", शून्य, "DSP2" पूर्ण,

	अणु "DACR", शून्य, "SYSCLK" पूर्ण,
	अणु "DACR", शून्य, "TOCLK" पूर्ण,
	अणु "DACR", शून्य, "Beep" पूर्ण,
	अणु "DACR", शून्य, "STR" पूर्ण,
	अणु "DACR", शून्य, "DSP2" पूर्ण,

	अणु "HPMIXL", "IN4L Switch", "IN4L" पूर्ण,
	अणु "HPMIXL", "IN4R Switch", "IN4R" पूर्ण,
	अणु "HPMIXL", "DACL Switch", "DACL" पूर्ण,
	अणु "HPMIXL", "DACR Switch", "DACR" पूर्ण,
	अणु "HPMIXL", "MIXINL Switch", "MIXINL" पूर्ण,
	अणु "HPMIXL", "MIXINR Switch", "MIXINR" पूर्ण,

	अणु "HPMIXR", "IN4L Switch", "IN4L" पूर्ण,
	अणु "HPMIXR", "IN4R Switch", "IN4R" पूर्ण,
	अणु "HPMIXR", "DACL Switch", "DACL" पूर्ण,
	अणु "HPMIXR", "DACR Switch", "DACR" पूर्ण,
	अणु "HPMIXR", "MIXINL Switch", "MIXINL" पूर्ण,
	अणु "HPMIXR", "MIXINR Switch", "MIXINR" पूर्ण,

	अणु "Left Bypass", शून्य, "HPMIXL" पूर्ण,
	अणु "Left Bypass", शून्य, "Class G" पूर्ण,

	अणु "Right Bypass", शून्य, "HPMIXR" पूर्ण,
	अणु "Right Bypass", शून्य, "Class G" पूर्ण,

	अणु "HPOUTL PGA", "Mixer", "Left Bypass" पूर्ण,
	अणु "HPOUTL PGA", "DAC", "DACL" पूर्ण,

	अणु "HPOUTR PGA", "Mixer", "Right Bypass" पूर्ण,
	अणु "HPOUTR PGA", "DAC", "DACR" पूर्ण,

	अणु "HPOUT", शून्य, "HPOUTL PGA" पूर्ण,
	अणु "HPOUT", शून्य, "HPOUTR PGA" पूर्ण,
	अणु "HPOUT", शून्य, "Charge Pump" पूर्ण,
	अणु "HPOUT", शून्य, "SYSCLK" पूर्ण,
	अणु "HPOUT", शून्य, "TOCLK" पूर्ण,

	अणु "HPOUTL", शून्य, "HPOUT" पूर्ण,
	अणु "HPOUTR", शून्य, "HPOUT" पूर्ण,

	अणु "HPOUTL", शून्य, "TEMP_HP" पूर्ण,
	अणु "HPOUTR", शून्य, "TEMP_HP" पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा snd_soc_dapm_route wm8962_spk_mono_पूर्णांकercon[] = अणु
	अणु "Speaker Mixer", "IN4L Switch", "IN4L" पूर्ण,
	अणु "Speaker Mixer", "IN4R Switch", "IN4R" पूर्ण,
	अणु "Speaker Mixer", "DACL Switch", "DACL" पूर्ण,
	अणु "Speaker Mixer", "DACR Switch", "DACR" पूर्ण,
	अणु "Speaker Mixer", "MIXINL Switch", "MIXINL" पूर्ण,
	अणु "Speaker Mixer", "MIXINR Switch", "MIXINR" पूर्ण,

	अणु "Speaker PGA", "Mixer", "Speaker Mixer" पूर्ण,
	अणु "Speaker PGA", "DAC", "DACL" पूर्ण,

	अणु "Speaker Output", शून्य, "Speaker PGA" पूर्ण,
	अणु "Speaker Output", शून्य, "SYSCLK" पूर्ण,
	अणु "Speaker Output", शून्य, "TOCLK" पूर्ण,
	अणु "Speaker Output", शून्य, "TEMP_SPK" पूर्ण,

	अणु "SPKOUT", शून्य, "Speaker Output" पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा snd_soc_dapm_route wm8962_spk_stereo_पूर्णांकercon[] = अणु
	अणु "SPKOUTL Mixer", "IN4L Switch", "IN4L" पूर्ण,
	अणु "SPKOUTL Mixer", "IN4R Switch", "IN4R" पूर्ण,
	अणु "SPKOUTL Mixer", "DACL Switch", "DACL" पूर्ण,
	अणु "SPKOUTL Mixer", "DACR Switch", "DACR" पूर्ण,
	अणु "SPKOUTL Mixer", "MIXINL Switch", "MIXINL" पूर्ण,
	अणु "SPKOUTL Mixer", "MIXINR Switch", "MIXINR" पूर्ण,

	अणु "SPKOUTR Mixer", "IN4L Switch", "IN4L" पूर्ण,
	अणु "SPKOUTR Mixer", "IN4R Switch", "IN4R" पूर्ण,
	अणु "SPKOUTR Mixer", "DACL Switch", "DACL" पूर्ण,
	अणु "SPKOUTR Mixer", "DACR Switch", "DACR" पूर्ण,
	अणु "SPKOUTR Mixer", "MIXINL Switch", "MIXINL" पूर्ण,
	अणु "SPKOUTR Mixer", "MIXINR Switch", "MIXINR" पूर्ण,

	अणु "SPKOUTL PGA", "Mixer", "SPKOUTL Mixer" पूर्ण,
	अणु "SPKOUTL PGA", "DAC", "DACL" पूर्ण,

	अणु "SPKOUTR PGA", "Mixer", "SPKOUTR Mixer" पूर्ण,
	अणु "SPKOUTR PGA", "DAC", "DACR" पूर्ण,

	अणु "SPKOUTL Output", शून्य, "SPKOUTL PGA" पूर्ण,
	अणु "SPKOUTL Output", शून्य, "SYSCLK" पूर्ण,
	अणु "SPKOUTL Output", शून्य, "TOCLK" पूर्ण,
	अणु "SPKOUTL Output", शून्य, "TEMP_SPK" पूर्ण,

	अणु "SPKOUTR Output", शून्य, "SPKOUTR PGA" पूर्ण,
	अणु "SPKOUTR Output", शून्य, "SYSCLK" पूर्ण,
	अणु "SPKOUTR Output", शून्य, "TOCLK" पूर्ण,
	अणु "SPKOUTR Output", शून्य, "TEMP_SPK" पूर्ण,

	अणु "SPKOUTL", शून्य, "SPKOUTL Output" पूर्ण,
	अणु "SPKOUTR", शून्य, "SPKOUTR Output" पूर्ण,
पूर्ण;

अटल पूर्णांक wm8962_add_widमाला_लो(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	काष्ठा wm8962_pdata *pdata = &wm8962->pdata;
	काष्ठा snd_soc_dapm_context *dapm = snd_soc_component_get_dapm(component);

	snd_soc_add_component_controls(component, wm8962_snd_controls,
			     ARRAY_SIZE(wm8962_snd_controls));
	अगर (pdata->spk_mono)
		snd_soc_add_component_controls(component, wm8962_spk_mono_controls,
				     ARRAY_SIZE(wm8962_spk_mono_controls));
	अन्यथा
		snd_soc_add_component_controls(component, wm8962_spk_stereo_controls,
				     ARRAY_SIZE(wm8962_spk_stereo_controls));


	snd_soc_dapm_new_controls(dapm, wm8962_dapm_widमाला_लो,
				  ARRAY_SIZE(wm8962_dapm_widमाला_लो));
	अगर (pdata->spk_mono)
		snd_soc_dapm_new_controls(dapm, wm8962_dapm_spk_mono_widमाला_लो,
					  ARRAY_SIZE(wm8962_dapm_spk_mono_widमाला_लो));
	अन्यथा
		snd_soc_dapm_new_controls(dapm, wm8962_dapm_spk_stereo_widमाला_लो,
					  ARRAY_SIZE(wm8962_dapm_spk_stereo_widमाला_लो));

	snd_soc_dapm_add_routes(dapm, wm8962_पूर्णांकercon,
				ARRAY_SIZE(wm8962_पूर्णांकercon));
	अगर (pdata->spk_mono)
		snd_soc_dapm_add_routes(dapm, wm8962_spk_mono_पूर्णांकercon,
					ARRAY_SIZE(wm8962_spk_mono_पूर्णांकercon));
	अन्यथा
		snd_soc_dapm_add_routes(dapm, wm8962_spk_stereo_पूर्णांकercon,
					ARRAY_SIZE(wm8962_spk_stereo_पूर्णांकercon));


	snd_soc_dapm_disable_pin(dapm, "Beep");

	वापस 0;
पूर्ण

/* -1 क्रम reserved values */
अटल स्थिर पूर्णांक bclk_भागs[] = अणु
	1, -1, 2, 3, 4, -1, 6, 8, -1, 12, 16, 24, -1, 32, 32, 32
पूर्ण;

अटल स्थिर पूर्णांक sysclk_rates[] = अणु
	64, 128, 192, 256, 384, 512, 768, 1024, 1408, 1536, 3072, 6144
पूर्ण;

अटल व्योम wm8962_configure_bclk(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	पूर्णांक best, min_dअगरf, dअगरf;
	पूर्णांक dspclk, i;
	पूर्णांक घड़ीing2 = 0;
	पूर्णांक घड़ीing4 = 0;
	पूर्णांक aअगर2 = 0;

	अगर (!wm8962->sysclk_rate) अणु
		dev_dbg(component->dev, "No SYSCLK configured\n");
		वापस;
	पूर्ण

	अगर (!wm8962->bclk || !wm8962->lrclk) अणु
		dev_dbg(component->dev, "No audio clocks configured\n");
		वापस;
	पूर्ण

	क्रम (i = 0; i < ARRAY_SIZE(sysclk_rates); i++) अणु
		अगर (sysclk_rates[i] == wm8962->sysclk_rate / wm8962->lrclk) अणु
			घड़ीing4 |= i << WM8962_SYSCLK_RATE_SHIFT;
			अवरोध;
		पूर्ण
	पूर्ण

	अगर (i == ARRAY_SIZE(sysclk_rates)) अणु
		dev_err(component->dev, "Unsupported sysclk ratio %d\n",
			wm8962->sysclk_rate / wm8962->lrclk);
		वापस;
	पूर्ण

	dev_dbg(component->dev, "Selected sysclk ratio %d\n", sysclk_rates[i]);

	snd_soc_component_update_bits(component, WM8962_CLOCKING_4,
			    WM8962_SYSCLK_RATE_MASK, घड़ीing4);

	/* DSPCLK_DIV can be only generated correctly after enabling SYSCLK.
	 * So we here provisionally enable it and then disable it afterward
	 * अगर current bias_level hasn't reached SND_SOC_BIAS_ON.
	 */
	अगर (snd_soc_component_get_bias_level(component) != SND_SOC_BIAS_ON)
		snd_soc_component_update_bits(component, WM8962_CLOCKING2,
				WM8962_SYSCLK_ENA_MASK, WM8962_SYSCLK_ENA);

	dspclk = snd_soc_component_पढ़ो(component, WM8962_CLOCKING1);

	अगर (snd_soc_component_get_bias_level(component) != SND_SOC_BIAS_ON)
		snd_soc_component_update_bits(component, WM8962_CLOCKING2,
				WM8962_SYSCLK_ENA_MASK, 0);

	अगर (dspclk < 0) अणु
		dev_err(component->dev, "Failed to read DSPCLK: %d\n", dspclk);
		वापस;
	पूर्ण

	dspclk = (dspclk & WM8962_DSPCLK_DIV_MASK) >> WM8962_DSPCLK_DIV_SHIFT;
	चयन (dspclk) अणु
	हाल 0:
		dspclk = wm8962->sysclk_rate;
		अवरोध;
	हाल 1:
		dspclk = wm8962->sysclk_rate / 2;
		अवरोध;
	हाल 2:
		dspclk = wm8962->sysclk_rate / 4;
		अवरोध;
	शेष:
		dev_warn(component->dev, "Unknown DSPCLK divisor read back\n");
		dspclk = wm8962->sysclk_rate;
	पूर्ण

	dev_dbg(component->dev, "DSPCLK is %dHz, BCLK %d\n", dspclk, wm8962->bclk);

	/* Search a proper bclk, not exact match. */
	best = 0;
	min_dअगरf = पूर्णांक_उच्च;
	क्रम (i = 0; i < ARRAY_SIZE(bclk_भागs); i++) अणु
		अगर (bclk_भागs[i] < 0)
			जारी;

		dअगरf = (dspclk / bclk_भागs[i]) - wm8962->bclk;
		अगर (dअगरf < 0) /* Table is sorted */
			अवरोध;
		अगर (dअगरf < min_dअगरf) अणु
			best = i;
			min_dअगरf = dअगरf;
		पूर्ण
	पूर्ण
	wm8962->bclk = dspclk / bclk_भागs[best];
	घड़ीing2 |= best;
	dev_dbg(component->dev, "Selected BCLK_DIV %d for %dHz\n",
		bclk_भागs[best], wm8962->bclk);

	aअगर2 |= wm8962->bclk / wm8962->lrclk;
	dev_dbg(component->dev, "Selected LRCLK divisor %d for %dHz\n",
		wm8962->bclk / wm8962->lrclk, wm8962->lrclk);

	snd_soc_component_update_bits(component, WM8962_CLOCKING2,
			    WM8962_BCLK_DIV_MASK, घड़ीing2);
	snd_soc_component_update_bits(component, WM8962_AUDIO_INTERFACE_2,
			    WM8962_AIF_RATE_MASK, aअगर2);
पूर्ण

अटल पूर्णांक wm8962_set_bias_level(काष्ठा snd_soc_component *component,
				 क्रमागत snd_soc_bias_level level)
अणु
	चयन (level) अणु
	हाल SND_SOC_BIAS_ON:
		अवरोध;

	हाल SND_SOC_BIAS_PREPARE:
		/* VMID 2*50k */
		snd_soc_component_update_bits(component, WM8962_PWR_MGMT_1,
				    WM8962_VMID_SEL_MASK, 0x80);

		wm8962_configure_bclk(component);
		अवरोध;

	हाल SND_SOC_BIAS_STANDBY:
		/* VMID 2*250k */
		snd_soc_component_update_bits(component, WM8962_PWR_MGMT_1,
				    WM8962_VMID_SEL_MASK, 0x100);

		अगर (snd_soc_component_get_bias_level(component) == SND_SOC_BIAS_OFF)
			msleep(100);
		अवरोध;

	हाल SND_SOC_BIAS_OFF:
		अवरोध;
	पूर्ण

	वापस 0;
पूर्ण

अटल स्थिर काष्ठा अणु
	पूर्णांक rate;
	पूर्णांक reg;
पूर्ण sr_vals[] = अणु
	अणु 48000, 0 पूर्ण,
	अणु 44100, 0 पूर्ण,
	अणु 32000, 1 पूर्ण,
	अणु 22050, 2 पूर्ण,
	अणु 24000, 2 पूर्ण,
	अणु 16000, 3 पूर्ण,
	अणु 11025, 4 पूर्ण,
	अणु 12000, 4 पूर्ण,
	अणु 8000,  5 पूर्ण,
	अणु 88200, 6 पूर्ण,
	अणु 96000, 6 पूर्ण,
पूर्ण;

अटल पूर्णांक wm8962_hw_params(काष्ठा snd_pcm_substream *substream,
			    काष्ठा snd_pcm_hw_params *params,
			    काष्ठा snd_soc_dai *dai)
अणु
	काष्ठा snd_soc_component *component = dai->component;
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	पूर्णांक i;
	पूर्णांक aअगर0 = 0;
	पूर्णांक adctl3 = 0;

	wm8962->bclk = snd_soc_params_to_bclk(params);
	अगर (params_channels(params) == 1)
		wm8962->bclk *= 2;

	wm8962->lrclk = params_rate(params);

	क्रम (i = 0; i < ARRAY_SIZE(sr_vals); i++) अणु
		अगर (sr_vals[i].rate == wm8962->lrclk) अणु
			adctl3 |= sr_vals[i].reg;
			अवरोध;
		पूर्ण
	पूर्ण
	अगर (i == ARRAY_SIZE(sr_vals)) अणु
		dev_err(component->dev, "Unsupported rate %dHz\n", wm8962->lrclk);
		वापस -EINVAL;
	पूर्ण

	अगर (wm8962->lrclk % 8000 == 0)
		adctl3 |= WM8962_SAMPLE_RATE_INT_MODE;

	चयन (params_width(params)) अणु
	हाल 16:
		अवरोध;
	हाल 20:
		aअगर0 |= 0x4;
		अवरोध;
	हाल 24:
		aअगर0 |= 0x8;
		अवरोध;
	हाल 32:
		aअगर0 |= 0xc;
		अवरोध;
	शेष:
		वापस -EINVAL;
	पूर्ण

	snd_soc_component_update_bits(component, WM8962_AUDIO_INTERFACE_0,
			    WM8962_WL_MASK, aअगर0);
	snd_soc_component_update_bits(component, WM8962_ADDITIONAL_CONTROL_3,
			    WM8962_SAMPLE_RATE_INT_MODE |
			    WM8962_SAMPLE_RATE_MASK, adctl3);

	dev_dbg(component->dev, "hw_params set BCLK %dHz LRCLK %dHz\n",
		wm8962->bclk, wm8962->lrclk);

	अगर (snd_soc_component_get_bias_level(component) == SND_SOC_BIAS_ON)
		wm8962_configure_bclk(component);

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_set_dai_sysclk(काष्ठा snd_soc_dai *dai, पूर्णांक clk_id,
				 अचिन्हित पूर्णांक freq, पूर्णांक dir)
अणु
	काष्ठा snd_soc_component *component = dai->component;
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	पूर्णांक src;

	चयन (clk_id) अणु
	हाल WM8962_SYSCLK_MCLK:
		wm8962->sysclk = WM8962_SYSCLK_MCLK;
		src = 0;
		अवरोध;
	हाल WM8962_SYSCLK_FLL:
		wm8962->sysclk = WM8962_SYSCLK_FLL;
		src = 1 << WM8962_SYSCLK_SRC_SHIFT;
		अवरोध;
	शेष:
		वापस -EINVAL;
	पूर्ण

	snd_soc_component_update_bits(component, WM8962_CLOCKING2, WM8962_SYSCLK_SRC_MASK,
			    src);

	wm8962->sysclk_rate = freq;

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_set_dai_fmt(काष्ठा snd_soc_dai *dai, अचिन्हित पूर्णांक fmt)
अणु
	काष्ठा snd_soc_component *component = dai->component;
	पूर्णांक aअगर0 = 0;

	चयन (fmt & SND_SOC_DAIFMT_FORMAT_MASK) अणु
	हाल SND_SOC_DAIFMT_DSP_B:
		aअगर0 |= WM8962_LRCLK_INV | 3;
		fallthrough;
	हाल SND_SOC_DAIFMT_DSP_A:
		aअगर0 |= 3;

		चयन (fmt & SND_SOC_DAIFMT_INV_MASK) अणु
		हाल SND_SOC_DAIFMT_NB_NF:
		हाल SND_SOC_DAIFMT_IB_NF:
			अवरोध;
		शेष:
			वापस -EINVAL;
		पूर्ण
		अवरोध;

	हाल SND_SOC_DAIFMT_RIGHT_J:
		अवरोध;
	हाल SND_SOC_DAIFMT_LEFT_J:
		aअगर0 |= 1;
		अवरोध;
	हाल SND_SOC_DAIFMT_I2S:
		aअगर0 |= 2;
		अवरोध;
	शेष:
		वापस -EINVAL;
	पूर्ण

	चयन (fmt & SND_SOC_DAIFMT_INV_MASK) अणु
	हाल SND_SOC_DAIFMT_NB_NF:
		अवरोध;
	हाल SND_SOC_DAIFMT_IB_NF:
		aअगर0 |= WM8962_BCLK_INV;
		अवरोध;
	हाल SND_SOC_DAIFMT_NB_IF:
		aअगर0 |= WM8962_LRCLK_INV;
		अवरोध;
	हाल SND_SOC_DAIFMT_IB_IF:
		aअगर0 |= WM8962_BCLK_INV | WM8962_LRCLK_INV;
		अवरोध;
	शेष:
		वापस -EINVAL;
	पूर्ण

	चयन (fmt & SND_SOC_DAIFMT_MASTER_MASK) अणु
	हाल SND_SOC_DAIFMT_CBM_CFM:
		aअगर0 |= WM8962_MSTR;
		अवरोध;
	हाल SND_SOC_DAIFMT_CBS_CFS:
		अवरोध;
	शेष:
		वापस -EINVAL;
	पूर्ण

	snd_soc_component_update_bits(component, WM8962_AUDIO_INTERFACE_0,
			    WM8962_FMT_MASK | WM8962_BCLK_INV | WM8962_MSTR |
			    WM8962_LRCLK_INV, aअगर0);

	वापस 0;
पूर्ण

काष्ठा _fll_भाग अणु
	u16 fll_fratio;
	u16 fll_outभाग;
	u16 fll_refclk_भाग;
	u16 n;
	u16 theta;
	u16 lambda;
पूर्ण;

/* The size in bits of the FLL भागide multiplied by 10
 * to allow rounding later */
#घोषणा FIXED_FLL_SIZE ((1 << 16) * 10)

अटल काष्ठा अणु
	अचिन्हित पूर्णांक min;
	अचिन्हित पूर्णांक max;
	u16 fll_fratio;
	पूर्णांक ratio;
पूर्ण fll_fratios[] = अणु
	अणु       0,    64000, 4, 16 पूर्ण,
	अणु   64000,   128000, 3,  8 पूर्ण,
	अणु  128000,   256000, 2,  4 पूर्ण,
	अणु  256000,  1000000, 1,  2 पूर्ण,
	अणु 1000000, 13500000, 0,  1 पूर्ण,
पूर्ण;

अटल पूर्णांक fll_factors(काष्ठा _fll_भाग *fll_भाग, अचिन्हित पूर्णांक Fref,
		       अचिन्हित पूर्णांक Fout)
अणु
	अचिन्हित पूर्णांक target;
	अचिन्हित पूर्णांक भाग;
	अचिन्हित पूर्णांक fratio, gcd_fll;
	पूर्णांक i;

	/* Fref must be <=13.5MHz */
	भाग = 1;
	fll_भाग->fll_refclk_भाग = 0;
	जबतक ((Fref / भाग) > 13500000) अणु
		भाग *= 2;
		fll_भाग->fll_refclk_भाग++;

		अगर (भाग > 4) अणु
			pr_err("Can't scale %dMHz input down to <=13.5MHz\n",
			       Fref);
			वापस -EINVAL;
		पूर्ण
	पूर्ण

	pr_debug("FLL Fref=%u Fout=%u\n", Fref, Fout);

	/* Apply the भागision क्रम our reमुख्यing calculations */
	Fref /= भाग;

	/* Fvco should be 90-100MHz; करोn't check the upper bound */
	भाग = 2;
	जबतक (Fout * भाग < 90000000) अणु
		भाग++;
		अगर (भाग > 64) अणु
			pr_err("Unable to find FLL_OUTDIV for Fout=%uHz\n",
			       Fout);
			वापस -EINVAL;
		पूर्ण
	पूर्ण
	target = Fout * भाग;
	fll_भाग->fll_outभाग = भाग - 1;

	pr_debug("FLL Fvco=%dHz\n", target);

	/* Find an appropriate FLL_FRATIO and factor it out of the target */
	क्रम (i = 0; i < ARRAY_SIZE(fll_fratios); i++) अणु
		अगर (fll_fratios[i].min <= Fref && Fref <= fll_fratios[i].max) अणु
			fll_भाग->fll_fratio = fll_fratios[i].fll_fratio;
			fratio = fll_fratios[i].ratio;
			अवरोध;
		पूर्ण
	पूर्ण
	अगर (i == ARRAY_SIZE(fll_fratios)) अणु
		pr_err("Unable to find FLL_FRATIO for Fref=%uHz\n", Fref);
		वापस -EINVAL;
	पूर्ण

	fll_भाग->n = target / (fratio * Fref);

	अगर (target % Fref == 0) अणु
		fll_भाग->theta = 0;
		fll_भाग->lambda = 1;
	पूर्ण अन्यथा अणु
		gcd_fll = gcd(target, fratio * Fref);

		fll_भाग->theta = (target - (fll_भाग->n * fratio * Fref))
			/ gcd_fll;
		fll_भाग->lambda = (fratio * Fref) / gcd_fll;
	पूर्ण

	pr_debug("FLL N=%x THETA=%x LAMBDA=%x\n",
		 fll_भाग->n, fll_भाग->theta, fll_भाग->lambda);
	pr_debug("FLL_FRATIO=%x FLL_OUTDIV=%x FLL_REFCLK_DIV=%x\n",
		 fll_भाग->fll_fratio, fll_भाग->fll_outभाग,
		 fll_भाग->fll_refclk_भाग);

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_set_fll(काष्ठा snd_soc_component *component, पूर्णांक fll_id, पूर्णांक source,
			  अचिन्हित पूर्णांक Fref, अचिन्हित पूर्णांक Fout)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	काष्ठा _fll_भाग fll_भाग;
	अचिन्हित दीर्घ समयout;
	पूर्णांक ret;
	पूर्णांक fll1 = 0;

	/* Any change? */
	अगर (source == wm8962->fll_src && Fref == wm8962->fll_fref &&
	    Fout == wm8962->fll_fout)
		वापस 0;

	अगर (Fout == 0) अणु
		dev_dbg(component->dev, "FLL disabled\n");

		wm8962->fll_fref = 0;
		wm8962->fll_fout = 0;

		snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_1,
				    WM8962_FLL_ENA, 0);

		pm_runसमय_put(component->dev);

		वापस 0;
	पूर्ण

	ret = fll_factors(&fll_भाग, Fref, Fout);
	अगर (ret != 0)
		वापस ret;

	/* Parameters good, disable so we can reprogram */
	snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_1, WM8962_FLL_ENA, 0);

	चयन (fll_id) अणु
	हाल WM8962_FLL_MCLK:
	हाल WM8962_FLL_BCLK:
	हाल WM8962_FLL_OSC:
		fll1 |= (fll_id - 1) << WM8962_FLL_REFCLK_SRC_SHIFT;
		अवरोध;
	हाल WM8962_FLL_INT:
		snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_1,
				    WM8962_FLL_OSC_ENA, WM8962_FLL_OSC_ENA);
		snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_5,
				    WM8962_FLL_FRC_NCO, WM8962_FLL_FRC_NCO);
		अवरोध;
	शेष:
		dev_err(component->dev, "Unknown FLL source %d\n", ret);
		वापस -EINVAL;
	पूर्ण

	अगर (fll_भाग.theta)
		fll1 |= WM8962_FLL_FRAC;

	/* Stop the FLL जबतक we reconfigure */
	snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_1, WM8962_FLL_ENA, 0);

	snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_2,
			    WM8962_FLL_OUTDIV_MASK |
			    WM8962_FLL_REFCLK_DIV_MASK,
			    (fll_भाग.fll_outभाग << WM8962_FLL_OUTDIV_SHIFT) |
			    (fll_भाग.fll_refclk_भाग));

	snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_3,
			    WM8962_FLL_FRATIO_MASK, fll_भाग.fll_fratio);

	snd_soc_component_ग_लिखो(component, WM8962_FLL_CONTROL_6, fll_भाग.theta);
	snd_soc_component_ग_लिखो(component, WM8962_FLL_CONTROL_7, fll_भाग.lambda);
	snd_soc_component_ग_लिखो(component, WM8962_FLL_CONTROL_8, fll_भाग.n);

	reinit_completion(&wm8962->fll_lock);

	ret = pm_runसमय_get_sync(component->dev);
	अगर (ret < 0) अणु
		pm_runसमय_put_noidle(component->dev);
		dev_err(component->dev, "Failed to resume device: %d\n", ret);
		वापस ret;
	पूर्ण

	snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_1,
			    WM8962_FLL_FRAC | WM8962_FLL_REFCLK_SRC_MASK |
			    WM8962_FLL_ENA, fll1 | WM8962_FLL_ENA);

	dev_dbg(component->dev, "FLL configured for %dHz->%dHz\n", Fref, Fout);

	/* This should be a massive overestimate but go even
	 * higher अगर we'll error out
	 */
	अगर (wm8962->irq)
		समयout = msecs_to_jअगरfies(5);
	अन्यथा
		समयout = msecs_to_jअगरfies(1);

	समयout = रुको_क्रम_completion_समयout(&wm8962->fll_lock,
					      समयout);

	अगर (समयout == 0 && wm8962->irq) अणु
		dev_err(component->dev, "FLL lock timed out");
		snd_soc_component_update_bits(component, WM8962_FLL_CONTROL_1,
				    WM8962_FLL_ENA, 0);
		pm_runसमय_put(component->dev);
		वापस -ETIMEDOUT;
	पूर्ण

	wm8962->fll_fref = Fref;
	wm8962->fll_fout = Fout;
	wm8962->fll_src = source;

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_mute(काष्ठा snd_soc_dai *dai, पूर्णांक mute, पूर्णांक direction)
अणु
	काष्ठा snd_soc_component *component = dai->component;
	पूर्णांक val, ret;

	अगर (mute)
		val = WM8962_DAC_MUTE | WM8962_DAC_MUTE_ALT;
	अन्यथा
		val = 0;

	/**
	 * The DAC mute bit is mirrored in two रेजिस्टरs, update both to keep
	 * the रेजिस्टर cache consistent.
	 */
	ret = snd_soc_component_update_bits(component, WM8962_CLASS_D_CONTROL_1,
				  WM8962_DAC_MUTE_ALT, val);
	अगर (ret < 0)
		वापस ret;

	वापस snd_soc_component_update_bits(component, WM8962_ADC_DAC_CONTROL_1,
				   WM8962_DAC_MUTE, val);
पूर्ण

#घोषणा WM8962_RATES (SNDRV_PCM_RATE_8000_48000 |\
		SNDRV_PCM_RATE_88200 | SNDRV_PCM_RATE_96000)

#घोषणा WM8962_FORMATS (SNDRV_PCM_FMTBIT_S16_LE | SNDRV_PCM_FMTBIT_S20_3LE |\
			SNDRV_PCM_FMTBIT_S24_LE | SNDRV_PCM_FMTBIT_S32_LE)

अटल स्थिर काष्ठा snd_soc_dai_ops wm8962_dai_ops = अणु
	.hw_params = wm8962_hw_params,
	.set_sysclk = wm8962_set_dai_sysclk,
	.set_fmt = wm8962_set_dai_fmt,
	.mute_stream = wm8962_mute,
	.no_capture_mute = 1,
पूर्ण;

अटल काष्ठा snd_soc_dai_driver wm8962_dai = अणु
	.name = "wm8962",
	.playback = अणु
		.stream_name = "Playback",
		.channels_min = 1,
		.channels_max = 2,
		.rates = WM8962_RATES,
		.क्रमmats = WM8962_FORMATS,
	पूर्ण,
	.capture = अणु
		.stream_name = "Capture",
		.channels_min = 1,
		.channels_max = 2,
		.rates = WM8962_RATES,
		.क्रमmats = WM8962_FORMATS,
	पूर्ण,
	.ops = &wm8962_dai_ops,
	.symmetric_rate = 1,
पूर्ण;

अटल व्योम wm8962_mic_work(काष्ठा work_काष्ठा *work)
अणु
	काष्ठा wm8962_priv *wm8962 = container_of(work,
						  काष्ठा wm8962_priv,
						  mic_work.work);
	काष्ठा snd_soc_component *component = wm8962->component;
	पूर्णांक status = 0;
	पूर्णांक irq_pol = 0;
	पूर्णांक reg;

	reg = snd_soc_component_पढ़ो(component, WM8962_ADDITIONAL_CONTROL_4);

	अगर (reg & WM8962_MICDET_STS) अणु
		status |= SND_JACK_MICROPHONE;
		irq_pol |= WM8962_MICD_IRQ_POL;
	पूर्ण

	अगर (reg & WM8962_MICSHORT_STS) अणु
		status |= SND_JACK_BTN_0;
		irq_pol |= WM8962_MICSCD_IRQ_POL;
	पूर्ण

	snd_soc_jack_report(wm8962->jack, status,
			    SND_JACK_MICROPHONE | SND_JACK_BTN_0);

	snd_soc_component_update_bits(component, WM8962_MICINT_SOURCE_POL,
			    WM8962_MICSCD_IRQ_POL |
			    WM8962_MICD_IRQ_POL, irq_pol);
पूर्ण

अटल irqवापस_t wm8962_irq(पूर्णांक irq, व्योम *data)
अणु
	काष्ठा device *dev = data;
	काष्ठा wm8962_priv *wm8962 = dev_get_drvdata(dev);
	अचिन्हित पूर्णांक mask;
	अचिन्हित पूर्णांक active;
	पूर्णांक reg, ret;

	ret = pm_runसमय_get_sync(dev);
	अगर (ret < 0) अणु
		pm_runसमय_put_noidle(dev);
		dev_err(dev, "Failed to resume: %d\n", ret);
		वापस IRQ_NONE;
	पूर्ण

	ret = regmap_पढ़ो(wm8962->regmap, WM8962_INTERRUPT_STATUS_2_MASK,
			  &mask);
	अगर (ret != 0) अणु
		pm_runसमय_put(dev);
		dev_err(dev, "Failed to read interrupt mask: %d\n",
			ret);
		वापस IRQ_NONE;
	पूर्ण

	ret = regmap_पढ़ो(wm8962->regmap, WM8962_INTERRUPT_STATUS_2, &active);
	अगर (ret != 0) अणु
		pm_runसमय_put(dev);
		dev_err(dev, "Failed to read interrupt: %d\n", ret);
		वापस IRQ_NONE;
	पूर्ण

	active &= ~mask;

	अगर (!active) अणु
		pm_runसमय_put(dev);
		वापस IRQ_NONE;
	पूर्ण

	/* Acknowledge the पूर्णांकerrupts */
	ret = regmap_ग_लिखो(wm8962->regmap, WM8962_INTERRUPT_STATUS_2, active);
	अगर (ret != 0)
		dev_warn(dev, "Failed to ack interrupt: %d\n", ret);

	अगर (active & WM8962_FLL_LOCK_EINT) अणु
		dev_dbg(dev, "FLL locked\n");
		complete(&wm8962->fll_lock);
	पूर्ण

	अगर (active & WM8962_FIFOS_ERR_EINT)
		dev_err(dev, "FIFO error\n");

	अगर (active & WM8962_TEMP_SHUT_EINT) अणु
		dev_crit(dev, "Thermal shutdown\n");

		ret = regmap_पढ़ो(wm8962->regmap,
				  WM8962_THERMAL_SHUTDOWN_STATUS,  &reg);
		अगर (ret != 0) अणु
			dev_warn(dev, "Failed to read thermal status: %d\n",
				 ret);
			reg = 0;
		पूर्ण

		अगर (reg & WM8962_TEMP_ERR_HP)
			dev_crit(dev, "Headphone thermal error\n");
		अगर (reg & WM8962_TEMP_WARN_HP)
			dev_crit(dev, "Headphone thermal warning\n");
		अगर (reg & WM8962_TEMP_ERR_SPK)
			dev_crit(dev, "Speaker thermal error\n");
		अगर (reg & WM8962_TEMP_WARN_SPK)
			dev_crit(dev, "Speaker thermal warning\n");
	पूर्ण

	अगर (active & (WM8962_MICSCD_EINT | WM8962_MICD_EINT)) अणु
		dev_dbg(dev, "Microphone event detected\n");

#अगर_अघोषित CONFIG_SND_SOC_WM8962_MODULE
		trace_snd_soc_jack_irq(dev_name(dev));
#पूर्ण_अगर

		pm_wakeup_event(dev, 300);

		queue_delayed_work(प्रणाली_घातer_efficient_wq,
				   &wm8962->mic_work,
				   msecs_to_jअगरfies(250));
	पूर्ण

	pm_runसमय_put(dev);

	वापस IRQ_HANDLED;
पूर्ण

/**
 * wm8962_mic_detect - Enable microphone detection via the WM8962 IRQ
 *
 * @component:  WM8962 component
 * @jack:   jack to report detection events on
 *
 * Enable microphone detection via IRQ on the WM8962.  If GPIOs are
 * being used to bring out संकेतs to the processor then only platक्रमm
 * data configuration is needed क्रम WM8962 and processor GPIOs should
 * be configured using snd_soc_jack_add_gpios() instead.
 *
 * If no jack is supplied detection will be disabled.
 */
पूर्णांक wm8962_mic_detect(काष्ठा snd_soc_component *component, काष्ठा snd_soc_jack *jack)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	काष्ठा snd_soc_dapm_context *dapm = snd_soc_component_get_dapm(component);
	पूर्णांक irq_mask, enable;

	wm8962->jack = jack;
	अगर (jack) अणु
		irq_mask = 0;
		enable = WM8962_MICDET_ENA;
	पूर्ण अन्यथा अणु
		irq_mask = WM8962_MICD_EINT | WM8962_MICSCD_EINT;
		enable = 0;
	पूर्ण

	snd_soc_component_update_bits(component, WM8962_INTERRUPT_STATUS_2_MASK,
			    WM8962_MICD_EINT | WM8962_MICSCD_EINT, irq_mask);
	snd_soc_component_update_bits(component, WM8962_ADDITIONAL_CONTROL_4,
			    WM8962_MICDET_ENA, enable);

	/* Send an initial empty report */
	snd_soc_jack_report(wm8962->jack, 0,
			    SND_JACK_MICROPHONE | SND_JACK_BTN_0);

	snd_soc_dapm_mutex_lock(dapm);

	अगर (jack) अणु
		snd_soc_dapm_क्रमce_enable_pin_unlocked(dapm, "SYSCLK");
		snd_soc_dapm_क्रमce_enable_pin_unlocked(dapm, "MICBIAS");
	पूर्ण अन्यथा अणु
		snd_soc_dapm_disable_pin_unlocked(dapm, "SYSCLK");
		snd_soc_dapm_disable_pin_unlocked(dapm, "MICBIAS");
	पूर्ण

	snd_soc_dapm_mutex_unlock(dapm);

	वापस 0;
पूर्ण
EXPORT_SYMBOL_GPL(wm8962_mic_detect);

अटल पूर्णांक beep_rates[] = अणु
	500, 1000, 2000, 4000,
पूर्ण;

अटल व्योम wm8962_beep_work(काष्ठा work_काष्ठा *work)
अणु
	काष्ठा wm8962_priv *wm8962 =
		container_of(work, काष्ठा wm8962_priv, beep_work);
	काष्ठा snd_soc_component *component = wm8962->component;
	काष्ठा snd_soc_dapm_context *dapm = snd_soc_component_get_dapm(component);
	पूर्णांक i;
	पूर्णांक reg = 0;
	पूर्णांक best = 0;

	अगर (wm8962->beep_rate) अणु
		क्रम (i = 0; i < ARRAY_SIZE(beep_rates); i++) अणु
			अगर (असल(wm8962->beep_rate - beep_rates[i]) <
			    असल(wm8962->beep_rate - beep_rates[best]))
				best = i;
		पूर्ण

		dev_dbg(component->dev, "Set beep rate %dHz for requested %dHz\n",
			beep_rates[best], wm8962->beep_rate);

		reg = WM8962_BEEP_ENA | (best << WM8962_BEEP_RATE_SHIFT);

		snd_soc_dapm_enable_pin(dapm, "Beep");
	पूर्ण अन्यथा अणु
		dev_dbg(component->dev, "Disabling beep\n");
		snd_soc_dapm_disable_pin(dapm, "Beep");
	पूर्ण

	snd_soc_component_update_bits(component, WM8962_BEEP_GENERATOR_1,
			    WM8962_BEEP_ENA | WM8962_BEEP_RATE_MASK, reg);

	snd_soc_dapm_sync(dapm);
पूर्ण

/* For usability define a way of injecting beep events क्रम the device -
 * many प्रणालीs will not have a keyboard.
 */
अटल पूर्णांक wm8962_beep_event(काष्ठा input_dev *dev, अचिन्हित पूर्णांक type,
			     अचिन्हित पूर्णांक code, पूर्णांक hz)
अणु
	काष्ठा snd_soc_component *component = input_get_drvdata(dev);
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	dev_dbg(component->dev, "Beep event %x %x\n", code, hz);

	चयन (code) अणु
	हाल SND_BELL:
		अगर (hz)
			hz = 1000;
		fallthrough;
	हाल SND_TONE:
		अवरोध;
	शेष:
		वापस -1;
	पूर्ण

	/* Kick the beep from a workqueue */
	wm8962->beep_rate = hz;
	schedule_work(&wm8962->beep_work);
	वापस 0;
पूर्ण

अटल sमाप_प्रकार wm8962_beep_set(काष्ठा device *dev,
			       काष्ठा device_attribute *attr,
			       स्थिर अक्षर *buf, माप_प्रकार count)
अणु
	काष्ठा wm8962_priv *wm8962 = dev_get_drvdata(dev);
	दीर्घ पूर्णांक समय;
	पूर्णांक ret;

	ret = kम_से_दीर्घ(buf, 10, &समय);
	अगर (ret != 0)
		वापस ret;

	input_event(wm8962->beep, EV_SND, SND_TONE, समय);

	वापस count;
पूर्ण

अटल DEVICE_ATTR(beep, 0200, शून्य, wm8962_beep_set);

अटल व्योम wm8962_init_beep(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	पूर्णांक ret;

	wm8962->beep = devm_input_allocate_device(component->dev);
	अगर (!wm8962->beep) अणु
		dev_err(component->dev, "Failed to allocate beep device\n");
		वापस;
	पूर्ण

	INIT_WORK(&wm8962->beep_work, wm8962_beep_work);
	wm8962->beep_rate = 0;

	wm8962->beep->name = "WM8962 Beep Generator";
	wm8962->beep->phys = dev_name(component->dev);
	wm8962->beep->id.bustype = BUS_I2C;

	wm8962->beep->evbit[0] = BIT_MASK(EV_SND);
	wm8962->beep->sndbit[0] = BIT_MASK(SND_BELL) | BIT_MASK(SND_TONE);
	wm8962->beep->event = wm8962_beep_event;
	wm8962->beep->dev.parent = component->dev;
	input_set_drvdata(wm8962->beep, component);

	ret = input_रेजिस्टर_device(wm8962->beep);
	अगर (ret != 0) अणु
		wm8962->beep = शून्य;
		dev_err(component->dev, "Failed to register beep device\n");
	पूर्ण

	ret = device_create_file(component->dev, &dev_attr_beep);
	अगर (ret != 0) अणु
		dev_err(component->dev, "Failed to create keyclick file: %d\n",
			ret);
	पूर्ण
पूर्ण

अटल व्योम wm8962_मुक्त_beep(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	device_हटाओ_file(component->dev, &dev_attr_beep);
	cancel_work_sync(&wm8962->beep_work);
	wm8962->beep = शून्य;

	snd_soc_component_update_bits(component, WM8962_BEEP_GENERATOR_1, WM8962_BEEP_ENA,0);
पूर्ण

अटल व्योम wm8962_set_gpio_mode(काष्ठा wm8962_priv *wm8962, पूर्णांक gpio)
अणु
	पूर्णांक mask = 0;
	पूर्णांक val = 0;

	/* Some of the GPIOs are behind MFP configuration and need to
	 * be put पूर्णांकo GPIO mode. */
	चयन (gpio) अणु
	हाल 2:
		mask = WM8962_CLKOUT2_SEL_MASK;
		val = 1 << WM8962_CLKOUT2_SEL_SHIFT;
		अवरोध;
	हाल 3:
		mask = WM8962_CLKOUT3_SEL_MASK;
		val = 1 << WM8962_CLKOUT3_SEL_SHIFT;
		अवरोध;
	शेष:
		अवरोध;
	पूर्ण

	अगर (mask)
		regmap_update_bits(wm8962->regmap, WM8962_ANALOGUE_CLOCKING1,
				   mask, val);
पूर्ण

#अगर_घोषित CONFIG_GPIOLIB
अटल पूर्णांक wm8962_gpio_request(काष्ठा gpio_chip *chip, अचिन्हित offset)
अणु
	काष्ठा wm8962_priv *wm8962 = gpiochip_get_data(chip);

	/* The WM8962 GPIOs aren't linearly numbered.  For simplicity
	 * we export linear numbers and error out अगर the unsupported
	 * ones are requsted.
	 */
	चयन (offset + 1) अणु
	हाल 2:
	हाल 3:
	हाल 5:
	हाल 6:
		अवरोध;
	शेष:
		वापस -EINVAL;
	पूर्ण

	wm8962_set_gpio_mode(wm8962, offset + 1);

	वापस 0;
पूर्ण

अटल व्योम wm8962_gpio_set(काष्ठा gpio_chip *chip, अचिन्हित offset, पूर्णांक value)
अणु
	काष्ठा wm8962_priv *wm8962 = gpiochip_get_data(chip);
	काष्ठा snd_soc_component *component = wm8962->component;

	snd_soc_component_update_bits(component, WM8962_GPIO_BASE + offset,
			    WM8962_GP2_LVL, !!value << WM8962_GP2_LVL_SHIFT);
पूर्ण

अटल पूर्णांक wm8962_gpio_direction_out(काष्ठा gpio_chip *chip,
				     अचिन्हित offset, पूर्णांक value)
अणु
	काष्ठा wm8962_priv *wm8962 = gpiochip_get_data(chip);
	काष्ठा snd_soc_component *component = wm8962->component;
	पूर्णांक ret, val;

	/* Force function 1 (logic output) */
	val = (1 << WM8962_GP2_FN_SHIFT) | (value << WM8962_GP2_LVL_SHIFT);

	ret = snd_soc_component_update_bits(component, WM8962_GPIO_BASE + offset,
				  WM8962_GP2_FN_MASK | WM8962_GP2_LVL, val);
	अगर (ret < 0)
		वापस ret;

	वापस 0;
पूर्ण

अटल स्थिर काष्ठा gpio_chip wm8962_ढाँचा_chip = अणु
	.label			= "wm8962",
	.owner			= THIS_MODULE,
	.request		= wm8962_gpio_request,
	.direction_output	= wm8962_gpio_direction_out,
	.set			= wm8962_gpio_set,
	.can_sleep		= 1,
पूर्ण;

अटल व्योम wm8962_init_gpio(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	काष्ठा wm8962_pdata *pdata = &wm8962->pdata;
	पूर्णांक ret;

	wm8962->gpio_chip = wm8962_ढाँचा_chip;
	wm8962->gpio_chip.ngpio = WM8962_MAX_GPIO;
	wm8962->gpio_chip.parent = component->dev;

	अगर (pdata->gpio_base)
		wm8962->gpio_chip.base = pdata->gpio_base;
	अन्यथा
		wm8962->gpio_chip.base = -1;

	ret = gpiochip_add_data(&wm8962->gpio_chip, wm8962);
	अगर (ret != 0)
		dev_err(component->dev, "Failed to add GPIOs: %d\n", ret);
पूर्ण

अटल व्योम wm8962_मुक्त_gpio(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	gpiochip_हटाओ(&wm8962->gpio_chip);
पूर्ण
#अन्यथा
अटल व्योम wm8962_init_gpio(काष्ठा snd_soc_component *component)
अणु
पूर्ण

अटल व्योम wm8962_मुक्त_gpio(काष्ठा snd_soc_component *component)
अणु
पूर्ण
#पूर्ण_अगर

अटल पूर्णांक wm8962_probe(काष्ठा snd_soc_component *component)
अणु
	काष्ठा snd_soc_dapm_context *dapm = snd_soc_component_get_dapm(component);
	पूर्णांक ret;
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);
	पूर्णांक i;
	bool dmicclk, dmicdat;

	wm8962->component = component;

	wm8962->disable_nb[0].notअगरier_call = wm8962_regulator_event_0;
	wm8962->disable_nb[1].notअगरier_call = wm8962_regulator_event_1;
	wm8962->disable_nb[2].notअगरier_call = wm8962_regulator_event_2;
	wm8962->disable_nb[3].notअगरier_call = wm8962_regulator_event_3;
	wm8962->disable_nb[4].notअगरier_call = wm8962_regulator_event_4;
	wm8962->disable_nb[5].notअगरier_call = wm8962_regulator_event_5;
	wm8962->disable_nb[6].notअगरier_call = wm8962_regulator_event_6;
	wm8962->disable_nb[7].notअगरier_call = wm8962_regulator_event_7;

	/* This should really be moved पूर्णांकo the regulator core */
	क्रम (i = 0; i < ARRAY_SIZE(wm8962->supplies); i++) अणु
		ret = devm_regulator_रेजिस्टर_notअगरier(
						wm8962->supplies[i].consumer,
						&wm8962->disable_nb[i]);
		अगर (ret != 0) अणु
			dev_err(component->dev,
				"Failed to register regulator notifier: %d\n",
				ret);
		पूर्ण
	पूर्ण

	wm8962_add_widमाला_लो(component);

	/* Save boards having to disable DMIC when not in use */
	dmicclk = false;
	dmicdat = false;
	क्रम (i = 1; i < WM8962_MAX_GPIO; i++) अणु
		/*
		 * Register 515 (WM8962_GPIO_BASE + 3) करोes not exist,
		 * so skip its access
		 */
		अगर (i == 3)
			जारी;
		चयन (snd_soc_component_पढ़ो(component, WM8962_GPIO_BASE + i)
			& WM8962_GP2_FN_MASK) अणु
		हाल WM8962_GPIO_FN_DMICCLK:
			dmicclk = true;
			अवरोध;
		हाल WM8962_GPIO_FN_DMICDAT:
			dmicdat = true;
			अवरोध;
		शेष:
			अवरोध;
		पूर्ण
	पूर्ण
	अगर (!dmicclk || !dmicdat) अणु
		dev_dbg(component->dev, "DMIC not in use, disabling\n");
		snd_soc_dapm_nc_pin(dapm, "DMICDAT");
	पूर्ण
	अगर (dmicclk != dmicdat)
		dev_warn(component->dev, "DMIC GPIOs partially configured\n");

	wm8962_init_beep(component);
	wm8962_init_gpio(component);

	वापस 0;
पूर्ण

अटल व्योम wm8962_हटाओ(काष्ठा snd_soc_component *component)
अणु
	काष्ठा wm8962_priv *wm8962 = snd_soc_component_get_drvdata(component);

	cancel_delayed_work_sync(&wm8962->mic_work);

	wm8962_मुक्त_gpio(component);
	wm8962_मुक्त_beep(component);
पूर्ण

अटल स्थिर काष्ठा snd_soc_component_driver soc_component_dev_wm8962 = अणु
	.probe			= wm8962_probe,
	.हटाओ			= wm8962_हटाओ,
	.set_bias_level		= wm8962_set_bias_level,
	.set_pll		= wm8962_set_fll,
	.use_pmकरोwn_समय	= 1,
	.endianness		= 1,
	.non_legacy_dai_naming	= 1,
पूर्ण;

/* Improve घातer consumption क्रम IN4 DC measurement mode */
अटल स्थिर काष्ठा reg_sequence wm8962_dc_measure[] = अणु
	अणु 0xfd, 0x1 पूर्ण,
	अणु 0xcc, 0x40 पूर्ण,
	अणु 0xfd, 0 पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा regmap_config wm8962_regmap = अणु
	.reg_bits = 16,
	.val_bits = 16,

	.max_रेजिस्टर = WM8962_MAX_REGISTER,
	.reg_शेषs = wm8962_reg,
	.num_reg_शेषs = ARRAY_SIZE(wm8962_reg),
	.अस्थिर_reg = wm8962_अस्थिर_रेजिस्टर,
	.पढ़ोable_reg = wm8962_पढ़ोable_रेजिस्टर,
	.cache_type = REGCACHE_RBTREE,
पूर्ण;

अटल पूर्णांक wm8962_set_pdata_from_of(काष्ठा i2c_client *i2c,
				    काष्ठा wm8962_pdata *pdata)
अणु
	स्थिर काष्ठा device_node *np = i2c->dev.of_node;
	u32 val32;
	पूर्णांक i;

	अगर (of_property_पढ़ो_bool(np, "spk-mono"))
		pdata->spk_mono = true;

	अगर (of_property_पढ़ो_u32(np, "mic-cfg", &val32) >= 0)
		pdata->mic_cfg = val32;

	अगर (of_property_पढ़ो_u32_array(np, "gpio-cfg", pdata->gpio_init,
				       ARRAY_SIZE(pdata->gpio_init)) >= 0)
		क्रम (i = 0; i < ARRAY_SIZE(pdata->gpio_init); i++) अणु
			/*
			 * The range of GPIO रेजिस्टर value is [0x0, 0xffff]
			 * While the शेष value of each रेजिस्टर is 0x0
			 * Any other value will be regarded as शेष value
			 */
			अगर (pdata->gpio_init[i] > 0xffff)
				pdata->gpio_init[i] = 0x0;
		पूर्ण

	pdata->mclk = devm_clk_get(&i2c->dev, शून्य);

	वापस 0;
पूर्ण

अटल पूर्णांक wm8962_i2c_probe(काष्ठा i2c_client *i2c,
			    स्थिर काष्ठा i2c_device_id *id)
अणु
	काष्ठा wm8962_pdata *pdata = dev_get_platdata(&i2c->dev);
	काष्ठा wm8962_priv *wm8962;
	अचिन्हित पूर्णांक reg;
	पूर्णांक ret, i, irq_pol, trigger;

	wm8962 = devm_kzalloc(&i2c->dev, माप(*wm8962), GFP_KERNEL);
	अगर (wm8962 == शून्य)
		वापस -ENOMEM;

	mutex_init(&wm8962->dsp2_ena_lock);

	i2c_set_clientdata(i2c, wm8962);

	INIT_DELAYED_WORK(&wm8962->mic_work, wm8962_mic_work);
	init_completion(&wm8962->fll_lock);
	wm8962->irq = i2c->irq;

	/* If platक्रमm data was supplied, update the शेष data in priv */
	अगर (pdata) अणु
		स_नकल(&wm8962->pdata, pdata, माप(काष्ठा wm8962_pdata));
	पूर्ण अन्यथा अगर (i2c->dev.of_node) अणु
		ret = wm8962_set_pdata_from_of(i2c, &wm8962->pdata);
		अगर (ret != 0)
			वापस ret;
	पूर्ण

	/* Mark the mclk poपूर्णांकer to शून्य अगर no mclk asचिन्हित */
	अगर (IS_ERR(wm8962->pdata.mclk)) अणु
		/* But करो not ignore the request क्रम probe defer */
		अगर (PTR_ERR(wm8962->pdata.mclk) == -EPROBE_DEFER)
			वापस -EPROBE_DEFER;
		wm8962->pdata.mclk = शून्य;
	पूर्ण

	क्रम (i = 0; i < ARRAY_SIZE(wm8962->supplies); i++)
		wm8962->supplies[i].supply = wm8962_supply_names[i];

	ret = devm_regulator_bulk_get(&i2c->dev, ARRAY_SIZE(wm8962->supplies),
				 wm8962->supplies);
	अगर (ret != 0) अणु
		dev_err(&i2c->dev, "Failed to request supplies: %d\n", ret);
		जाओ err;
	पूर्ण

	ret = regulator_bulk_enable(ARRAY_SIZE(wm8962->supplies),
				    wm8962->supplies);
	अगर (ret != 0) अणु
		dev_err(&i2c->dev, "Failed to enable supplies: %d\n", ret);
		वापस ret;
	पूर्ण

	wm8962->regmap = devm_regmap_init_i2c(i2c, &wm8962_regmap);
	अगर (IS_ERR(wm8962->regmap)) अणु
		ret = PTR_ERR(wm8962->regmap);
		dev_err(&i2c->dev, "Failed to allocate regmap: %d\n", ret);
		जाओ err_enable;
	पूर्ण

	/*
	 * We haven't marked the chip revision as अस्थिर due to
	 * sharing a रेजिस्टर with the right input volume; explicitly
	 * bypass the cache to पढ़ो it.
	 */
	regcache_cache_bypass(wm8962->regmap, true);

	ret = regmap_पढ़ो(wm8962->regmap, WM8962_SOFTWARE_RESET, &reg);
	अगर (ret < 0) अणु
		dev_err(&i2c->dev, "Failed to read ID register\n");
		जाओ err_enable;
	पूर्ण
	अगर (reg != 0x6243) अणु
		dev_err(&i2c->dev,
			"Device is not a WM8962, ID %x != 0x6243\n", reg);
		ret = -EINVAL;
		जाओ err_enable;
	पूर्ण

	ret = regmap_पढ़ो(wm8962->regmap, WM8962_RIGHT_INPUT_VOLUME, &reg);
	अगर (ret < 0) अणु
		dev_err(&i2c->dev, "Failed to read device revision: %d\n",
			ret);
		जाओ err_enable;
	पूर्ण

	dev_info(&i2c->dev, "customer id %x revision %c\n",
		 (reg & WM8962_CUST_ID_MASK) >> WM8962_CUST_ID_SHIFT,
		 ((reg & WM8962_CHIP_REV_MASK) >> WM8962_CHIP_REV_SHIFT)
		 + 'A');

	regcache_cache_bypass(wm8962->regmap, false);

	ret = wm8962_reset(wm8962);
	अगर (ret < 0) अणु
		dev_err(&i2c->dev, "Failed to issue reset\n");
		जाओ err_enable;
	पूर्ण

	/* SYSCLK शेषs to on; make sure it is off so we can safely
	 * ग_लिखो to रेजिस्टरs अगर the device is deघड़ीed.
	 */
	regmap_update_bits(wm8962->regmap, WM8962_CLOCKING2,
			   WM8962_SYSCLK_ENA, 0);

	/* Ensure we have soft control over all रेजिस्टरs */
	regmap_update_bits(wm8962->regmap, WM8962_CLOCKING2,
			   WM8962_CLKREG_OVD, WM8962_CLKREG_OVD);

	/* Ensure that the oscillator and PLLs are disabled */
	regmap_update_bits(wm8962->regmap, WM8962_PLL2,
			   WM8962_OSC_ENA | WM8962_PLL2_ENA | WM8962_PLL3_ENA,
			   0);

	/* Apply अटल configuration क्रम GPIOs */
	क्रम (i = 0; i < ARRAY_SIZE(wm8962->pdata.gpio_init); i++)
		अगर (wm8962->pdata.gpio_init[i]) अणु
			wm8962_set_gpio_mode(wm8962, i + 1);
			regmap_ग_लिखो(wm8962->regmap, 0x200 + i,
				     wm8962->pdata.gpio_init[i] & 0xffff);
		पूर्ण


	/* Put the speakers पूर्णांकo mono mode? */
	अगर (wm8962->pdata.spk_mono)
		regmap_update_bits(wm8962->regmap, WM8962_CLASS_D_CONTROL_2,
				   WM8962_SPK_MONO_MASK, WM8962_SPK_MONO);

	/* Micbias setup, detection enable and detection
	 * threasholds. */
	अगर (wm8962->pdata.mic_cfg)
		regmap_update_bits(wm8962->regmap, WM8962_ADDITIONAL_CONTROL_4,
				   WM8962_MICDET_ENA |
				   WM8962_MICDET_THR_MASK |
				   WM8962_MICSHORT_THR_MASK |
				   WM8962_MICBIAS_LVL,
				   wm8962->pdata.mic_cfg);

	/* Latch volume update bits */
	regmap_update_bits(wm8962->regmap, WM8962_LEFT_INPUT_VOLUME,
			   WM8962_IN_VU, WM8962_IN_VU);
	regmap_update_bits(wm8962->regmap, WM8962_RIGHT_INPUT_VOLUME,
			   WM8962_IN_VU, WM8962_IN_VU);
	regmap_update_bits(wm8962->regmap, WM8962_LEFT_ADC_VOLUME,
			   WM8962_ADC_VU, WM8962_ADC_VU);
	regmap_update_bits(wm8962->regmap, WM8962_RIGHT_ADC_VOLUME,
			   WM8962_ADC_VU, WM8962_ADC_VU);
	regmap_update_bits(wm8962->regmap, WM8962_LEFT_DAC_VOLUME,
			   WM8962_DAC_VU, WM8962_DAC_VU);
	regmap_update_bits(wm8962->regmap, WM8962_RIGHT_DAC_VOLUME,
			   WM8962_DAC_VU, WM8962_DAC_VU);
	regmap_update_bits(wm8962->regmap, WM8962_SPKOUTL_VOLUME,
			   WM8962_SPKOUT_VU, WM8962_SPKOUT_VU);
	regmap_update_bits(wm8962->regmap, WM8962_SPKOUTR_VOLUME,
			   WM8962_SPKOUT_VU, WM8962_SPKOUT_VU);
	regmap_update_bits(wm8962->regmap, WM8962_HPOUTL_VOLUME,
			   WM8962_HPOUT_VU, WM8962_HPOUT_VU);
	regmap_update_bits(wm8962->regmap, WM8962_HPOUTR_VOLUME,
			   WM8962_HPOUT_VU, WM8962_HPOUT_VU);

	/* Stereo control क्रम EQ */
	regmap_update_bits(wm8962->regmap, WM8962_EQ1,
			   WM8962_EQ_SHARED_COEFF, 0);

	/* Don't debouce interrupts so we don't need SYSCLK */
	regmap_update_bits(wm8962->regmap, WM8962_IRQ_DEBOUNCE,
			   WM8962_FLL_LOCK_DB | WM8962_PLL3_LOCK_DB |
			   WM8962_PLL2_LOCK_DB | WM8962_TEMP_SHUT_DB,
			   0);

	अगर (wm8962->pdata.in4_dc_measure) अणु
		ret = regmap_रेजिस्टर_patch(wm8962->regmap,
					    wm8962_dc_measure,
					    ARRAY_SIZE(wm8962_dc_measure));
		अगर (ret != 0)
			dev_err(&i2c->dev,
				"Failed to configure for DC measurement: %d\n",
				ret);
	पूर्ण

	अगर (wm8962->irq) अणु
		अगर (wm8962->pdata.irq_active_low) अणु
			trigger = IRQF_TRIGGER_LOW;
			irq_pol = WM8962_IRQ_POL;
		पूर्ण अन्यथा अणु
			trigger = IRQF_TRIGGER_HIGH;
			irq_pol = 0;
		पूर्ण

		regmap_update_bits(wm8962->regmap, WM8962_INTERRUPT_CONTROL,
				   WM8962_IRQ_POL, irq_pol);

		ret = devm_request_thपढ़ोed_irq(&i2c->dev, wm8962->irq, शून्य,
						wm8962_irq,
						trigger | IRQF_ONESHOT,
						"wm8962", &i2c->dev);
		अगर (ret != 0) अणु
			dev_err(&i2c->dev, "Failed to request IRQ %d: %d\n",
				wm8962->irq, ret);
			wm8962->irq = 0;
			/* Non-fatal */
		पूर्ण अन्यथा अणु
			/* Enable some IRQs by शेष */
			regmap_update_bits(wm8962->regmap,
					   WM8962_INTERRUPT_STATUS_2_MASK,
					   WM8962_FLL_LOCK_EINT |
					   WM8962_TEMP_SHUT_EINT |
					   WM8962_FIFOS_ERR_EINT, 0);
		पूर्ण
	पूर्ण

	pm_runसमय_enable(&i2c->dev);
	pm_request_idle(&i2c->dev);

	ret = devm_snd_soc_रेजिस्टर_component(&i2c->dev,
				     &soc_component_dev_wm8962, &wm8962_dai, 1);
	अगर (ret < 0)
		जाओ err_pm_runसमय;

	regcache_cache_only(wm8962->regmap, true);

	/* The drivers should घातer up as needed */
	regulator_bulk_disable(ARRAY_SIZE(wm8962->supplies), wm8962->supplies);

	वापस 0;

err_pm_runसमय:
	pm_runसमय_disable(&i2c->dev);
err_enable:
	regulator_bulk_disable(ARRAY_SIZE(wm8962->supplies), wm8962->supplies);
err:
	वापस ret;
पूर्ण

अटल पूर्णांक wm8962_i2c_हटाओ(काष्ठा i2c_client *client)
अणु
	pm_runसमय_disable(&client->dev);
	वापस 0;
पूर्ण

#अगर_घोषित CONFIG_PM
अटल पूर्णांक wm8962_runसमय_resume(काष्ठा device *dev)
अणु
	काष्ठा wm8962_priv *wm8962 = dev_get_drvdata(dev);
	पूर्णांक ret;

	ret = clk_prepare_enable(wm8962->pdata.mclk);
	अगर (ret) अणु
		dev_err(dev, "Failed to enable MCLK: %d\n", ret);
		वापस ret;
	पूर्ण

	ret = regulator_bulk_enable(ARRAY_SIZE(wm8962->supplies),
				    wm8962->supplies);
	अगर (ret != 0) अणु
		dev_err(dev, "Failed to enable supplies: %d\n", ret);
		जाओ disable_घड़ी;
	पूर्ण

	regcache_cache_only(wm8962->regmap, false);

	wm8962_reset(wm8962);

	regcache_mark_dirty(wm8962->regmap);

	/* SYSCLK शेषs to on; make sure it is off so we can safely
	 * ग_लिखो to रेजिस्टरs अगर the device is deघड़ीed.
	 */
	regmap_ग_लिखो_bits(wm8962->regmap, WM8962_CLOCKING2,
			  WM8962_SYSCLK_ENA, 0);

	/* Ensure we have soft control over all रेजिस्टरs */
	regmap_update_bits(wm8962->regmap, WM8962_CLOCKING2,
			   WM8962_CLKREG_OVD, WM8962_CLKREG_OVD);

	/* Ensure that the oscillator and PLLs are disabled */
	regmap_update_bits(wm8962->regmap, WM8962_PLL2,
			   WM8962_OSC_ENA | WM8962_PLL2_ENA | WM8962_PLL3_ENA,
			   0);

	regcache_sync(wm8962->regmap);

	regmap_update_bits(wm8962->regmap, WM8962_ANTI_POP,
			   WM8962_STARTUP_BIAS_ENA | WM8962_VMID_BUF_ENA,
			   WM8962_STARTUP_BIAS_ENA | WM8962_VMID_BUF_ENA);

	/* Bias enable at 2*5k (fast start-up) */
	regmap_update_bits(wm8962->regmap, WM8962_PWR_MGMT_1,
			   WM8962_BIAS_ENA | WM8962_VMID_SEL_MASK,
			   WM8962_BIAS_ENA | 0x180);

	msleep(5);

	वापस 0;

disable_घड़ी:
	clk_disable_unprepare(wm8962->pdata.mclk);
	वापस ret;
पूर्ण

अटल पूर्णांक wm8962_runसमय_suspend(काष्ठा device *dev)
अणु
	काष्ठा wm8962_priv *wm8962 = dev_get_drvdata(dev);

	regmap_update_bits(wm8962->regmap, WM8962_PWR_MGMT_1,
			   WM8962_VMID_SEL_MASK | WM8962_BIAS_ENA, 0);

	regmap_update_bits(wm8962->regmap, WM8962_ANTI_POP,
			   WM8962_STARTUP_BIAS_ENA |
			   WM8962_VMID_BUF_ENA, 0);

	regcache_cache_only(wm8962->regmap, true);

	regulator_bulk_disable(ARRAY_SIZE(wm8962->supplies),
			       wm8962->supplies);

	clk_disable_unprepare(wm8962->pdata.mclk);

	वापस 0;
पूर्ण
#पूर्ण_अगर

अटल स्थिर काष्ठा dev_pm_ops wm8962_pm = अणु
	SET_RUNTIME_PM_OPS(wm8962_runसमय_suspend, wm8962_runसमय_resume, शून्य)
पूर्ण;

अटल स्थिर काष्ठा i2c_device_id wm8962_i2c_id[] = अणु
	अणु "wm8962", 0 पूर्ण,
	अणु पूर्ण
पूर्ण;
MODULE_DEVICE_TABLE(i2c, wm8962_i2c_id);

अटल स्थिर काष्ठा of_device_id wm8962_of_match[] = अणु
	अणु .compatible = "wlf,wm8962", पूर्ण,
	अणु पूर्ण
पूर्ण;
MODULE_DEVICE_TABLE(of, wm8962_of_match);

अटल काष्ठा i2c_driver wm8962_i2c_driver = अणु
	.driver = अणु
		.name = "wm8962",
		.of_match_table = wm8962_of_match,
		.pm = &wm8962_pm,
	पूर्ण,
	.probe =    wm8962_i2c_probe,
	.हटाओ =   wm8962_i2c_हटाओ,
	.id_table = wm8962_i2c_id,
पूर्ण;

module_i2c_driver(wm8962_i2c_driver);

MODULE_DESCRIPTION("ASoC WM8962 driver");
MODULE_AUTHOR("Mark Brown <broonie@opensource.wolfsonmicro.com>");
MODULE_LICENSE("GPL");
