<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 WITH Linux-syscall-note */
#अगर_अघोषित _ASM_IA64_PTRACE_OFFSETS_H
#घोषणा _ASM_IA64_PTRACE_OFFSETS_H

/*
 * Copyright (C) 1999, 2003 Hewlett-Packard Co
 *	David Mosberger-Tang <davidm@hpl.hp.com>
 */
/*
 * The "uarea" that can be accessed via PEEKUSER and POKEUSER is a
 * भव काष्ठाure that would have the following definition:
 *
 *	काष्ठा uarea अणु
 *		काष्ठा ia64_fpreg fph[96];		// f32-f127
 *		अचिन्हित दीर्घ nat_bits;
 *		अचिन्हित दीर्घ empty1;
 *		काष्ठा ia64_fpreg f2;			// f2-f5
 *			:
 *		काष्ठा ia64_fpreg f5;
 *		काष्ठा ia64_fpreg f10;			// f10-f31
 *			:
 *		काष्ठा ia64_fpreg f31;
 *		अचिन्हित दीर्घ r4;			// r4-r7
 *			:
 *		अचिन्हित दीर्घ r7;
 *		अचिन्हित दीर्घ b1;			// b1-b5
 *			:
 *		अचिन्हित दीर्घ b5;
 *		अचिन्हित दीर्घ ar_ec;
 *		अचिन्हित दीर्घ ar_lc;
 *		अचिन्हित दीर्घ empty2[5];
 *		अचिन्हित दीर्घ cr_ipsr;
 *		अचिन्हित दीर्घ cr_iip;
 *		अचिन्हित दीर्घ cfm;
 *		अचिन्हित दीर्घ ar_unat;
 *		अचिन्हित दीर्घ ar_pfs;
 *		अचिन्हित दीर्घ ar_rsc;
 *		अचिन्हित दीर्घ ar_rnat;
 *		अचिन्हित दीर्घ ar_bspstore;
 *		अचिन्हित दीर्घ pr;
 *		अचिन्हित दीर्घ b6;
 *		अचिन्हित दीर्घ ar_bsp;
 *		अचिन्हित दीर्घ r1;
 *		अचिन्हित दीर्घ r2;
 *		अचिन्हित दीर्घ r3;
 *		अचिन्हित दीर्घ r12;
 *		अचिन्हित दीर्घ r13;
 *		अचिन्हित दीर्घ r14;
 *		अचिन्हित दीर्घ r15;
 *		अचिन्हित दीर्घ r8;
 *		अचिन्हित दीर्घ r9;
 *		अचिन्हित दीर्घ r10;
 *		अचिन्हित दीर्घ r11;
 *		अचिन्हित दीर्घ r16;
 *			:
 *		अचिन्हित दीर्घ r31;
 *		अचिन्हित दीर्घ ar_ccv;
 *		अचिन्हित दीर्घ ar_fpsr;
 *		अचिन्हित दीर्घ b0;
 *		अचिन्हित दीर्घ b7;
 *		अचिन्हित दीर्घ f6;
 *		अचिन्हित दीर्घ f7;
 *		अचिन्हित दीर्घ f8;
 *		अचिन्हित दीर्घ f9;
 *		अचिन्हित दीर्घ ar_csd;
 *		अचिन्हित दीर्घ ar_ssd;
 *		अचिन्हित दीर्घ rsvd1[710];
 *		अचिन्हित दीर्घ dbr[8];
 *		अचिन्हित दीर्घ rsvd2[504];
 *		अचिन्हित दीर्घ ibr[8];
 *		अचिन्हित दीर्घ rsvd3[504];
 *		अचिन्हित दीर्घ pmd[4];
 *	पूर्ण
 */

/* fph: */
#घोषणा PT_F32			0x0000
#घोषणा PT_F33			0x0010
#घोषणा PT_F34			0x0020
#घोषणा PT_F35			0x0030
#घोषणा PT_F36			0x0040
#घोषणा PT_F37			0x0050
#घोषणा PT_F38			0x0060
#घोषणा PT_F39			0x0070
#घोषणा PT_F40			0x0080
#घोषणा PT_F41			0x0090
#घोषणा PT_F42			0x00a0
#घोषणा PT_F43			0x00b0
#घोषणा PT_F44			0x00c0
#घोषणा PT_F45			0x00d0
#घोषणा PT_F46			0x00e0
#घोषणा PT_F47			0x00f0
#घोषणा PT_F48			0x0100
#घोषणा PT_F49			0x0110
#घोषणा PT_F50			0x0120
#घोषणा PT_F51			0x0130
#घोषणा PT_F52			0x0140
#घोषणा PT_F53			0x0150
#घोषणा PT_F54			0x0160
#घोषणा PT_F55			0x0170
#घोषणा PT_F56			0x0180
#घोषणा PT_F57			0x0190
#घोषणा PT_F58			0x01a0
#घोषणा PT_F59			0x01b0
#घोषणा PT_F60			0x01c0
#घोषणा PT_F61			0x01d0
#घोषणा PT_F62			0x01e0
#घोषणा PT_F63			0x01f0
#घोषणा PT_F64			0x0200
#घोषणा PT_F65			0x0210
#घोषणा PT_F66			0x0220
#घोषणा PT_F67			0x0230
#घोषणा PT_F68			0x0240
#घोषणा PT_F69			0x0250
#घोषणा PT_F70			0x0260
#घोषणा PT_F71			0x0270
#घोषणा PT_F72			0x0280
#घोषणा PT_F73			0x0290
#घोषणा PT_F74			0x02a0
#घोषणा PT_F75			0x02b0
#घोषणा PT_F76			0x02c0
#घोषणा PT_F77			0x02d0
#घोषणा PT_F78			0x02e0
#घोषणा PT_F79			0x02f0
#घोषणा PT_F80			0x0300
#घोषणा PT_F81			0x0310
#घोषणा PT_F82			0x0320
#घोषणा PT_F83			0x0330
#घोषणा PT_F84			0x0340
#घोषणा PT_F85			0x0350
#घोषणा PT_F86			0x0360
#घोषणा PT_F87			0x0370
#घोषणा PT_F88			0x0380
#घोषणा PT_F89			0x0390
#घोषणा PT_F90			0x03a0
#घोषणा PT_F91			0x03b0
#घोषणा PT_F92			0x03c0
#घोषणा PT_F93			0x03d0
#घोषणा PT_F94			0x03e0
#घोषणा PT_F95			0x03f0
#घोषणा PT_F96			0x0400
#घोषणा PT_F97			0x0410
#घोषणा PT_F98			0x0420
#घोषणा PT_F99			0x0430
#घोषणा PT_F100			0x0440
#घोषणा PT_F101			0x0450
#घोषणा PT_F102			0x0460
#घोषणा PT_F103			0x0470
#घोषणा PT_F104			0x0480
#घोषणा PT_F105			0x0490
#घोषणा PT_F106			0x04a0
#घोषणा PT_F107			0x04b0
#घोषणा PT_F108			0x04c0
#घोषणा PT_F109			0x04d0
#घोषणा PT_F110			0x04e0
#घोषणा PT_F111			0x04f0
#घोषणा PT_F112			0x0500
#घोषणा PT_F113			0x0510
#घोषणा PT_F114			0x0520
#घोषणा PT_F115			0x0530
#घोषणा PT_F116			0x0540
#घोषणा PT_F117			0x0550
#घोषणा PT_F118			0x0560
#घोषणा PT_F119			0x0570
#घोषणा PT_F120			0x0580
#घोषणा PT_F121			0x0590
#घोषणा PT_F122			0x05a0
#घोषणा PT_F123			0x05b0
#घोषणा PT_F124			0x05c0
#घोषणा PT_F125			0x05d0
#घोषणा PT_F126			0x05e0
#घोषणा PT_F127			0x05f0

#घोषणा PT_NAT_BITS		0x0600

#घोषणा PT_F2			0x0610
#घोषणा PT_F3			0x0620
#घोषणा PT_F4			0x0630
#घोषणा PT_F5			0x0640
#घोषणा PT_F10			0x0650
#घोषणा PT_F11			0x0660
#घोषणा PT_F12			0x0670
#घोषणा PT_F13			0x0680
#घोषणा PT_F14			0x0690
#घोषणा PT_F15			0x06a0
#घोषणा PT_F16			0x06b0
#घोषणा PT_F17			0x06c0
#घोषणा PT_F18			0x06d0
#घोषणा PT_F19			0x06e0
#घोषणा PT_F20			0x06f0
#घोषणा PT_F21			0x0700
#घोषणा PT_F22			0x0710
#घोषणा PT_F23			0x0720
#घोषणा PT_F24			0x0730
#घोषणा PT_F25			0x0740
#घोषणा PT_F26			0x0750
#घोषणा PT_F27			0x0760
#घोषणा PT_F28			0x0770
#घोषणा PT_F29			0x0780
#घोषणा PT_F30			0x0790
#घोषणा PT_F31			0x07a0
#घोषणा PT_R4			0x07b0
#घोषणा PT_R5			0x07b8
#घोषणा PT_R6			0x07c0
#घोषणा PT_R7			0x07c8

#घोषणा PT_B1			0x07d8
#घोषणा PT_B2			0x07e0
#घोषणा PT_B3			0x07e8
#घोषणा PT_B4			0x07f0
#घोषणा PT_B5			0x07f8

#घोषणा PT_AR_EC		0x0800
#घोषणा PT_AR_LC		0x0808

#घोषणा PT_CR_IPSR		0x0830
#घोषणा PT_CR_IIP		0x0838
#घोषणा PT_CFM			0x0840
#घोषणा PT_AR_UNAT		0x0848
#घोषणा PT_AR_PFS		0x0850
#घोषणा PT_AR_RSC		0x0858
#घोषणा PT_AR_RNAT		0x0860
#घोषणा PT_AR_BSPSTORE		0x0868
#घोषणा PT_PR			0x0870
#घोषणा PT_B6			0x0878
#घोषणा PT_AR_BSP		0x0880	/* note: this poपूर्णांकs to the *end* of the backing store! */
#घोषणा PT_R1			0x0888
#घोषणा PT_R2			0x0890
#घोषणा PT_R3			0x0898
#घोषणा PT_R12			0x08a0
#घोषणा PT_R13			0x08a8
#घोषणा PT_R14			0x08b0
#घोषणा PT_R15			0x08b8
#घोषणा PT_R8 			0x08c0
#घोषणा PT_R9			0x08c8
#घोषणा PT_R10			0x08d0
#घोषणा PT_R11			0x08d8
#घोषणा PT_R16			0x08e0
#घोषणा PT_R17			0x08e8
#घोषणा PT_R18			0x08f0
#घोषणा PT_R19			0x08f8
#घोषणा PT_R20			0x0900
#घोषणा PT_R21			0x0908
#घोषणा PT_R22			0x0910
#घोषणा PT_R23			0x0918
#घोषणा PT_R24			0x0920
#घोषणा PT_R25			0x0928
#घोषणा PT_R26			0x0930
#घोषणा PT_R27			0x0938
#घोषणा PT_R28			0x0940
#घोषणा PT_R29			0x0948
#घोषणा PT_R30			0x0950
#घोषणा PT_R31			0x0958
#घोषणा PT_AR_CCV		0x0960
#घोषणा PT_AR_FPSR		0x0968
#घोषणा PT_B0			0x0970
#घोषणा PT_B7			0x0978
#घोषणा PT_F6			0x0980
#घोषणा PT_F7			0x0990
#घोषणा PT_F8			0x09a0
#घोषणा PT_F9			0x09b0
#घोषणा PT_AR_CSD		0x09c0
#घोषणा PT_AR_SSD		0x09c8

#घोषणा PT_DBR			0x2000	/* data अवरोधpoपूर्णांक रेजिस्टरs */
#घोषणा PT_IBR			0x3000	/* inकाष्ठाion अवरोधpoपूर्णांक रेजिस्टरs */
#घोषणा PT_PMD			0x4000	/* perक्रमmance monitoring counters */

#पूर्ण_अगर /* _ASM_IA64_PTRACE_OFFSETS_H */
