<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0
/******************************************************************************
 *
 * Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
 *
 ******************************************************************************/
#घोषणा _RTW_RF_C_

#समावेश <drv_types.h>
#समावेश <linux/kernel.h>


काष्ठा ch_freq अणु
	u32 channel;
	u32 frequency;
पूर्ण;

अटल काष्ठा ch_freq ch_freq_map[] = अणु
	अणु1, 2412पूर्ण, अणु2, 2417पूर्ण, अणु3, 2422पूर्ण, अणु4, 2427पूर्ण, अणु5, 2432पूर्ण,
	अणु6, 2437पूर्ण, अणु7, 2442पूर्ण, अणु8, 2447पूर्ण, अणु9, 2452पूर्ण, अणु10, 2457पूर्ण,
	अणु11, 2462पूर्ण, अणु12, 2467पूर्ण, अणु13, 2472पूर्ण, अणु14, 2484पूर्ण,
	/*  UNII */
	अणु36, 5180पूर्ण, अणु40, 5200पूर्ण, अणु44, 5220पूर्ण, अणु48, 5240पूर्ण, अणु52, 5260पूर्ण,
	अणु56, 5280पूर्ण, अणु60, 5300पूर्ण, अणु64, 5320पूर्ण, अणु149, 5745पूर्ण, अणु153, 5765पूर्ण,
	अणु157, 5785पूर्ण, अणु161, 5805पूर्ण, अणु165, 5825पूर्ण, अणु167, 5835पूर्ण, अणु169, 5845पूर्ण,
	अणु171, 5855पूर्ण, अणु173, 5865पूर्ण,
	/* HiperLAN2 */
	अणु100, 5500पूर्ण, अणु104, 5520पूर्ण, अणु108, 5540पूर्ण, अणु112, 5560पूर्ण, अणु116, 5580पूर्ण,
	अणु120, 5600पूर्ण, अणु124, 5620पूर्ण, अणु128, 5640पूर्ण, अणु132, 5660पूर्ण, अणु136, 5680पूर्ण,
	अणु140, 5700पूर्ण,
	/* Japan MMAC */
	अणु34, 5170पूर्ण, अणु38, 5190पूर्ण, अणु42, 5210पूर्ण, अणु46, 5230पूर्ण,
	/*  Japan */
	अणु184, 4920पूर्ण, अणु188, 4940पूर्ण, अणु192, 4960पूर्ण, अणु196, 4980पूर्ण,
	अणु208, 5040पूर्ण,/* Japan, means J08 */
	अणु212, 5060पूर्ण,/* Japan, means J12 */
	अणु216, 5080पूर्ण,/* Japan, means J16 */
पूर्ण;

u32 rtw_ch2freq(u32 channel)
अणु
	u8 i;
	u32 freq = 0;

	क्रम (i = 0; i < ARRAY_SIZE(ch_freq_map); i++) अणु
		अगर (channel == ch_freq_map[i].channel) अणु
			freq = ch_freq_map[i].frequency;
				अवरोध;
		पूर्ण
	पूर्ण
	अगर (i == ARRAY_SIZE(ch_freq_map))
		freq = 2412;

	वापस freq;
पूर्ण
