<शैली गुरु>
/*-*- linux-c -*-
 *  linux/drivers/video/i810_मुख्य.h -- Intel 810 Non-discrete Video Timings 
 *                                     (VESA GTF)
 *
 *      Copyright (C) 2001 Antonino Daplas<adaplas@pol.net>
 *      All Rights Reserved      
 *
 *
 *  This file is subject to the terms and conditions of the GNU General Public
 *  License. See the file COPYING in the मुख्य directory of this archive क्रम
 *  more details.
 */
#समावेश <linux/kernel.h>

#समावेश "i810_regs.h"
#समावेश "i810.h"
#समावेश "i810_main.h"

/*
 * FIFO and Watermark tables - based almost wholly on i810_wmark.c in 
 * XFree86 v4.03 by Precision Insight.  Slightly modअगरied क्रम पूर्णांकeger 
 * operation, instead of भग्न
 */

काष्ठा wm_info अणु
   u32 freq;
   u32  wm;
पूर्ण;

अटल काष्ठा wm_info i810_wm_8_100[] = अणु
	अणु 15, 0x0070c000 पूर्ण,  अणु 19, 0x0070c000 पूर्ण,  अणु 25, 0x22003000 पूर्ण,
	अणु 28, 0x22003000 पूर्ण,  अणु 31, 0x22003000 पूर्ण,  अणु 36, 0x22007000 पूर्ण,
	अणु 40, 0x22007000 पूर्ण,  अणु 45, 0x22007000 पूर्ण,  अणु 49, 0x22008000 पूर्ण,
	अणु 50, 0x22008000 पूर्ण,  अणु 56, 0x22008000 पूर्ण,  अणु 65, 0x22008000 पूर्ण,
	अणु 75, 0x22008000 पूर्ण,  अणु 78, 0x22008000 पूर्ण,  अणु 80, 0x22008000 पूर्ण,
	अणु 94, 0x22008000 पूर्ण,  अणु 96, 0x22107000 पूर्ण,  अणु 99, 0x22107000 पूर्ण,
	अणु 108, 0x22107000 पूर्ण, अणु 121, 0x22107000 पूर्ण, अणु 128, 0x22107000 पूर्ण,
	अणु 132, 0x22109000 पूर्ण, अणु 135, 0x22109000 पूर्ण, अणु 157, 0x2210b000 पूर्ण,
	अणु 162, 0x2210b000 पूर्ण, अणु 175, 0x2210b000 पूर्ण, अणु 189, 0x2220e000 पूर्ण,
	अणु 195, 0x2220e000 पूर्ण, अणु 202, 0x2220e000 पूर्ण, अणु 204, 0x2220e000 पूर्ण,
	अणु 218, 0x2220f000 पूर्ण, अणु 229, 0x22210000 पूर्ण, अणु 234, 0x22210000 पूर्ण, 
पूर्ण;

अटल काष्ठा wm_info i810_wm_16_100[] = अणु
	अणु 15, 0x0070c000 पूर्ण,  अणु 19, 0x0020c000 पूर्ण,  अणु 25, 0x22006000 पूर्ण,
	अणु 28, 0x22006000 पूर्ण,  अणु 31, 0x22007000 पूर्ण,  अणु 36, 0x22007000 पूर्ण,
	अणु 40, 0x22007000 पूर्ण,  अणु 45, 0x22007000 पूर्ण,  अणु 49, 0x22009000 पूर्ण,
	अणु 50, 0x22009000 पूर्ण,  अणु 56, 0x22108000 पूर्ण,  अणु 65, 0x2210e000 पूर्ण,
	अणु 75, 0x2210e000 पूर्ण,  अणु 78, 0x2210e000 पूर्ण,  अणु 80, 0x22210000 पूर्ण,
	अणु 94, 0x22210000 पूर्ण,  अणु 96, 0x22210000 पूर्ण,  अणु 99, 0x22210000 पूर्ण,
	अणु 108, 0x22210000 पूर्ण, अणु 121, 0x22210000 पूर्ण, अणु 128, 0x22210000 पूर्ण,
	अणु 132, 0x22314000 पूर्ण, अणु 135, 0x22314000 पूर्ण, अणु 157, 0x22415000 पूर्ण,
	अणु 162, 0x22416000 पूर्ण, अणु 175, 0x22416000 पूर्ण, अणु 189, 0x22416000 पूर्ण,
	अणु 195, 0x22416000 पूर्ण, अणु 202, 0x22416000 पूर्ण, अणु 204, 0x22416000 पूर्ण,
	अणु 218, 0x22416000 पूर्ण, अणु 229, 0x22416000 पूर्ण,
पूर्ण;

अटल काष्ठा wm_info i810_wm_24_100[] = अणु
	अणु 15, 0x0020c000 पूर्ण,  अणु 19, 0x0040c000 पूर्ण,  अणु 25, 0x22009000 पूर्ण,
	अणु 28, 0x22009000 पूर्ण,  अणु 31, 0x2200a000 पूर्ण,  अणु 36, 0x2210c000 पूर्ण,
	अणु 40, 0x2210c000 पूर्ण,  अणु 45, 0x2210c000 पूर्ण,  अणु 49, 0x22111000 पूर्ण,
	अणु 50, 0x22111000 पूर्ण,  अणु 56, 0x22111000 पूर्ण,  अणु 65, 0x22214000 पूर्ण,
	अणु 75, 0x22214000 पूर्ण,  अणु 78, 0x22215000 पूर्ण,  अणु 80, 0x22216000 पूर्ण,
	अणु 94, 0x22218000 पूर्ण,  अणु 96, 0x22418000 पूर्ण,  अणु 99, 0x22418000 पूर्ण,
	अणु 108, 0x22418000 पूर्ण, अणु 121, 0x22418000 पूर्ण, अणु 128, 0x22419000 पूर्ण,
	अणु 132, 0x22519000 पूर्ण, अणु 135, 0x4441d000 पूर्ण, अणु 157, 0x44419000 पूर्ण,
	अणु 162, 0x44419000 पूर्ण, अणु 175, 0x44419000 पूर्ण, अणु 189, 0x44419000 पूर्ण,
	अणु 195, 0x44419000 पूर्ण, अणु 202, 0x44419000 पूर्ण, अणु 204, 0x44419000 पूर्ण,
पूर्ण;

अटल काष्ठा wm_info i810_wm_8_133[] = अणु
	अणु 15, 0x0070c000 पूर्ण,  अणु 19, 0x0070c000 पूर्ण,  अणु 25, 0x22003000 पूर्ण,
	अणु 28, 0x22003000 पूर्ण,  अणु 31, 0x22003000 पूर्ण,  अणु 36, 0x22007000 पूर्ण,
	अणु 40, 0x22007000 पूर्ण,  अणु 45, 0x22007000 पूर्ण,  अणु 49, 0x22008000 पूर्ण,
	अणु 50, 0x22008000 पूर्ण,  अणु 56, 0x22008000 पूर्ण,  अणु 65, 0x22008000 पूर्ण,
	अणु 75, 0x22008000 पूर्ण,  अणु 78, 0x22008000 पूर्ण,  अणु 80, 0x22008000 पूर्ण,
	अणु 94, 0x22008000 पूर्ण,  अणु 96, 0x22107000 पूर्ण,  अणु 99, 0x22107000 पूर्ण,
	अणु 108, 0x22107000 पूर्ण, अणु 121, 0x22107000 पूर्ण, अणु 128, 0x22107000 पूर्ण,
	अणु 132, 0x22109000 पूर्ण, अणु 135, 0x22109000 पूर्ण, अणु 157, 0x2210b000 पूर्ण,
	अणु 162, 0x2210b000 पूर्ण, अणु 175, 0x2210b000 पूर्ण, अणु 189, 0x2220e000 पूर्ण,
	अणु 195, 0x2220e000 पूर्ण, अणु 202, 0x2220e000 पूर्ण, अणु 204, 0x2220e000 पूर्ण,
	अणु 218, 0x2220f000 पूर्ण, अणु 229, 0x22210000 पूर्ण, अणु 234, 0x22210000 पूर्ण, 
पूर्ण;

अटल काष्ठा wm_info i810_wm_16_133[] = अणु
	अणु 15, 0x0020c000 पूर्ण,  अणु 19, 0x0020c000 पूर्ण,  अणु 25, 0x22006000 पूर्ण,
	अणु 28, 0x22006000 पूर्ण,  अणु 31, 0x22007000 पूर्ण,  अणु 36, 0x22007000 पूर्ण,
	अणु 40, 0x22007000 पूर्ण,  अणु 45, 0x22007000 पूर्ण,  अणु 49, 0x22009000 पूर्ण,
	अणु 50, 0x22009000 पूर्ण,  अणु 56, 0x22108000 पूर्ण,  अणु 65, 0x2210e000 पूर्ण,
	अणु 75, 0x2210e000 पूर्ण,  अणु 78, 0x2210e000 पूर्ण,  अणु 80, 0x22210000 पूर्ण,
	अणु 94, 0x22210000 पूर्ण,  अणु 96, 0x22210000 पूर्ण,  अणु 99, 0x22210000 पूर्ण,
	अणु 108, 0x22210000 पूर्ण, अणु 121, 0x22210000 पूर्ण, अणु 128, 0x22210000 पूर्ण,
	अणु 132, 0x22314000 पूर्ण, अणु 135, 0x22314000 पूर्ण, अणु 157, 0x22415000 पूर्ण,
	अणु 162, 0x22416000 पूर्ण, अणु 175, 0x22416000 पूर्ण, अणु 189, 0x22416000 पूर्ण,
	अणु 195, 0x22416000 पूर्ण, अणु 202, 0x22416000 पूर्ण, अणु 204, 0x22416000 पूर्ण,
	अणु 218, 0x22416000 पूर्ण, अणु 229, 0x22416000 पूर्ण,
पूर्ण;

अटल काष्ठा wm_info i810_wm_24_133[] = अणु
	अणु 15, 0x0020c000 पूर्ण,  अणु 19, 0x00408000 पूर्ण,  अणु 25, 0x22009000 पूर्ण,
	अणु 28, 0x22009000 पूर्ण,  अणु 31, 0x2200a000 पूर्ण,  अणु 36, 0x2210c000 पूर्ण,
	अणु 40, 0x2210c000 पूर्ण,  अणु 45, 0x2210c000 पूर्ण,  अणु 49, 0x22111000 पूर्ण,
	अणु 50, 0x22111000 पूर्ण,  अणु 56, 0x22111000 पूर्ण,  अणु 65, 0x22214000 पूर्ण,
	अणु 75, 0x22214000 पूर्ण,  अणु 78, 0x22215000 पूर्ण,  अणु 80, 0x22216000 पूर्ण,
	अणु 94, 0x22218000 पूर्ण,  अणु 96, 0x22418000 पूर्ण,  अणु 99, 0x22418000 पूर्ण,
	अणु 108, 0x22418000 पूर्ण, अणु 121, 0x22418000 पूर्ण, अणु 128, 0x22419000 पूर्ण,
	अणु 132, 0x22519000 पूर्ण, अणु 135, 0x4441d000 पूर्ण, अणु 157, 0x44419000 पूर्ण,
	अणु 162, 0x44419000 पूर्ण, अणु 175, 0x44419000 पूर्ण, अणु 189, 0x44419000 पूर्ण,
	अणु 195, 0x44419000 पूर्ण, अणु 202, 0x44419000 पूर्ण, अणु 204, 0x44419000 पूर्ण,
पूर्ण;

व्योम round_off_xres(u32 *xres) अणु पूर्ण
व्योम round_off_yres(u32 *xres, u32 *yres) अणु पूर्ण

/**
 * i810fb_encode_रेजिस्टरs - encode @var to hardware रेजिस्टर values
 * @var: poपूर्णांकer to var काष्ठाure
 * @par: poपूर्णांकer to hardware par काष्ठाure
 * 
 * DESCRIPTION: 
 * Timing values in @var will be converted to appropriate
 * रेजिस्टर values of @par.  
 */
व्योम i810fb_encode_रेजिस्टरs(स्थिर काष्ठा fb_var_screeninfo *var,
			     काष्ठा i810fb_par *par, u32 xres, u32 yres)
अणु
	पूर्णांक n, blank_s, blank_e;
	u8 __iomem *mmio = par->mmio_start_भव;
	u8 msr = 0;

	/* Horizontal */
	/* htotal */
	n = ((xres + var->right_margin + var->hsync_len + 
	      var->left_margin) >> 3) - 5;
	par->regs.cr00 =  (u8) n;
	par->regs.cr35 = (u8) ((n >> 8) & 1);
	
	/* xres */
	par->regs.cr01 = (u8) ((xres >> 3) - 1);

	/* hblank */
	blank_e = (xres + var->right_margin + var->hsync_len + 
		   var->left_margin) >> 3;
	blank_e--;
	blank_s = blank_e - 127;
	अगर (blank_s < (xres >> 3))
		blank_s = xres >> 3;
	par->regs.cr02 = (u8) blank_s;
	par->regs.cr03 = (u8) (blank_e & 0x1F);
	par->regs.cr05 = (u8) ((blank_e & (1 << 5)) << 2);
	par->regs.cr39 = (u8) ((blank_e >> 6) & 1);

	/* hsync */
	par->regs.cr04 = (u8) ((xres + var->right_margin) >> 3);
	par->regs.cr05 |= (u8) (((xres + var->right_margin + 
				  var->hsync_len) >> 3) & 0x1F);
	
       	/* Vertical */
	/* vtotal */
	n = yres + var->lower_margin + var->vsync_len + var->upper_margin - 2;
	par->regs.cr06 = (u8) (n & 0xFF);
	par->regs.cr30 = (u8) ((n >> 8) & 0x0F);

	/* vsync */ 
	n = yres + var->lower_margin;
	par->regs.cr10 = (u8) (n & 0xFF);
	par->regs.cr32 = (u8) ((n >> 8) & 0x0F);
	par->regs.cr11 = i810_पढ़ोb(CR11, mmio) & ~0x0F;
	par->regs.cr11 |= (u8) ((yres + var->lower_margin + 
				 var->vsync_len) & 0x0F);

	/* yres */
	n = yres - 1;
	par->regs.cr12 = (u8) (n & 0xFF);
	par->regs.cr31 = (u8) ((n >> 8) & 0x0F);
	
	/* vblank */
	blank_e = yres + var->lower_margin + var->vsync_len + 
		var->upper_margin;
	blank_e--;
	blank_s = blank_e - 127;
	अगर (blank_s < yres)
		blank_s = yres;
	par->regs.cr15 = (u8) (blank_s & 0xFF);
	par->regs.cr33 = (u8) ((blank_s >> 8) & 0x0F);
	par->regs.cr16 = (u8) (blank_e & 0xFF);
	par->regs.cr09 = 0;	

	/* sync polarity */
	अगर (!(var->sync & FB_SYNC_HOR_HIGH_ACT))
		msr |= 1 << 6;
	अगर (!(var->sync & FB_SYNC_VERT_HIGH_ACT))
		msr |= 1 << 7;
	par->regs.msr = msr;

	/* पूर्णांकerlace */
	अगर (var->vmode & FB_VMODE_INTERLACED) 
		par->पूर्णांकerlace = (1 << 7) | ((u8) (var->yres >> 4));
	अन्यथा 
		par->पूर्णांकerlace = 0;

	अगर (var->vmode & FB_VMODE_DOUBLE)
		par->regs.cr09 |= 1 << 7;

	/* overlay */
	par->ovract = ((var->xres + var->right_margin + var->hsync_len + 
			var->left_margin - 32) | ((var->xres - 32) << 16));
पूर्ण	

व्योम i810fb_fill_var_timings(काष्ठा fb_var_screeninfo *var) अणु पूर्ण

/**
 * i810_get_watermark - माला_लो watermark
 * @var: poपूर्णांकer to fb_var_screeninfo
 * @par: poपूर्णांकer to i810fb_par काष्ठाure
 *
 * DESCRIPTION:
 * Gets the required watermark based on 
 * pixelघड़ी and RAMBUS frequency.
 * 
 * RETURNS:
 * watermark
 */
u32 i810_get_watermark(स्थिर काष्ठा fb_var_screeninfo *var,
		       काष्ठा i810fb_par *par)
अणु
	काष्ठा wm_info *wmark = शून्य;
	u32 i, size = 0, pixघड़ी, wm_best = 0, min, dअगरf;

	अगर (par->mem_freq == 100) अणु
		चयन (var->bits_per_pixel) अणु 
		हाल 8:
			wmark = i810_wm_8_100;
			size = ARRAY_SIZE(i810_wm_8_100);
			अवरोध;
		हाल 16:
			wmark = i810_wm_16_100;
			size = ARRAY_SIZE(i810_wm_16_100);
			अवरोध;
		हाल 24:
		हाल 32:
			wmark = i810_wm_24_100;
			size = ARRAY_SIZE(i810_wm_24_100);
		पूर्ण
	पूर्ण अन्यथा अणु
		चयन(var->bits_per_pixel) अणु
		हाल 8:
			wmark = i810_wm_8_133;
			size = ARRAY_SIZE(i810_wm_8_133);
			अवरोध;
		हाल 16:
			wmark = i810_wm_16_133;
			size = ARRAY_SIZE(i810_wm_16_133);
			अवरोध;
		हाल 24:
		हाल 32:
			wmark = i810_wm_24_133;
			size = ARRAY_SIZE(i810_wm_24_133);
		पूर्ण
	पूर्ण

	pixघड़ी = 1000000/var->pixघड़ी;
	min = ~0;
	क्रम (i = 0; i < size; i++) अणु
		अगर (pixघड़ी <= wmark[i].freq) 
			dअगरf = wmark[i].freq - pixघड़ी;
		अन्यथा 
			dअगरf = pixघड़ी - wmark[i].freq;
		अगर (dअगरf < min) अणु
			wm_best = wmark[i].wm;
			min = dअगरf;
		पूर्ण
	पूर्ण
	वापस wm_best;		
पूर्ण	

