<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-or-later */
/*
 * Elonics E4000 silicon tuner driver
 *
 * Copyright (C) 2012 Antti Palosaari <crope@iki.fi>
 */

#अगर_अघोषित E4000_PRIV_H
#घोषणा E4000_PRIV_H

#समावेश "e4000.h"
#समावेश <linux/math64.h>
#समावेश <media/v4l2-ctrls.h>
#समावेश <media/v4l2-subdev.h>
#समावेश <linux/regmap.h>

काष्ठा e4000_dev अणु
	काष्ठा i2c_client *client;
	काष्ठा regmap *regmap;
	u32 clk;
	काष्ठा dvb_frontend *fe;
	काष्ठा v4l2_subdev sd;
	bool active;
	अचिन्हित पूर्णांक f_frequency;
	अचिन्हित पूर्णांक f_bandwidth;

	/* Controls */
	काष्ठा v4l2_ctrl_handler hdl;
	काष्ठा v4l2_ctrl *bandwidth_स्वतः;
	काष्ठा v4l2_ctrl *bandwidth;
	काष्ठा v4l2_ctrl *lna_gain_स्वतः;
	काष्ठा v4l2_ctrl *lna_gain;
	काष्ठा v4l2_ctrl *mixer_gain_स्वतः;
	काष्ठा v4l2_ctrl *mixer_gain;
	काष्ठा v4l2_ctrl *अगर_gain_स्वतः;
	काष्ठा v4l2_ctrl *अगर_gain;
	काष्ठा v4l2_ctrl *pll_lock;
पूर्ण;

काष्ठा e4000_pll अणु
	u32 freq;
	u8 भाग_out_reg;
	u8 भाग_out;
पूर्ण;

अटल स्थिर काष्ठा e4000_pll e4000_pll_lut[] = अणु
/*                                      VCO min    VCO max */
	अणु   72400000, 0x0f, 48 पूर्ण, /* .......... 3475200000 */
	अणु   81200000, 0x0e, 40 पूर्ण, /* 2896000000 3248000000 */
	अणु  108300000, 0x0d, 32 पूर्ण, /* 2598400000 3465600000 */
	अणु  162500000, 0x0c, 24 पूर्ण, /* 2599200000 3900000000 */
	अणु  216600000, 0x0b, 16 पूर्ण, /* 2600000000 3465600000 */
	अणु  325000000, 0x0a, 12 पूर्ण, /* 2599200000 3900000000 */
	अणु  350000000, 0x09,  8 पूर्ण, /* 2600000000 2800000000 */
	अणु  432000000, 0x03,  8 पूर्ण, /* 2800000000 3456000000 */
	अणु  667000000, 0x02,  6 पूर्ण, /* 2592000000 4002000000 */
	अणु 1200000000, 0x01,  4 पूर्ण, /* 2668000000 4800000000 */
	अणु 0xffffffff, 0x00,  2 पूर्ण, /* 2400000000 .......... */
पूर्ण;

काष्ठा e4000_lna_filter अणु
	u32 freq;
	u8 val;
पूर्ण;

अटल स्थिर काष्ठा e4000_lna_filter e400_lna_filter_lut[] = अणु
	अणु  370000000,  0 पूर्ण,
	अणु  392500000,  1 पूर्ण,
	अणु  415000000,  2 पूर्ण,
	अणु  437500000,  3 पूर्ण,
	अणु  462500000,  4 पूर्ण,
	अणु  490000000,  5 पूर्ण,
	अणु  522500000,  6 पूर्ण,
	अणु  557500000,  7 पूर्ण,
	अणु  595000000,  8 पूर्ण,
	अणु  642500000,  9 पूर्ण,
	अणु  695000000, 10 पूर्ण,
	अणु  740000000, 11 पूर्ण,
	अणु  800000000, 12 पूर्ण,
	अणु  865000000, 13 पूर्ण,
	अणु  930000000, 14 पूर्ण,
	अणु 1000000000, 15 पूर्ण,
	अणु 1310000000,  0 पूर्ण,
	अणु 1340000000,  1 पूर्ण,
	अणु 1385000000,  2 पूर्ण,
	अणु 1427500000,  3 पूर्ण,
	अणु 1452500000,  4 पूर्ण,
	अणु 1475000000,  5 पूर्ण,
	अणु 1510000000,  6 पूर्ण,
	अणु 1545000000,  7 पूर्ण,
	अणु 1575000000,  8 पूर्ण,
	अणु 1615000000,  9 पूर्ण,
	अणु 1650000000, 10 पूर्ण,
	अणु 1670000000, 11 पूर्ण,
	अणु 1690000000, 12 पूर्ण,
	अणु 1710000000, 13 पूर्ण,
	अणु 1735000000, 14 पूर्ण,
	अणु 0xffffffff, 15 पूर्ण,
पूर्ण;

काष्ठा e4000_band अणु
	u32 freq;
	u8 reg07_val;
	u8 reg78_val;
पूर्ण;

अटल स्थिर काष्ठा e4000_band e4000_band_lut[] = अणु
	अणु  140000000, 0x01, 0x03 पूर्ण,
	अणु  350000000, 0x03, 0x03 पूर्ण,
	अणु 1000000000, 0x05, 0x03 पूर्ण,
	अणु 0xffffffff, 0x07, 0x00 पूर्ण,
पूर्ण;

काष्ठा e4000_अगर_filter अणु
	u32 freq;
	u8 reg11_val;
	u8 reg12_val;
पूर्ण;

अटल स्थिर काष्ठा e4000_अगर_filter e4000_अगर_filter_lut[] = अणु
	अणु    4300000, 0xfd, 0x1f पूर्ण,
	अणु    4400000, 0xfd, 0x1e पूर्ण,
	अणु    4480000, 0xfc, 0x1d पूर्ण,
	अणु    4560000, 0xfc, 0x1c पूर्ण,
	अणु    4600000, 0xfc, 0x1b पूर्ण,
	अणु    4800000, 0xfc, 0x1a पूर्ण,
	अणु    4900000, 0xfc, 0x19 पूर्ण,
	अणु    5000000, 0xfc, 0x18 पूर्ण,
	अणु    5100000, 0xfc, 0x17 पूर्ण,
	अणु    5200000, 0xfc, 0x16 पूर्ण,
	अणु    5400000, 0xfc, 0x15 पूर्ण,
	अणु    5500000, 0xfc, 0x14 पूर्ण,
	अणु    5600000, 0xfc, 0x13 पूर्ण,
	अणु    5800000, 0xfb, 0x12 पूर्ण,
	अणु    5900000, 0xfb, 0x11 पूर्ण,
	अणु    6000000, 0xfb, 0x10 पूर्ण,
	अणु    6200000, 0xfb, 0x0f पूर्ण,
	अणु    6400000, 0xfa, 0x0e पूर्ण,
	अणु    6600000, 0xfa, 0x0d पूर्ण,
	अणु    6800000, 0xf9, 0x0c पूर्ण,
	अणु    7200000, 0xf9, 0x0b पूर्ण,
	अणु    7400000, 0xf9, 0x0a पूर्ण,
	अणु    7600000, 0xf8, 0x09 पूर्ण,
	अणु    7800000, 0xf8, 0x08 पूर्ण,
	अणु    8200000, 0xf8, 0x07 पूर्ण,
	अणु    8600000, 0xf7, 0x06 पूर्ण,
	अणु    8800000, 0xf7, 0x05 पूर्ण,
	अणु    9200000, 0xf7, 0x04 पूर्ण,
	अणु    9600000, 0xf6, 0x03 पूर्ण,
	अणु   10000000, 0xf6, 0x02 पूर्ण,
	अणु   10600000, 0xf5, 0x01 पूर्ण,
	अणु   11000000, 0xf5, 0x00 पूर्ण,
	अणु 0xffffffff, 0x00, 0x20 पूर्ण,
पूर्ण;

काष्ठा e4000_अगर_gain अणु
	u8 reg16_val;
	u8 reg17_val;
पूर्ण;

अटल स्थिर काष्ठा e4000_अगर_gain e4000_अगर_gain_lut[] = अणु
	अणु0x00, 0x00पूर्ण,
	अणु0x20, 0x00पूर्ण,
	अणु0x40, 0x00पूर्ण,
	अणु0x02, 0x00पूर्ण,
	अणु0x22, 0x00पूर्ण,
	अणु0x42, 0x00पूर्ण,
	अणु0x04, 0x00पूर्ण,
	अणु0x24, 0x00पूर्ण,
	अणु0x44, 0x00पूर्ण,
	अणु0x01, 0x00पूर्ण,
	अणु0x21, 0x00पूर्ण,
	अणु0x41, 0x00पूर्ण,
	अणु0x03, 0x00पूर्ण,
	अणु0x23, 0x00पूर्ण,
	अणु0x43, 0x00पूर्ण,
	अणु0x05, 0x00पूर्ण,
	अणु0x25, 0x00पूर्ण,
	अणु0x45, 0x00पूर्ण,
	अणु0x07, 0x00पूर्ण,
	अणु0x27, 0x00पूर्ण,
	अणु0x47, 0x00पूर्ण,
	अणु0x0f, 0x00पूर्ण,
	अणु0x2f, 0x00पूर्ण,
	अणु0x4f, 0x00पूर्ण,
	अणु0x17, 0x00पूर्ण,
	अणु0x37, 0x00पूर्ण,
	अणु0x57, 0x00पूर्ण,
	अणु0x1f, 0x00पूर्ण,
	अणु0x3f, 0x00पूर्ण,
	अणु0x5f, 0x00पूर्ण,
	अणु0x1f, 0x01पूर्ण,
	अणु0x3f, 0x01पूर्ण,
	अणु0x5f, 0x01पूर्ण,
	अणु0x1f, 0x02पूर्ण,
	अणु0x3f, 0x02पूर्ण,
	अणु0x5f, 0x02पूर्ण,
	अणु0x1f, 0x03पूर्ण,
	अणु0x3f, 0x03पूर्ण,
	अणु0x5f, 0x03पूर्ण,
	अणु0x1f, 0x04पूर्ण,
	अणु0x3f, 0x04पूर्ण,
	अणु0x5f, 0x04पूर्ण,
	अणु0x1f, 0x0cपूर्ण,
	अणु0x3f, 0x0cपूर्ण,
	अणु0x5f, 0x0cपूर्ण,
	अणु0x1f, 0x14पूर्ण,
	अणु0x3f, 0x14पूर्ण,
	अणु0x5f, 0x14पूर्ण,
	अणु0x1f, 0x1cपूर्ण,
	अणु0x3f, 0x1cपूर्ण,
	अणु0x5f, 0x1cपूर्ण,
	अणु0x1f, 0x24पूर्ण,
	अणु0x3f, 0x24पूर्ण,
	अणु0x5f, 0x24पूर्ण,
	अणु0x7f, 0x24पूर्ण,
पूर्ण;

#पूर्ण_अगर
