<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0-or-later
/*
    tda18271-maps.c - driver क्रम the Philips / NXP TDA18271 silicon tuner

    Copyright (C) 2007, 2008 Michael Krufky <mkrufky@linuxtv.org>

*/

#समावेश "tda18271-priv.h"

काष्ठा tda18271_pll_map अणु
	u32 lomax;
	u8 pd; /* post भाग */
	u8 d;  /*      भाग */
पूर्ण;

काष्ठा tda18271_map अणु
	u32 rfmax;
	u8  val;
पूर्ण;

/*---------------------------------------------------------------------*/

अटल काष्ठा tda18271_pll_map tda18271c1_मुख्य_pll[] = अणु
	अणु .lomax =  32000, .pd = 0x5f, .d = 0xf0 पूर्ण,
	अणु .lomax =  35000, .pd = 0x5e, .d = 0xe0 पूर्ण,
	अणु .lomax =  37000, .pd = 0x5d, .d = 0xd0 पूर्ण,
	अणु .lomax =  41000, .pd = 0x5c, .d = 0xc0 पूर्ण,
	अणु .lomax =  44000, .pd = 0x5b, .d = 0xb0 पूर्ण,
	अणु .lomax =  49000, .pd = 0x5a, .d = 0xa0 पूर्ण,
	अणु .lomax =  54000, .pd = 0x59, .d = 0x90 पूर्ण,
	अणु .lomax =  61000, .pd = 0x58, .d = 0x80 पूर्ण,
	अणु .lomax =  65000, .pd = 0x4f, .d = 0x78 पूर्ण,
	अणु .lomax =  70000, .pd = 0x4e, .d = 0x70 पूर्ण,
	अणु .lomax =  75000, .pd = 0x4d, .d = 0x68 पूर्ण,
	अणु .lomax =  82000, .pd = 0x4c, .d = 0x60 पूर्ण,
	अणु .lomax =  89000, .pd = 0x4b, .d = 0x58 पूर्ण,
	अणु .lomax =  98000, .pd = 0x4a, .d = 0x50 पूर्ण,
	अणु .lomax = 109000, .pd = 0x49, .d = 0x48 पूर्ण,
	अणु .lomax = 123000, .pd = 0x48, .d = 0x40 पूर्ण,
	अणु .lomax = 131000, .pd = 0x3f, .d = 0x3c पूर्ण,
	अणु .lomax = 141000, .pd = 0x3e, .d = 0x38 पूर्ण,
	अणु .lomax = 151000, .pd = 0x3d, .d = 0x34 पूर्ण,
	अणु .lomax = 164000, .pd = 0x3c, .d = 0x30 पूर्ण,
	अणु .lomax = 179000, .pd = 0x3b, .d = 0x2c पूर्ण,
	अणु .lomax = 197000, .pd = 0x3a, .d = 0x28 पूर्ण,
	अणु .lomax = 219000, .pd = 0x39, .d = 0x24 पूर्ण,
	अणु .lomax = 246000, .pd = 0x38, .d = 0x20 पूर्ण,
	अणु .lomax = 263000, .pd = 0x2f, .d = 0x1e पूर्ण,
	अणु .lomax = 282000, .pd = 0x2e, .d = 0x1c पूर्ण,
	अणु .lomax = 303000, .pd = 0x2d, .d = 0x1a पूर्ण,
	अणु .lomax = 329000, .pd = 0x2c, .d = 0x18 पूर्ण,
	अणु .lomax = 359000, .pd = 0x2b, .d = 0x16 पूर्ण,
	अणु .lomax = 395000, .pd = 0x2a, .d = 0x14 पूर्ण,
	अणु .lomax = 438000, .pd = 0x29, .d = 0x12 पूर्ण,
	अणु .lomax = 493000, .pd = 0x28, .d = 0x10 पूर्ण,
	अणु .lomax = 526000, .pd = 0x1f, .d = 0x0f पूर्ण,
	अणु .lomax = 564000, .pd = 0x1e, .d = 0x0e पूर्ण,
	अणु .lomax = 607000, .pd = 0x1d, .d = 0x0d पूर्ण,
	अणु .lomax = 658000, .pd = 0x1c, .d = 0x0c पूर्ण,
	अणु .lomax = 718000, .pd = 0x1b, .d = 0x0b पूर्ण,
	अणु .lomax = 790000, .pd = 0x1a, .d = 0x0a पूर्ण,
	अणु .lomax = 877000, .pd = 0x19, .d = 0x09 पूर्ण,
	अणु .lomax = 987000, .pd = 0x18, .d = 0x08 पूर्ण,
	अणु .lomax =      0, .pd = 0x00, .d = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_pll_map tda18271c2_मुख्य_pll[] = अणु
	अणु .lomax =  33125, .pd = 0x57, .d = 0xf0 पूर्ण,
	अणु .lomax =  35500, .pd = 0x56, .d = 0xe0 पूर्ण,
	अणु .lomax =  38188, .pd = 0x55, .d = 0xd0 पूर्ण,
	अणु .lomax =  41375, .pd = 0x54, .d = 0xc0 पूर्ण,
	अणु .lomax =  45125, .pd = 0x53, .d = 0xb0 पूर्ण,
	अणु .lomax =  49688, .pd = 0x52, .d = 0xa0 पूर्ण,
	अणु .lomax =  55188, .pd = 0x51, .d = 0x90 पूर्ण,
	अणु .lomax =  62125, .pd = 0x50, .d = 0x80 पूर्ण,
	अणु .lomax =  66250, .pd = 0x47, .d = 0x78 पूर्ण,
	अणु .lomax =  71000, .pd = 0x46, .d = 0x70 पूर्ण,
	अणु .lomax =  76375, .pd = 0x45, .d = 0x68 पूर्ण,
	अणु .lomax =  82750, .pd = 0x44, .d = 0x60 पूर्ण,
	अणु .lomax =  90250, .pd = 0x43, .d = 0x58 पूर्ण,
	अणु .lomax =  99375, .pd = 0x42, .d = 0x50 पूर्ण,
	अणु .lomax = 110375, .pd = 0x41, .d = 0x48 पूर्ण,
	अणु .lomax = 124250, .pd = 0x40, .d = 0x40 पूर्ण,
	अणु .lomax = 132500, .pd = 0x37, .d = 0x3c पूर्ण,
	अणु .lomax = 142000, .pd = 0x36, .d = 0x38 पूर्ण,
	अणु .lomax = 152750, .pd = 0x35, .d = 0x34 पूर्ण,
	अणु .lomax = 165500, .pd = 0x34, .d = 0x30 पूर्ण,
	अणु .lomax = 180500, .pd = 0x33, .d = 0x2c पूर्ण,
	अणु .lomax = 198750, .pd = 0x32, .d = 0x28 पूर्ण,
	अणु .lomax = 220750, .pd = 0x31, .d = 0x24 पूर्ण,
	अणु .lomax = 248500, .pd = 0x30, .d = 0x20 पूर्ण,
	अणु .lomax = 265000, .pd = 0x27, .d = 0x1e पूर्ण,
	अणु .lomax = 284000, .pd = 0x26, .d = 0x1c पूर्ण,
	अणु .lomax = 305500, .pd = 0x25, .d = 0x1a पूर्ण,
	अणु .lomax = 331000, .pd = 0x24, .d = 0x18 पूर्ण,
	अणु .lomax = 361000, .pd = 0x23, .d = 0x16 पूर्ण,
	अणु .lomax = 397500, .pd = 0x22, .d = 0x14 पूर्ण,
	अणु .lomax = 441500, .pd = 0x21, .d = 0x12 पूर्ण,
	अणु .lomax = 497000, .pd = 0x20, .d = 0x10 पूर्ण,
	अणु .lomax = 530000, .pd = 0x17, .d = 0x0f पूर्ण,
	अणु .lomax = 568000, .pd = 0x16, .d = 0x0e पूर्ण,
	अणु .lomax = 611000, .pd = 0x15, .d = 0x0d पूर्ण,
	अणु .lomax = 662000, .pd = 0x14, .d = 0x0c पूर्ण,
	अणु .lomax = 722000, .pd = 0x13, .d = 0x0b पूर्ण,
	अणु .lomax = 795000, .pd = 0x12, .d = 0x0a पूर्ण,
	अणु .lomax = 883000, .pd = 0x11, .d = 0x09 पूर्ण,
	अणु .lomax = 994000, .pd = 0x10, .d = 0x08 पूर्ण,
	अणु .lomax =      0, .pd = 0x00, .d = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_pll_map tda18271c1_cal_pll[] = अणु
	अणु .lomax =   33000, .pd = 0xdd, .d = 0xd0 पूर्ण,
	अणु .lomax =   36000, .pd = 0xdc, .d = 0xc0 पूर्ण,
	अणु .lomax =   40000, .pd = 0xdb, .d = 0xb0 पूर्ण,
	अणु .lomax =   44000, .pd = 0xda, .d = 0xa0 पूर्ण,
	अणु .lomax =   49000, .pd = 0xd9, .d = 0x90 पूर्ण,
	अणु .lomax =   55000, .pd = 0xd8, .d = 0x80 पूर्ण,
	अणु .lomax =   63000, .pd = 0xd3, .d = 0x70 पूर्ण,
	अणु .lomax =   67000, .pd = 0xcd, .d = 0x68 पूर्ण,
	अणु .lomax =   73000, .pd = 0xcc, .d = 0x60 पूर्ण,
	अणु .lomax =   80000, .pd = 0xcb, .d = 0x58 पूर्ण,
	अणु .lomax =   88000, .pd = 0xca, .d = 0x50 पूर्ण,
	अणु .lomax =   98000, .pd = 0xc9, .d = 0x48 पूर्ण,
	अणु .lomax =  110000, .pd = 0xc8, .d = 0x40 पूर्ण,
	अणु .lomax =  126000, .pd = 0xc3, .d = 0x38 पूर्ण,
	अणु .lomax =  135000, .pd = 0xbd, .d = 0x34 पूर्ण,
	अणु .lomax =  147000, .pd = 0xbc, .d = 0x30 पूर्ण,
	अणु .lomax =  160000, .pd = 0xbb, .d = 0x2c पूर्ण,
	अणु .lomax =  176000, .pd = 0xba, .d = 0x28 पूर्ण,
	अणु .lomax =  196000, .pd = 0xb9, .d = 0x24 पूर्ण,
	अणु .lomax =  220000, .pd = 0xb8, .d = 0x20 पूर्ण,
	अणु .lomax =  252000, .pd = 0xb3, .d = 0x1c पूर्ण,
	अणु .lomax =  271000, .pd = 0xad, .d = 0x1a पूर्ण,
	अणु .lomax =  294000, .pd = 0xac, .d = 0x18 पूर्ण,
	अणु .lomax =  321000, .pd = 0xab, .d = 0x16 पूर्ण,
	अणु .lomax =  353000, .pd = 0xaa, .d = 0x14 पूर्ण,
	अणु .lomax =  392000, .pd = 0xa9, .d = 0x12 पूर्ण,
	अणु .lomax =  441000, .pd = 0xa8, .d = 0x10 पूर्ण,
	अणु .lomax =  505000, .pd = 0xa3, .d = 0x0e पूर्ण,
	अणु .lomax =  543000, .pd = 0x9d, .d = 0x0d पूर्ण,
	अणु .lomax =  589000, .pd = 0x9c, .d = 0x0c पूर्ण,
	अणु .lomax =  642000, .pd = 0x9b, .d = 0x0b पूर्ण,
	अणु .lomax =  707000, .pd = 0x9a, .d = 0x0a पूर्ण,
	अणु .lomax =  785000, .pd = 0x99, .d = 0x09 पूर्ण,
	अणु .lomax =  883000, .pd = 0x98, .d = 0x08 पूर्ण,
	अणु .lomax = 1010000, .pd = 0x93, .d = 0x07 पूर्ण,
	अणु .lomax =       0, .pd = 0x00, .d = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_pll_map tda18271c2_cal_pll[] = अणु
	अणु .lomax =   33813, .pd = 0xdd, .d = 0xd0 पूर्ण,
	अणु .lomax =   36625, .pd = 0xdc, .d = 0xc0 पूर्ण,
	अणु .lomax =   39938, .pd = 0xdb, .d = 0xb0 पूर्ण,
	अणु .lomax =   43938, .pd = 0xda, .d = 0xa0 पूर्ण,
	अणु .lomax =   48813, .pd = 0xd9, .d = 0x90 पूर्ण,
	अणु .lomax =   54938, .pd = 0xd8, .d = 0x80 पूर्ण,
	अणु .lomax =   62813, .pd = 0xd3, .d = 0x70 पूर्ण,
	अणु .lomax =   67625, .pd = 0xcd, .d = 0x68 पूर्ण,
	अणु .lomax =   73250, .pd = 0xcc, .d = 0x60 पूर्ण,
	अणु .lomax =   79875, .pd = 0xcb, .d = 0x58 पूर्ण,
	अणु .lomax =   87875, .pd = 0xca, .d = 0x50 पूर्ण,
	अणु .lomax =   97625, .pd = 0xc9, .d = 0x48 पूर्ण,
	अणु .lomax =  109875, .pd = 0xc8, .d = 0x40 पूर्ण,
	अणु .lomax =  125625, .pd = 0xc3, .d = 0x38 पूर्ण,
	अणु .lomax =  135250, .pd = 0xbd, .d = 0x34 पूर्ण,
	अणु .lomax =  146500, .pd = 0xbc, .d = 0x30 पूर्ण,
	अणु .lomax =  159750, .pd = 0xbb, .d = 0x2c पूर्ण,
	अणु .lomax =  175750, .pd = 0xba, .d = 0x28 पूर्ण,
	अणु .lomax =  195250, .pd = 0xb9, .d = 0x24 पूर्ण,
	अणु .lomax =  219750, .pd = 0xb8, .d = 0x20 पूर्ण,
	अणु .lomax =  251250, .pd = 0xb3, .d = 0x1c पूर्ण,
	अणु .lomax =  270500, .pd = 0xad, .d = 0x1a पूर्ण,
	अणु .lomax =  293000, .pd = 0xac, .d = 0x18 पूर्ण,
	अणु .lomax =  319500, .pd = 0xab, .d = 0x16 पूर्ण,
	अणु .lomax =  351500, .pd = 0xaa, .d = 0x14 पूर्ण,
	अणु .lomax =  390500, .pd = 0xa9, .d = 0x12 पूर्ण,
	अणु .lomax =  439500, .pd = 0xa8, .d = 0x10 पूर्ण,
	अणु .lomax =  502500, .pd = 0xa3, .d = 0x0e पूर्ण,
	अणु .lomax =  541000, .pd = 0x9d, .d = 0x0d पूर्ण,
	अणु .lomax =  586000, .pd = 0x9c, .d = 0x0c पूर्ण,
	अणु .lomax =  639000, .pd = 0x9b, .d = 0x0b पूर्ण,
	अणु .lomax =  703000, .pd = 0x9a, .d = 0x0a पूर्ण,
	अणु .lomax =  781000, .pd = 0x99, .d = 0x09 पूर्ण,
	अणु .lomax =  879000, .pd = 0x98, .d = 0x08 पूर्ण,
	अणु .lomax =       0, .pd = 0x00, .d = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271_bp_filter[] = अणु
	अणु .rfmax =  62000, .val = 0x00 पूर्ण,
	अणु .rfmax =  84000, .val = 0x01 पूर्ण,
	अणु .rfmax = 100000, .val = 0x02 पूर्ण,
	अणु .rfmax = 140000, .val = 0x03 पूर्ण,
	अणु .rfmax = 170000, .val = 0x04 पूर्ण,
	अणु .rfmax = 180000, .val = 0x05 पूर्ण,
	अणु .rfmax = 865000, .val = 0x06 पूर्ण,
	अणु .rfmax =      0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271c1_km[] = अणु
	अणु .rfmax =  61100, .val = 0x74 पूर्ण,
	अणु .rfmax = 350000, .val = 0x40 पूर्ण,
	अणु .rfmax = 720000, .val = 0x30 पूर्ण,
	अणु .rfmax = 865000, .val = 0x40 पूर्ण,
	अणु .rfmax =      0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271c2_km[] = अणु
	अणु .rfmax =  47900, .val = 0x38 पूर्ण,
	अणु .rfmax =  61100, .val = 0x44 पूर्ण,
	अणु .rfmax = 350000, .val = 0x30 पूर्ण,
	अणु .rfmax = 720000, .val = 0x24 पूर्ण,
	अणु .rfmax = 865000, .val = 0x3c पूर्ण,
	अणु .rfmax =      0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271_rf_band[] = अणु
	अणु .rfmax =  47900, .val = 0x00 पूर्ण,
	अणु .rfmax =  61100, .val = 0x01 पूर्ण,
	अणु .rfmax = 152600, .val = 0x02 पूर्ण,
	अणु .rfmax = 164700, .val = 0x03 पूर्ण,
	अणु .rfmax = 203500, .val = 0x04 पूर्ण,
	अणु .rfmax = 457800, .val = 0x05 पूर्ण,
	अणु .rfmax = 865000, .val = 0x06 पूर्ण,
	अणु .rfmax =      0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271_gain_taper[] = अणु
	अणु .rfmax =  45400, .val = 0x1f पूर्ण,
	अणु .rfmax =  45800, .val = 0x1e पूर्ण,
	अणु .rfmax =  46200, .val = 0x1d पूर्ण,
	अणु .rfmax =  46700, .val = 0x1c पूर्ण,
	अणु .rfmax =  47100, .val = 0x1b पूर्ण,
	अणु .rfmax =  47500, .val = 0x1a पूर्ण,
	अणु .rfmax =  47900, .val = 0x19 पूर्ण,
	अणु .rfmax =  49600, .val = 0x17 पूर्ण,
	अणु .rfmax =  51200, .val = 0x16 पूर्ण,
	अणु .rfmax =  52900, .val = 0x15 पूर्ण,
	अणु .rfmax =  54500, .val = 0x14 पूर्ण,
	अणु .rfmax =  56200, .val = 0x13 पूर्ण,
	अणु .rfmax =  57800, .val = 0x12 पूर्ण,
	अणु .rfmax =  59500, .val = 0x11 पूर्ण,
	अणु .rfmax =  61100, .val = 0x10 पूर्ण,
	अणु .rfmax =  67600, .val = 0x0d पूर्ण,
	अणु .rfmax =  74200, .val = 0x0c पूर्ण,
	अणु .rfmax =  80700, .val = 0x0b पूर्ण,
	अणु .rfmax =  87200, .val = 0x0a पूर्ण,
	अणु .rfmax =  93800, .val = 0x09 पूर्ण,
	अणु .rfmax = 100300, .val = 0x08 पूर्ण,
	अणु .rfmax = 106900, .val = 0x07 पूर्ण,
	अणु .rfmax = 113400, .val = 0x06 पूर्ण,
	अणु .rfmax = 119900, .val = 0x05 पूर्ण,
	अणु .rfmax = 126500, .val = 0x04 पूर्ण,
	अणु .rfmax = 133000, .val = 0x03 पूर्ण,
	अणु .rfmax = 139500, .val = 0x02 पूर्ण,
	अणु .rfmax = 146100, .val = 0x01 पूर्ण,
	अणु .rfmax = 152600, .val = 0x00 पूर्ण,
	अणु .rfmax = 154300, .val = 0x1f पूर्ण,
	अणु .rfmax = 156100, .val = 0x1e पूर्ण,
	अणु .rfmax = 157800, .val = 0x1d पूर्ण,
	अणु .rfmax = 159500, .val = 0x1c पूर्ण,
	अणु .rfmax = 161200, .val = 0x1b पूर्ण,
	अणु .rfmax = 163000, .val = 0x1a पूर्ण,
	अणु .rfmax = 164700, .val = 0x19 पूर्ण,
	अणु .rfmax = 170200, .val = 0x17 पूर्ण,
	अणु .rfmax = 175800, .val = 0x16 पूर्ण,
	अणु .rfmax = 181300, .val = 0x15 पूर्ण,
	अणु .rfmax = 186900, .val = 0x14 पूर्ण,
	अणु .rfmax = 192400, .val = 0x13 पूर्ण,
	अणु .rfmax = 198000, .val = 0x12 पूर्ण,
	अणु .rfmax = 203500, .val = 0x11 पूर्ण,
	अणु .rfmax = 216200, .val = 0x14 पूर्ण,
	अणु .rfmax = 228900, .val = 0x13 पूर्ण,
	अणु .rfmax = 241600, .val = 0x12 पूर्ण,
	अणु .rfmax = 254400, .val = 0x11 पूर्ण,
	अणु .rfmax = 267100, .val = 0x10 पूर्ण,
	अणु .rfmax = 279800, .val = 0x0f पूर्ण,
	अणु .rfmax = 292500, .val = 0x0e पूर्ण,
	अणु .rfmax = 305200, .val = 0x0d पूर्ण,
	अणु .rfmax = 317900, .val = 0x0c पूर्ण,
	अणु .rfmax = 330700, .val = 0x0b पूर्ण,
	अणु .rfmax = 343400, .val = 0x0a पूर्ण,
	अणु .rfmax = 356100, .val = 0x09 पूर्ण,
	अणु .rfmax = 368800, .val = 0x08 पूर्ण,
	अणु .rfmax = 381500, .val = 0x07 पूर्ण,
	अणु .rfmax = 394200, .val = 0x06 पूर्ण,
	अणु .rfmax = 406900, .val = 0x05 पूर्ण,
	अणु .rfmax = 419700, .val = 0x04 पूर्ण,
	अणु .rfmax = 432400, .val = 0x03 पूर्ण,
	अणु .rfmax = 445100, .val = 0x02 पूर्ण,
	अणु .rfmax = 457800, .val = 0x01 पूर्ण,
	अणु .rfmax = 476300, .val = 0x19 पूर्ण,
	अणु .rfmax = 494800, .val = 0x18 पूर्ण,
	अणु .rfmax = 513300, .val = 0x17 पूर्ण,
	अणु .rfmax = 531800, .val = 0x16 पूर्ण,
	अणु .rfmax = 550300, .val = 0x15 पूर्ण,
	अणु .rfmax = 568900, .val = 0x14 पूर्ण,
	अणु .rfmax = 587400, .val = 0x13 पूर्ण,
	अणु .rfmax = 605900, .val = 0x12 पूर्ण,
	अणु .rfmax = 624400, .val = 0x11 पूर्ण,
	अणु .rfmax = 642900, .val = 0x10 पूर्ण,
	अणु .rfmax = 661400, .val = 0x0f पूर्ण,
	अणु .rfmax = 679900, .val = 0x0e पूर्ण,
	अणु .rfmax = 698400, .val = 0x0d पूर्ण,
	अणु .rfmax = 716900, .val = 0x0c पूर्ण,
	अणु .rfmax = 735400, .val = 0x0b पूर्ण,
	अणु .rfmax = 753900, .val = 0x0a पूर्ण,
	अणु .rfmax = 772500, .val = 0x09 पूर्ण,
	अणु .rfmax = 791000, .val = 0x08 पूर्ण,
	अणु .rfmax = 809500, .val = 0x07 पूर्ण,
	अणु .rfmax = 828000, .val = 0x06 पूर्ण,
	अणु .rfmax = 846500, .val = 0x05 पूर्ण,
	अणु .rfmax = 865000, .val = 0x04 पूर्ण,
	अणु .rfmax =      0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271c1_rf_cal[] = अणु
	अणु .rfmax = 41000, .val = 0x1e पूर्ण,
	अणु .rfmax = 43000, .val = 0x30 पूर्ण,
	अणु .rfmax = 45000, .val = 0x43 पूर्ण,
	अणु .rfmax = 46000, .val = 0x4d पूर्ण,
	अणु .rfmax = 47000, .val = 0x54 पूर्ण,
	अणु .rfmax = 47900, .val = 0x64 पूर्ण,
	अणु .rfmax = 49100, .val = 0x20 पूर्ण,
	अणु .rfmax = 50000, .val = 0x22 पूर्ण,
	अणु .rfmax = 51000, .val = 0x2a पूर्ण,
	अणु .rfmax = 53000, .val = 0x32 पूर्ण,
	अणु .rfmax = 55000, .val = 0x35 पूर्ण,
	अणु .rfmax = 56000, .val = 0x3c पूर्ण,
	अणु .rfmax = 57000, .val = 0x3f पूर्ण,
	अणु .rfmax = 58000, .val = 0x48 पूर्ण,
	अणु .rfmax = 59000, .val = 0x4d पूर्ण,
	अणु .rfmax = 60000, .val = 0x58 पूर्ण,
	अणु .rfmax = 61100, .val = 0x5f पूर्ण,
	अणु .rfmax =     0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271c2_rf_cal[] = अणु
	अणु .rfmax =  41000, .val = 0x0f पूर्ण,
	अणु .rfmax =  43000, .val = 0x1c पूर्ण,
	अणु .rfmax =  45000, .val = 0x2f पूर्ण,
	अणु .rfmax =  46000, .val = 0x39 पूर्ण,
	अणु .rfmax =  47000, .val = 0x40 पूर्ण,
	अणु .rfmax =  47900, .val = 0x50 पूर्ण,
	अणु .rfmax =  49100, .val = 0x16 पूर्ण,
	अणु .rfmax =  50000, .val = 0x18 पूर्ण,
	अणु .rfmax =  51000, .val = 0x20 पूर्ण,
	अणु .rfmax =  53000, .val = 0x28 पूर्ण,
	अणु .rfmax =  55000, .val = 0x2b पूर्ण,
	अणु .rfmax =  56000, .val = 0x32 पूर्ण,
	अणु .rfmax =  57000, .val = 0x35 पूर्ण,
	अणु .rfmax =  58000, .val = 0x3e पूर्ण,
	अणु .rfmax =  59000, .val = 0x43 पूर्ण,
	अणु .rfmax =  60000, .val = 0x4e पूर्ण,
	अणु .rfmax =  61100, .val = 0x55 पूर्ण,
	अणु .rfmax =  63000, .val = 0x0f पूर्ण,
	अणु .rfmax =  64000, .val = 0x11 पूर्ण,
	अणु .rfmax =  65000, .val = 0x12 पूर्ण,
	अणु .rfmax =  66000, .val = 0x15 पूर्ण,
	अणु .rfmax =  67000, .val = 0x16 पूर्ण,
	अणु .rfmax =  68000, .val = 0x17 पूर्ण,
	अणु .rfmax =  70000, .val = 0x19 पूर्ण,
	अणु .rfmax =  71000, .val = 0x1c पूर्ण,
	अणु .rfmax =  72000, .val = 0x1d पूर्ण,
	अणु .rfmax =  73000, .val = 0x1f पूर्ण,
	अणु .rfmax =  74000, .val = 0x20 पूर्ण,
	अणु .rfmax =  75000, .val = 0x21 पूर्ण,
	अणु .rfmax =  76000, .val = 0x24 पूर्ण,
	अणु .rfmax =  77000, .val = 0x25 पूर्ण,
	अणु .rfmax =  78000, .val = 0x27 पूर्ण,
	अणु .rfmax =  80000, .val = 0x28 पूर्ण,
	अणु .rfmax =  81000, .val = 0x29 पूर्ण,
	अणु .rfmax =  82000, .val = 0x2d पूर्ण,
	अणु .rfmax =  83000, .val = 0x2e पूर्ण,
	अणु .rfmax =  84000, .val = 0x2f पूर्ण,
	अणु .rfmax =  85000, .val = 0x31 पूर्ण,
	अणु .rfmax =  86000, .val = 0x33 पूर्ण,
	अणु .rfmax =  87000, .val = 0x34 पूर्ण,
	अणु .rfmax =  88000, .val = 0x35 पूर्ण,
	अणु .rfmax =  89000, .val = 0x37 पूर्ण,
	अणु .rfmax =  90000, .val = 0x38 पूर्ण,
	अणु .rfmax =  91000, .val = 0x39 पूर्ण,
	अणु .rfmax =  93000, .val = 0x3c पूर्ण,
	अणु .rfmax =  94000, .val = 0x3e पूर्ण,
	अणु .rfmax =  95000, .val = 0x3f पूर्ण,
	अणु .rfmax =  96000, .val = 0x40 पूर्ण,
	अणु .rfmax =  97000, .val = 0x42 पूर्ण,
	अणु .rfmax =  99000, .val = 0x45 पूर्ण,
	अणु .rfmax = 100000, .val = 0x46 पूर्ण,
	अणु .rfmax = 102000, .val = 0x48 पूर्ण,
	अणु .rfmax = 103000, .val = 0x4a पूर्ण,
	अणु .rfmax = 105000, .val = 0x4d पूर्ण,
	अणु .rfmax = 106000, .val = 0x4e पूर्ण,
	अणु .rfmax = 107000, .val = 0x50 पूर्ण,
	अणु .rfmax = 108000, .val = 0x51 पूर्ण,
	अणु .rfmax = 110000, .val = 0x54 पूर्ण,
	अणु .rfmax = 111000, .val = 0x56 पूर्ण,
	अणु .rfmax = 112000, .val = 0x57 पूर्ण,
	अणु .rfmax = 113000, .val = 0x58 पूर्ण,
	अणु .rfmax = 114000, .val = 0x59 पूर्ण,
	अणु .rfmax = 115000, .val = 0x5c पूर्ण,
	अणु .rfmax = 116000, .val = 0x5d पूर्ण,
	अणु .rfmax = 117000, .val = 0x5f पूर्ण,
	अणु .rfmax = 119000, .val = 0x60 पूर्ण,
	अणु .rfmax = 120000, .val = 0x64 पूर्ण,
	अणु .rfmax = 121000, .val = 0x65 पूर्ण,
	अणु .rfmax = 122000, .val = 0x66 पूर्ण,
	अणु .rfmax = 123000, .val = 0x68 पूर्ण,
	अणु .rfmax = 124000, .val = 0x69 पूर्ण,
	अणु .rfmax = 125000, .val = 0x6c पूर्ण,
	अणु .rfmax = 126000, .val = 0x6d पूर्ण,
	अणु .rfmax = 127000, .val = 0x6e पूर्ण,
	अणु .rfmax = 128000, .val = 0x70 पूर्ण,
	अणु .rfmax = 129000, .val = 0x71 पूर्ण,
	अणु .rfmax = 130000, .val = 0x75 पूर्ण,
	अणु .rfmax = 131000, .val = 0x77 पूर्ण,
	अणु .rfmax = 132000, .val = 0x78 पूर्ण,
	अणु .rfmax = 133000, .val = 0x7b पूर्ण,
	अणु .rfmax = 134000, .val = 0x7e पूर्ण,
	अणु .rfmax = 135000, .val = 0x81 पूर्ण,
	अणु .rfmax = 136000, .val = 0x82 पूर्ण,
	अणु .rfmax = 137000, .val = 0x87 पूर्ण,
	अणु .rfmax = 138000, .val = 0x88 पूर्ण,
	अणु .rfmax = 139000, .val = 0x8d पूर्ण,
	अणु .rfmax = 140000, .val = 0x8e पूर्ण,
	अणु .rfmax = 141000, .val = 0x91 पूर्ण,
	अणु .rfmax = 142000, .val = 0x95 पूर्ण,
	अणु .rfmax = 143000, .val = 0x9a पूर्ण,
	अणु .rfmax = 144000, .val = 0x9d पूर्ण,
	अणु .rfmax = 145000, .val = 0xa1 पूर्ण,
	अणु .rfmax = 146000, .val = 0xa2 पूर्ण,
	अणु .rfmax = 147000, .val = 0xa4 पूर्ण,
	अणु .rfmax = 148000, .val = 0xa9 पूर्ण,
	अणु .rfmax = 149000, .val = 0xae पूर्ण,
	अणु .rfmax = 150000, .val = 0xb0 पूर्ण,
	अणु .rfmax = 151000, .val = 0xb1 पूर्ण,
	अणु .rfmax = 152000, .val = 0xb7 पूर्ण,
	अणु .rfmax = 152600, .val = 0xbd पूर्ण,
	अणु .rfmax = 154000, .val = 0x20 पूर्ण,
	अणु .rfmax = 155000, .val = 0x22 पूर्ण,
	अणु .rfmax = 156000, .val = 0x24 पूर्ण,
	अणु .rfmax = 157000, .val = 0x25 पूर्ण,
	अणु .rfmax = 158000, .val = 0x27 पूर्ण,
	अणु .rfmax = 159000, .val = 0x29 पूर्ण,
	अणु .rfmax = 160000, .val = 0x2c पूर्ण,
	अणु .rfmax = 161000, .val = 0x2d पूर्ण,
	अणु .rfmax = 163000, .val = 0x2e पूर्ण,
	अणु .rfmax = 164000, .val = 0x2f पूर्ण,
	अणु .rfmax = 164700, .val = 0x30 पूर्ण,
	अणु .rfmax = 166000, .val = 0x11 पूर्ण,
	अणु .rfmax = 167000, .val = 0x12 पूर्ण,
	अणु .rfmax = 168000, .val = 0x13 पूर्ण,
	अणु .rfmax = 169000, .val = 0x14 पूर्ण,
	अणु .rfmax = 170000, .val = 0x15 पूर्ण,
	अणु .rfmax = 172000, .val = 0x16 पूर्ण,
	अणु .rfmax = 173000, .val = 0x17 पूर्ण,
	अणु .rfmax = 174000, .val = 0x18 पूर्ण,
	अणु .rfmax = 175000, .val = 0x1a पूर्ण,
	अणु .rfmax = 176000, .val = 0x1b पूर्ण,
	अणु .rfmax = 178000, .val = 0x1d पूर्ण,
	अणु .rfmax = 179000, .val = 0x1e पूर्ण,
	अणु .rfmax = 180000, .val = 0x1f पूर्ण,
	अणु .rfmax = 181000, .val = 0x20 पूर्ण,
	अणु .rfmax = 182000, .val = 0x21 पूर्ण,
	अणु .rfmax = 183000, .val = 0x22 पूर्ण,
	अणु .rfmax = 184000, .val = 0x24 पूर्ण,
	अणु .rfmax = 185000, .val = 0x25 पूर्ण,
	अणु .rfmax = 186000, .val = 0x26 पूर्ण,
	अणु .rfmax = 187000, .val = 0x27 पूर्ण,
	अणु .rfmax = 188000, .val = 0x29 पूर्ण,
	अणु .rfmax = 189000, .val = 0x2a पूर्ण,
	अणु .rfmax = 190000, .val = 0x2c पूर्ण,
	अणु .rfmax = 191000, .val = 0x2d पूर्ण,
	अणु .rfmax = 192000, .val = 0x2e पूर्ण,
	अणु .rfmax = 193000, .val = 0x2f पूर्ण,
	अणु .rfmax = 194000, .val = 0x30 पूर्ण,
	अणु .rfmax = 195000, .val = 0x33 पूर्ण,
	अणु .rfmax = 196000, .val = 0x35 पूर्ण,
	अणु .rfmax = 198000, .val = 0x36 पूर्ण,
	अणु .rfmax = 200000, .val = 0x38 पूर्ण,
	अणु .rfmax = 201000, .val = 0x3c पूर्ण,
	अणु .rfmax = 202000, .val = 0x3d पूर्ण,
	अणु .rfmax = 203500, .val = 0x3e पूर्ण,
	अणु .rfmax = 206000, .val = 0x0e पूर्ण,
	अणु .rfmax = 208000, .val = 0x0f पूर्ण,
	अणु .rfmax = 212000, .val = 0x10 पूर्ण,
	अणु .rfmax = 216000, .val = 0x11 पूर्ण,
	अणु .rfmax = 217000, .val = 0x12 पूर्ण,
	अणु .rfmax = 218000, .val = 0x13 पूर्ण,
	अणु .rfmax = 220000, .val = 0x14 पूर्ण,
	अणु .rfmax = 222000, .val = 0x15 पूर्ण,
	अणु .rfmax = 225000, .val = 0x16 पूर्ण,
	अणु .rfmax = 228000, .val = 0x17 पूर्ण,
	अणु .rfmax = 231000, .val = 0x18 पूर्ण,
	अणु .rfmax = 234000, .val = 0x19 पूर्ण,
	अणु .rfmax = 235000, .val = 0x1a पूर्ण,
	अणु .rfmax = 236000, .val = 0x1b पूर्ण,
	अणु .rfmax = 237000, .val = 0x1c पूर्ण,
	अणु .rfmax = 240000, .val = 0x1d पूर्ण,
	अणु .rfmax = 242000, .val = 0x1e पूर्ण,
	अणु .rfmax = 244000, .val = 0x1f पूर्ण,
	अणु .rfmax = 247000, .val = 0x20 पूर्ण,
	अणु .rfmax = 249000, .val = 0x21 पूर्ण,
	अणु .rfmax = 252000, .val = 0x22 पूर्ण,
	अणु .rfmax = 253000, .val = 0x23 पूर्ण,
	अणु .rfmax = 254000, .val = 0x24 पूर्ण,
	अणु .rfmax = 256000, .val = 0x25 पूर्ण,
	अणु .rfmax = 259000, .val = 0x26 पूर्ण,
	अणु .rfmax = 262000, .val = 0x27 पूर्ण,
	अणु .rfmax = 264000, .val = 0x28 पूर्ण,
	अणु .rfmax = 267000, .val = 0x29 पूर्ण,
	अणु .rfmax = 269000, .val = 0x2a पूर्ण,
	अणु .rfmax = 271000, .val = 0x2b पूर्ण,
	अणु .rfmax = 273000, .val = 0x2c पूर्ण,
	अणु .rfmax = 275000, .val = 0x2d पूर्ण,
	अणु .rfmax = 277000, .val = 0x2e पूर्ण,
	अणु .rfmax = 279000, .val = 0x2f पूर्ण,
	अणु .rfmax = 282000, .val = 0x30 पूर्ण,
	अणु .rfmax = 284000, .val = 0x31 पूर्ण,
	अणु .rfmax = 286000, .val = 0x32 पूर्ण,
	अणु .rfmax = 287000, .val = 0x33 पूर्ण,
	अणु .rfmax = 290000, .val = 0x34 पूर्ण,
	अणु .rfmax = 293000, .val = 0x35 पूर्ण,
	अणु .rfmax = 295000, .val = 0x36 पूर्ण,
	अणु .rfmax = 297000, .val = 0x37 पूर्ण,
	अणु .rfmax = 300000, .val = 0x38 पूर्ण,
	अणु .rfmax = 303000, .val = 0x39 पूर्ण,
	अणु .rfmax = 305000, .val = 0x3a पूर्ण,
	अणु .rfmax = 306000, .val = 0x3b पूर्ण,
	अणु .rfmax = 307000, .val = 0x3c पूर्ण,
	अणु .rfmax = 310000, .val = 0x3d पूर्ण,
	अणु .rfmax = 312000, .val = 0x3e पूर्ण,
	अणु .rfmax = 315000, .val = 0x3f पूर्ण,
	अणु .rfmax = 318000, .val = 0x40 पूर्ण,
	अणु .rfmax = 320000, .val = 0x41 पूर्ण,
	अणु .rfmax = 323000, .val = 0x42 पूर्ण,
	अणु .rfmax = 324000, .val = 0x43 पूर्ण,
	अणु .rfmax = 325000, .val = 0x44 पूर्ण,
	अणु .rfmax = 327000, .val = 0x45 पूर्ण,
	अणु .rfmax = 331000, .val = 0x46 पूर्ण,
	अणु .rfmax = 334000, .val = 0x47 पूर्ण,
	अणु .rfmax = 337000, .val = 0x48 पूर्ण,
	अणु .rfmax = 339000, .val = 0x49 पूर्ण,
	अणु .rfmax = 340000, .val = 0x4a पूर्ण,
	अणु .rfmax = 341000, .val = 0x4b पूर्ण,
	अणु .rfmax = 343000, .val = 0x4c पूर्ण,
	अणु .rfmax = 345000, .val = 0x4d पूर्ण,
	अणु .rfmax = 349000, .val = 0x4e पूर्ण,
	अणु .rfmax = 352000, .val = 0x4f पूर्ण,
	अणु .rfmax = 353000, .val = 0x50 पूर्ण,
	अणु .rfmax = 355000, .val = 0x51 पूर्ण,
	अणु .rfmax = 357000, .val = 0x52 पूर्ण,
	अणु .rfmax = 359000, .val = 0x53 पूर्ण,
	अणु .rfmax = 361000, .val = 0x54 पूर्ण,
	अणु .rfmax = 362000, .val = 0x55 पूर्ण,
	अणु .rfmax = 364000, .val = 0x56 पूर्ण,
	अणु .rfmax = 368000, .val = 0x57 पूर्ण,
	अणु .rfmax = 370000, .val = 0x58 पूर्ण,
	अणु .rfmax = 372000, .val = 0x59 पूर्ण,
	अणु .rfmax = 375000, .val = 0x5a पूर्ण,
	अणु .rfmax = 376000, .val = 0x5b पूर्ण,
	अणु .rfmax = 377000, .val = 0x5c पूर्ण,
	अणु .rfmax = 379000, .val = 0x5d पूर्ण,
	अणु .rfmax = 382000, .val = 0x5e पूर्ण,
	अणु .rfmax = 384000, .val = 0x5f पूर्ण,
	अणु .rfmax = 385000, .val = 0x60 पूर्ण,
	अणु .rfmax = 386000, .val = 0x61 पूर्ण,
	अणु .rfmax = 388000, .val = 0x62 पूर्ण,
	अणु .rfmax = 390000, .val = 0x63 पूर्ण,
	अणु .rfmax = 393000, .val = 0x64 पूर्ण,
	अणु .rfmax = 394000, .val = 0x65 पूर्ण,
	अणु .rfmax = 396000, .val = 0x66 पूर्ण,
	अणु .rfmax = 397000, .val = 0x67 पूर्ण,
	अणु .rfmax = 398000, .val = 0x68 पूर्ण,
	अणु .rfmax = 400000, .val = 0x69 पूर्ण,
	अणु .rfmax = 402000, .val = 0x6a पूर्ण,
	अणु .rfmax = 403000, .val = 0x6b पूर्ण,
	अणु .rfmax = 407000, .val = 0x6c पूर्ण,
	अणु .rfmax = 408000, .val = 0x6d पूर्ण,
	अणु .rfmax = 409000, .val = 0x6e पूर्ण,
	अणु .rfmax = 410000, .val = 0x6f पूर्ण,
	अणु .rfmax = 411000, .val = 0x70 पूर्ण,
	अणु .rfmax = 412000, .val = 0x71 पूर्ण,
	अणु .rfmax = 413000, .val = 0x72 पूर्ण,
	अणु .rfmax = 414000, .val = 0x73 पूर्ण,
	अणु .rfmax = 417000, .val = 0x74 पूर्ण,
	अणु .rfmax = 418000, .val = 0x75 पूर्ण,
	अणु .rfmax = 420000, .val = 0x76 पूर्ण,
	अणु .rfmax = 422000, .val = 0x77 पूर्ण,
	अणु .rfmax = 423000, .val = 0x78 पूर्ण,
	अणु .rfmax = 424000, .val = 0x79 पूर्ण,
	अणु .rfmax = 427000, .val = 0x7a पूर्ण,
	अणु .rfmax = 428000, .val = 0x7b पूर्ण,
	अणु .rfmax = 429000, .val = 0x7d पूर्ण,
	अणु .rfmax = 432000, .val = 0x7f पूर्ण,
	अणु .rfmax = 434000, .val = 0x80 पूर्ण,
	अणु .rfmax = 435000, .val = 0x81 पूर्ण,
	अणु .rfmax = 436000, .val = 0x83 पूर्ण,
	अणु .rfmax = 437000, .val = 0x84 पूर्ण,
	अणु .rfmax = 438000, .val = 0x85 पूर्ण,
	अणु .rfmax = 439000, .val = 0x86 पूर्ण,
	अणु .rfmax = 440000, .val = 0x87 पूर्ण,
	अणु .rfmax = 441000, .val = 0x88 पूर्ण,
	अणु .rfmax = 442000, .val = 0x89 पूर्ण,
	अणु .rfmax = 445000, .val = 0x8a पूर्ण,
	अणु .rfmax = 446000, .val = 0x8b पूर्ण,
	अणु .rfmax = 447000, .val = 0x8c पूर्ण,
	अणु .rfmax = 448000, .val = 0x8e पूर्ण,
	अणु .rfmax = 449000, .val = 0x8f पूर्ण,
	अणु .rfmax = 450000, .val = 0x90 पूर्ण,
	अणु .rfmax = 452000, .val = 0x91 पूर्ण,
	अणु .rfmax = 453000, .val = 0x93 पूर्ण,
	अणु .rfmax = 454000, .val = 0x94 पूर्ण,
	अणु .rfmax = 456000, .val = 0x96 पूर्ण,
	अणु .rfmax = 457800, .val = 0x98 पूर्ण,
	अणु .rfmax = 461000, .val = 0x11 पूर्ण,
	अणु .rfmax = 468000, .val = 0x12 पूर्ण,
	अणु .rfmax = 472000, .val = 0x13 पूर्ण,
	अणु .rfmax = 473000, .val = 0x14 पूर्ण,
	अणु .rfmax = 474000, .val = 0x15 पूर्ण,
	अणु .rfmax = 481000, .val = 0x16 पूर्ण,
	अणु .rfmax = 486000, .val = 0x17 पूर्ण,
	अणु .rfmax = 491000, .val = 0x18 पूर्ण,
	अणु .rfmax = 498000, .val = 0x19 पूर्ण,
	अणु .rfmax = 499000, .val = 0x1a पूर्ण,
	अणु .rfmax = 501000, .val = 0x1b पूर्ण,
	अणु .rfmax = 506000, .val = 0x1c पूर्ण,
	अणु .rfmax = 511000, .val = 0x1d पूर्ण,
	अणु .rfmax = 516000, .val = 0x1e पूर्ण,
	अणु .rfmax = 520000, .val = 0x1f पूर्ण,
	अणु .rfmax = 521000, .val = 0x20 पूर्ण,
	अणु .rfmax = 525000, .val = 0x21 पूर्ण,
	अणु .rfmax = 529000, .val = 0x22 पूर्ण,
	अणु .rfmax = 533000, .val = 0x23 पूर्ण,
	अणु .rfmax = 539000, .val = 0x24 पूर्ण,
	अणु .rfmax = 541000, .val = 0x25 पूर्ण,
	अणु .rfmax = 547000, .val = 0x26 पूर्ण,
	अणु .rfmax = 549000, .val = 0x27 पूर्ण,
	अणु .rfmax = 551000, .val = 0x28 पूर्ण,
	अणु .rfmax = 556000, .val = 0x29 पूर्ण,
	अणु .rfmax = 561000, .val = 0x2a पूर्ण,
	अणु .rfmax = 563000, .val = 0x2b पूर्ण,
	अणु .rfmax = 565000, .val = 0x2c पूर्ण,
	अणु .rfmax = 569000, .val = 0x2d पूर्ण,
	अणु .rfmax = 571000, .val = 0x2e पूर्ण,
	अणु .rfmax = 577000, .val = 0x2f पूर्ण,
	अणु .rfmax = 580000, .val = 0x30 पूर्ण,
	अणु .rfmax = 582000, .val = 0x31 पूर्ण,
	अणु .rfmax = 584000, .val = 0x32 पूर्ण,
	अणु .rfmax = 588000, .val = 0x33 पूर्ण,
	अणु .rfmax = 591000, .val = 0x34 पूर्ण,
	अणु .rfmax = 596000, .val = 0x35 पूर्ण,
	अणु .rfmax = 598000, .val = 0x36 पूर्ण,
	अणु .rfmax = 603000, .val = 0x37 पूर्ण,
	अणु .rfmax = 604000, .val = 0x38 पूर्ण,
	अणु .rfmax = 606000, .val = 0x39 पूर्ण,
	अणु .rfmax = 612000, .val = 0x3a पूर्ण,
	अणु .rfmax = 615000, .val = 0x3b पूर्ण,
	अणु .rfmax = 617000, .val = 0x3c पूर्ण,
	अणु .rfmax = 621000, .val = 0x3d पूर्ण,
	अणु .rfmax = 622000, .val = 0x3e पूर्ण,
	अणु .rfmax = 625000, .val = 0x3f पूर्ण,
	अणु .rfmax = 632000, .val = 0x40 पूर्ण,
	अणु .rfmax = 633000, .val = 0x41 पूर्ण,
	अणु .rfmax = 634000, .val = 0x42 पूर्ण,
	अणु .rfmax = 642000, .val = 0x43 पूर्ण,
	अणु .rfmax = 643000, .val = 0x44 पूर्ण,
	अणु .rfmax = 647000, .val = 0x45 पूर्ण,
	अणु .rfmax = 650000, .val = 0x46 पूर्ण,
	अणु .rfmax = 652000, .val = 0x47 पूर्ण,
	अणु .rfmax = 657000, .val = 0x48 पूर्ण,
	अणु .rfmax = 661000, .val = 0x49 पूर्ण,
	अणु .rfmax = 662000, .val = 0x4a पूर्ण,
	अणु .rfmax = 665000, .val = 0x4b पूर्ण,
	अणु .rfmax = 667000, .val = 0x4c पूर्ण,
	अणु .rfmax = 670000, .val = 0x4d पूर्ण,
	अणु .rfmax = 673000, .val = 0x4e पूर्ण,
	अणु .rfmax = 676000, .val = 0x4f पूर्ण,
	अणु .rfmax = 677000, .val = 0x50 पूर्ण,
	अणु .rfmax = 681000, .val = 0x51 पूर्ण,
	अणु .rfmax = 683000, .val = 0x52 पूर्ण,
	अणु .rfmax = 686000, .val = 0x53 पूर्ण,
	अणु .rfmax = 688000, .val = 0x54 पूर्ण,
	अणु .rfmax = 689000, .val = 0x55 पूर्ण,
	अणु .rfmax = 691000, .val = 0x56 पूर्ण,
	अणु .rfmax = 695000, .val = 0x57 पूर्ण,
	अणु .rfmax = 698000, .val = 0x58 पूर्ण,
	अणु .rfmax = 703000, .val = 0x59 पूर्ण,
	अणु .rfmax = 704000, .val = 0x5a पूर्ण,
	अणु .rfmax = 705000, .val = 0x5b पूर्ण,
	अणु .rfmax = 707000, .val = 0x5c पूर्ण,
	अणु .rfmax = 710000, .val = 0x5d पूर्ण,
	अणु .rfmax = 712000, .val = 0x5e पूर्ण,
	अणु .rfmax = 717000, .val = 0x5f पूर्ण,
	अणु .rfmax = 718000, .val = 0x60 पूर्ण,
	अणु .rfmax = 721000, .val = 0x61 पूर्ण,
	अणु .rfmax = 722000, .val = 0x62 पूर्ण,
	अणु .rfmax = 723000, .val = 0x63 पूर्ण,
	अणु .rfmax = 725000, .val = 0x64 पूर्ण,
	अणु .rfmax = 727000, .val = 0x65 पूर्ण,
	अणु .rfmax = 730000, .val = 0x66 पूर्ण,
	अणु .rfmax = 732000, .val = 0x67 पूर्ण,
	अणु .rfmax = 735000, .val = 0x68 पूर्ण,
	अणु .rfmax = 740000, .val = 0x69 पूर्ण,
	अणु .rfmax = 741000, .val = 0x6a पूर्ण,
	अणु .rfmax = 742000, .val = 0x6b पूर्ण,
	अणु .rfmax = 743000, .val = 0x6c पूर्ण,
	अणु .rfmax = 745000, .val = 0x6d पूर्ण,
	अणु .rfmax = 747000, .val = 0x6e पूर्ण,
	अणु .rfmax = 748000, .val = 0x6f पूर्ण,
	अणु .rfmax = 750000, .val = 0x70 पूर्ण,
	अणु .rfmax = 752000, .val = 0x71 पूर्ण,
	अणु .rfmax = 754000, .val = 0x72 पूर्ण,
	अणु .rfmax = 757000, .val = 0x73 पूर्ण,
	अणु .rfmax = 758000, .val = 0x74 पूर्ण,
	अणु .rfmax = 760000, .val = 0x75 पूर्ण,
	अणु .rfmax = 763000, .val = 0x76 पूर्ण,
	अणु .rfmax = 764000, .val = 0x77 पूर्ण,
	अणु .rfmax = 766000, .val = 0x78 पूर्ण,
	अणु .rfmax = 767000, .val = 0x79 पूर्ण,
	अणु .rfmax = 768000, .val = 0x7a पूर्ण,
	अणु .rfmax = 773000, .val = 0x7b पूर्ण,
	अणु .rfmax = 774000, .val = 0x7c पूर्ण,
	अणु .rfmax = 776000, .val = 0x7d पूर्ण,
	अणु .rfmax = 777000, .val = 0x7e पूर्ण,
	अणु .rfmax = 778000, .val = 0x7f पूर्ण,
	अणु .rfmax = 779000, .val = 0x80 पूर्ण,
	अणु .rfmax = 781000, .val = 0x81 पूर्ण,
	अणु .rfmax = 783000, .val = 0x82 पूर्ण,
	अणु .rfmax = 784000, .val = 0x83 पूर्ण,
	अणु .rfmax = 785000, .val = 0x84 पूर्ण,
	अणु .rfmax = 786000, .val = 0x85 पूर्ण,
	अणु .rfmax = 793000, .val = 0x86 पूर्ण,
	अणु .rfmax = 794000, .val = 0x87 पूर्ण,
	अणु .rfmax = 795000, .val = 0x88 पूर्ण,
	अणु .rfmax = 797000, .val = 0x89 पूर्ण,
	अणु .rfmax = 799000, .val = 0x8a पूर्ण,
	अणु .rfmax = 801000, .val = 0x8b पूर्ण,
	अणु .rfmax = 802000, .val = 0x8c पूर्ण,
	अणु .rfmax = 803000, .val = 0x8d पूर्ण,
	अणु .rfmax = 804000, .val = 0x8e पूर्ण,
	अणु .rfmax = 810000, .val = 0x90 पूर्ण,
	अणु .rfmax = 811000, .val = 0x91 पूर्ण,
	अणु .rfmax = 812000, .val = 0x92 पूर्ण,
	अणु .rfmax = 814000, .val = 0x93 पूर्ण,
	अणु .rfmax = 816000, .val = 0x94 पूर्ण,
	अणु .rfmax = 817000, .val = 0x96 पूर्ण,
	अणु .rfmax = 818000, .val = 0x97 पूर्ण,
	अणु .rfmax = 820000, .val = 0x98 पूर्ण,
	अणु .rfmax = 821000, .val = 0x99 पूर्ण,
	अणु .rfmax = 822000, .val = 0x9a पूर्ण,
	अणु .rfmax = 828000, .val = 0x9b पूर्ण,
	अणु .rfmax = 829000, .val = 0x9d पूर्ण,
	अणु .rfmax = 830000, .val = 0x9f पूर्ण,
	अणु .rfmax = 831000, .val = 0xa0 पूर्ण,
	अणु .rfmax = 833000, .val = 0xa1 पूर्ण,
	अणु .rfmax = 835000, .val = 0xa2 पूर्ण,
	अणु .rfmax = 836000, .val = 0xa3 पूर्ण,
	अणु .rfmax = 837000, .val = 0xa4 पूर्ण,
	अणु .rfmax = 838000, .val = 0xa6 पूर्ण,
	अणु .rfmax = 840000, .val = 0xa8 पूर्ण,
	अणु .rfmax = 842000, .val = 0xa9 पूर्ण,
	अणु .rfmax = 845000, .val = 0xaa पूर्ण,
	अणु .rfmax = 846000, .val = 0xab पूर्ण,
	अणु .rfmax = 847000, .val = 0xad पूर्ण,
	अणु .rfmax = 848000, .val = 0xae पूर्ण,
	अणु .rfmax = 852000, .val = 0xaf पूर्ण,
	अणु .rfmax = 853000, .val = 0xb0 पूर्ण,
	अणु .rfmax = 858000, .val = 0xb1 पूर्ण,
	अणु .rfmax = 860000, .val = 0xb2 पूर्ण,
	अणु .rfmax = 861000, .val = 0xb3 पूर्ण,
	अणु .rfmax = 862000, .val = 0xb4 पूर्ण,
	अणु .rfmax = 863000, .val = 0xb6 पूर्ण,
	अणु .rfmax = 864000, .val = 0xb8 पूर्ण,
	अणु .rfmax = 865000, .val = 0xb9 पूर्ण,
	अणु .rfmax =      0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271_ir_measure[] = अणु
	अणु .rfmax =  30000, .val = 4 पूर्ण,
	अणु .rfmax = 200000, .val = 5 पूर्ण,
	अणु .rfmax = 600000, .val = 6 पूर्ण,
	अणु .rfmax = 865000, .val = 7 पूर्ण,
	अणु .rfmax =      0, .val = 0 पूर्ण, /* end */
पूर्ण;

अटल काष्ठा tda18271_map tda18271_rf_cal_dc_over_dt[] = अणु
	अणु .rfmax =  47900, .val = 0x00 पूर्ण,
	अणु .rfmax =  55000, .val = 0x00 पूर्ण,
	अणु .rfmax =  61100, .val = 0x0a पूर्ण,
	अणु .rfmax =  64000, .val = 0x0a पूर्ण,
	अणु .rfmax =  82000, .val = 0x14 पूर्ण,
	अणु .rfmax =  84000, .val = 0x19 पूर्ण,
	अणु .rfmax = 119000, .val = 0x1c पूर्ण,
	अणु .rfmax = 124000, .val = 0x20 पूर्ण,
	अणु .rfmax = 129000, .val = 0x2a पूर्ण,
	अणु .rfmax = 134000, .val = 0x32 पूर्ण,
	अणु .rfmax = 139000, .val = 0x39 पूर्ण,
	अणु .rfmax = 144000, .val = 0x3e पूर्ण,
	अणु .rfmax = 149000, .val = 0x3f पूर्ण,
	अणु .rfmax = 152600, .val = 0x40 पूर्ण,
	अणु .rfmax = 154000, .val = 0x40 पूर्ण,
	अणु .rfmax = 164700, .val = 0x41 पूर्ण,
	अणु .rfmax = 203500, .val = 0x32 पूर्ण,
	अणु .rfmax = 353000, .val = 0x19 पूर्ण,
	अणु .rfmax = 356000, .val = 0x1a पूर्ण,
	अणु .rfmax = 359000, .val = 0x1b पूर्ण,
	अणु .rfmax = 363000, .val = 0x1c पूर्ण,
	अणु .rfmax = 366000, .val = 0x1d पूर्ण,
	अणु .rfmax = 369000, .val = 0x1e पूर्ण,
	अणु .rfmax = 373000, .val = 0x1f पूर्ण,
	अणु .rfmax = 376000, .val = 0x20 पूर्ण,
	अणु .rfmax = 379000, .val = 0x21 पूर्ण,
	अणु .rfmax = 383000, .val = 0x22 पूर्ण,
	अणु .rfmax = 386000, .val = 0x23 पूर्ण,
	अणु .rfmax = 389000, .val = 0x24 पूर्ण,
	अणु .rfmax = 393000, .val = 0x25 पूर्ण,
	अणु .rfmax = 396000, .val = 0x26 पूर्ण,
	अणु .rfmax = 399000, .val = 0x27 पूर्ण,
	अणु .rfmax = 402000, .val = 0x28 पूर्ण,
	अणु .rfmax = 404000, .val = 0x29 पूर्ण,
	अणु .rfmax = 407000, .val = 0x2a पूर्ण,
	अणु .rfmax = 409000, .val = 0x2b पूर्ण,
	अणु .rfmax = 412000, .val = 0x2c पूर्ण,
	अणु .rfmax = 414000, .val = 0x2d पूर्ण,
	अणु .rfmax = 417000, .val = 0x2e पूर्ण,
	अणु .rfmax = 419000, .val = 0x2f पूर्ण,
	अणु .rfmax = 422000, .val = 0x30 पूर्ण,
	अणु .rfmax = 424000, .val = 0x31 पूर्ण,
	अणु .rfmax = 427000, .val = 0x32 पूर्ण,
	अणु .rfmax = 429000, .val = 0x33 पूर्ण,
	अणु .rfmax = 432000, .val = 0x34 पूर्ण,
	अणु .rfmax = 434000, .val = 0x35 पूर्ण,
	अणु .rfmax = 437000, .val = 0x36 पूर्ण,
	अणु .rfmax = 439000, .val = 0x37 पूर्ण,
	अणु .rfmax = 442000, .val = 0x38 पूर्ण,
	अणु .rfmax = 444000, .val = 0x39 पूर्ण,
	अणु .rfmax = 447000, .val = 0x3a पूर्ण,
	अणु .rfmax = 449000, .val = 0x3b पूर्ण,
	अणु .rfmax = 457800, .val = 0x3c पूर्ण,
	अणु .rfmax = 465000, .val = 0x0f पूर्ण,
	अणु .rfmax = 477000, .val = 0x12 पूर्ण,
	अणु .rfmax = 483000, .val = 0x14 पूर्ण,
	अणु .rfmax = 502000, .val = 0x19 पूर्ण,
	अणु .rfmax = 508000, .val = 0x1b पूर्ण,
	अणु .rfmax = 519000, .val = 0x1c पूर्ण,
	अणु .rfmax = 522000, .val = 0x1d पूर्ण,
	अणु .rfmax = 524000, .val = 0x1e पूर्ण,
	अणु .rfmax = 534000, .val = 0x1f पूर्ण,
	अणु .rfmax = 549000, .val = 0x20 पूर्ण,
	अणु .rfmax = 554000, .val = 0x22 पूर्ण,
	अणु .rfmax = 584000, .val = 0x24 पूर्ण,
	अणु .rfmax = 589000, .val = 0x26 पूर्ण,
	अणु .rfmax = 658000, .val = 0x27 पूर्ण,
	अणु .rfmax = 664000, .val = 0x2c पूर्ण,
	अणु .rfmax = 669000, .val = 0x2d पूर्ण,
	अणु .rfmax = 699000, .val = 0x2e पूर्ण,
	अणु .rfmax = 704000, .val = 0x30 पूर्ण,
	अणु .rfmax = 709000, .val = 0x31 पूर्ण,
	अणु .rfmax = 714000, .val = 0x32 पूर्ण,
	अणु .rfmax = 724000, .val = 0x33 पूर्ण,
	अणु .rfmax = 729000, .val = 0x36 पूर्ण,
	अणु .rfmax = 739000, .val = 0x38 पूर्ण,
	अणु .rfmax = 744000, .val = 0x39 पूर्ण,
	अणु .rfmax = 749000, .val = 0x3b पूर्ण,
	अणु .rfmax = 754000, .val = 0x3c पूर्ण,
	अणु .rfmax = 759000, .val = 0x3d पूर्ण,
	अणु .rfmax = 764000, .val = 0x3e पूर्ण,
	अणु .rfmax = 769000, .val = 0x3f पूर्ण,
	अणु .rfmax = 774000, .val = 0x40 पूर्ण,
	अणु .rfmax = 779000, .val = 0x41 पूर्ण,
	अणु .rfmax = 784000, .val = 0x43 पूर्ण,
	अणु .rfmax = 789000, .val = 0x46 पूर्ण,
	अणु .rfmax = 794000, .val = 0x48 पूर्ण,
	अणु .rfmax = 799000, .val = 0x4b पूर्ण,
	अणु .rfmax = 804000, .val = 0x4f पूर्ण,
	अणु .rfmax = 809000, .val = 0x54 पूर्ण,
	अणु .rfmax = 814000, .val = 0x59 पूर्ण,
	अणु .rfmax = 819000, .val = 0x5d पूर्ण,
	अणु .rfmax = 824000, .val = 0x61 पूर्ण,
	अणु .rfmax = 829000, .val = 0x68 पूर्ण,
	अणु .rfmax = 834000, .val = 0x6e पूर्ण,
	अणु .rfmax = 839000, .val = 0x75 पूर्ण,
	अणु .rfmax = 844000, .val = 0x7e पूर्ण,
	अणु .rfmax = 849000, .val = 0x82 पूर्ण,
	अणु .rfmax = 854000, .val = 0x84 पूर्ण,
	अणु .rfmax = 859000, .val = 0x8f पूर्ण,
	अणु .rfmax = 865000, .val = 0x9a पूर्ण,
	अणु .rfmax =      0, .val = 0x00 पूर्ण, /* end */
पूर्ण;

/*---------------------------------------------------------------------*/

काष्ठा tda18271_thermo_map अणु
	u8 d;
	u8 r0;
	u8 r1;
पूर्ण;

अटल काष्ठा tda18271_thermo_map tda18271_thermometer[] = अणु
	अणु .d = 0x00, .r0 = 60, .r1 =  92 पूर्ण,
	अणु .d = 0x01, .r0 = 62, .r1 =  94 पूर्ण,
	अणु .d = 0x02, .r0 = 66, .r1 =  98 पूर्ण,
	अणु .d = 0x03, .r0 = 64, .r1 =  96 पूर्ण,
	अणु .d = 0x04, .r0 = 74, .r1 = 106 पूर्ण,
	अणु .d = 0x05, .r0 = 72, .r1 = 104 पूर्ण,
	अणु .d = 0x06, .r0 = 68, .r1 = 100 पूर्ण,
	अणु .d = 0x07, .r0 = 70, .r1 = 102 पूर्ण,
	अणु .d = 0x08, .r0 = 90, .r1 = 122 पूर्ण,
	अणु .d = 0x09, .r0 = 88, .r1 = 120 पूर्ण,
	अणु .d = 0x0a, .r0 = 84, .r1 = 116 पूर्ण,
	अणु .d = 0x0b, .r0 = 86, .r1 = 118 पूर्ण,
	अणु .d = 0x0c, .r0 = 76, .r1 = 108 पूर्ण,
	अणु .d = 0x0d, .r0 = 78, .r1 = 110 पूर्ण,
	अणु .d = 0x0e, .r0 = 82, .r1 = 114 पूर्ण,
	अणु .d = 0x0f, .r0 = 80, .r1 = 112 पूर्ण,
	अणु .d = 0x00, .r0 =  0, .r1 =   0 पूर्ण, /* end */
पूर्ण;

पूर्णांक tda18271_lookup_thermometer(काष्ठा dvb_frontend *fe)
अणु
	काष्ठा tda18271_priv *priv = fe->tuner_priv;
	अचिन्हित अक्षर *regs = priv->tda18271_regs;
	पूर्णांक val, i = 0;

	जबतक (tda18271_thermometer[i].d < (regs[R_TM] & 0x0f)) अणु
		अगर (tda18271_thermometer[i + 1].d == 0)
			अवरोध;
		i++;
	पूर्ण

	अगर ((regs[R_TM] & 0x20) == 0x20)
		val = tda18271_thermometer[i].r1;
	अन्यथा
		val = tda18271_thermometer[i].r0;

	tda_map("(%d) tm = %d\n", i, val);

	वापस val;
पूर्ण

/*---------------------------------------------------------------------*/

काष्ठा tda18271_cid_target_map अणु
	u32 rfmax;
	u8  target;
	u16 limit;
पूर्ण;

अटल काष्ठा tda18271_cid_target_map tda18271_cid_target[] = अणु
	अणु .rfmax =  46000, .target = 0x04, .limit =  1800 पूर्ण,
	अणु .rfmax =  52200, .target = 0x0a, .limit =  1500 पूर्ण,
	अणु .rfmax =  70100, .target = 0x01, .limit =  4000 पूर्ण,
	अणु .rfmax = 136800, .target = 0x18, .limit =  4000 पूर्ण,
	अणु .rfmax = 156700, .target = 0x18, .limit =  4000 पूर्ण,
	अणु .rfmax = 186250, .target = 0x0a, .limit =  4000 पूर्ण,
	अणु .rfmax = 230000, .target = 0x0a, .limit =  4000 पूर्ण,
	अणु .rfmax = 345000, .target = 0x18, .limit =  4000 पूर्ण,
	अणु .rfmax = 426000, .target = 0x0e, .limit =  4000 पूर्ण,
	अणु .rfmax = 489500, .target = 0x1e, .limit =  4000 पूर्ण,
	अणु .rfmax = 697500, .target = 0x32, .limit =  4000 पूर्ण,
	अणु .rfmax = 842000, .target = 0x3a, .limit =  4000 पूर्ण,
	अणु .rfmax =      0, .target = 0x00, .limit =     0 पूर्ण, /* end */
पूर्ण;

पूर्णांक tda18271_lookup_cid_target(काष्ठा dvb_frontend *fe,
			       u32 *freq, u8 *cid_target, u16 *count_limit)
अणु
	काष्ठा tda18271_priv *priv = fe->tuner_priv;
	पूर्णांक i = 0;

	जबतक ((tda18271_cid_target[i].rfmax * 1000) < *freq) अणु
		अगर (tda18271_cid_target[i + 1].rfmax == 0)
			अवरोध;
		i++;
	पूर्ण
	*cid_target  = tda18271_cid_target[i].target;
	*count_limit = tda18271_cid_target[i].limit;

	tda_map("(%d) cid_target = %02x, count_limit = %d\n", i,
		tda18271_cid_target[i].target, tda18271_cid_target[i].limit);

	वापस 0;
पूर्ण

/*---------------------------------------------------------------------*/

अटल काष्ठा tda18271_rf_tracking_filter_cal tda18271_rf_band_ढाँचा[] = अणु
	अणु .rfmax =  47900, .rfband = 0x00,
	  .rf1_def =  46000, .rf2_def =      0, .rf3_def =      0 पूर्ण,
	अणु .rfmax =  61100, .rfband = 0x01,
	  .rf1_def =  52200, .rf2_def =      0, .rf3_def =      0 पूर्ण,
	अणु .rfmax = 152600, .rfband = 0x02,
	  .rf1_def =  70100, .rf2_def = 136800, .rf3_def =      0 पूर्ण,
	अणु .rfmax = 164700, .rfband = 0x03,
	  .rf1_def = 156700, .rf2_def =      0, .rf3_def =      0 पूर्ण,
	अणु .rfmax = 203500, .rfband = 0x04,
	  .rf1_def = 186250, .rf2_def =      0, .rf3_def =      0 पूर्ण,
	अणु .rfmax = 457800, .rfband = 0x05,
	  .rf1_def = 230000, .rf2_def = 345000, .rf3_def = 426000 पूर्ण,
	अणु .rfmax = 865000, .rfband = 0x06,
	  .rf1_def = 489500, .rf2_def = 697500, .rf3_def = 842000 पूर्ण,
	अणु .rfmax =      0, .rfband = 0x00,
	  .rf1_def =      0, .rf2_def =      0, .rf3_def =      0 पूर्ण, /* end */
पूर्ण;

पूर्णांक tda18271_lookup_rf_band(काष्ठा dvb_frontend *fe, u32 *freq, u8 *rf_band)
अणु
	काष्ठा tda18271_priv *priv = fe->tuner_priv;
	काष्ठा tda18271_rf_tracking_filter_cal *map = priv->rf_cal_state;
	पूर्णांक i = 0;

	जबतक ((map[i].rfmax * 1000) < *freq) अणु
		अगर (tda18271_debug & DBG_ADV)
			tda_map("(%d) rfmax = %d < freq = %d, rf1_def = %d, rf2_def = %d, rf3_def = %d, rf1 = %d, rf2 = %d, rf3 = %d, rf_a1 = %d, rf_a2 = %d, rf_b1 = %d, rf_b2 = %d\n",
				i, map[i].rfmax * 1000, *freq,
				map[i].rf1_def, map[i].rf2_def, map[i].rf3_def,
				map[i].rf1, map[i].rf2, map[i].rf3,
				map[i].rf_a1, map[i].rf_a2,
				map[i].rf_b1, map[i].rf_b2);
		अगर (map[i].rfmax == 0)
			वापस -EINVAL;
		i++;
	पूर्ण
	अगर (rf_band)
		*rf_band = map[i].rfband;

	tda_map("(%d) rf_band = %02x\n", i, map[i].rfband);

	वापस i;
पूर्ण

/*---------------------------------------------------------------------*/

काष्ठा tda18271_map_layout अणु
	काष्ठा tda18271_pll_map *मुख्य_pll;
	काष्ठा tda18271_pll_map *cal_pll;

	काष्ठा tda18271_map *rf_cal;
	काष्ठा tda18271_map *rf_cal_kmco;
	काष्ठा tda18271_map *rf_cal_dc_over_dt;

	काष्ठा tda18271_map *bp_filter;
	काष्ठा tda18271_map *rf_band;
	काष्ठा tda18271_map *gain_taper;
	काष्ठा tda18271_map *ir_measure;
पूर्ण;

/*---------------------------------------------------------------------*/

पूर्णांक tda18271_lookup_pll_map(काष्ठा dvb_frontend *fe,
			    क्रमागत tda18271_map_type map_type,
			    u32 *freq, u8 *post_भाग, u8 *भाग)
अणु
	काष्ठा tda18271_priv *priv = fe->tuner_priv;
	काष्ठा tda18271_pll_map *map = शून्य;
	अचिन्हित पूर्णांक i = 0;
	अक्षर *map_name;
	पूर्णांक ret = 0;

	BUG_ON(!priv->maps);

	चयन (map_type) अणु
	हाल MAIN_PLL:
		map = priv->maps->मुख्य_pll;
		map_name = "main_pll";
		अवरोध;
	हाल CAL_PLL:
		map = priv->maps->cal_pll;
		map_name = "cal_pll";
		अवरोध;
	शेष:
		/* we should never get here */
		map_name = "undefined";
		अवरोध;
	पूर्ण

	अगर (!map) अणु
		tda_warn("%s map is not set!\n", map_name);
		ret = -EINVAL;
		जाओ fail;
	पूर्ण

	जबतक ((map[i].lomax * 1000) < *freq) अणु
		अगर (map[i + 1].lomax == 0) अणु
			tda_map("%s: frequency (%d) out of range\n",
				map_name, *freq);
			ret = -दुस्फल;
			अवरोध;
		पूर्ण
		i++;
	पूर्ण
	*post_भाग = map[i].pd;
	*भाग      = map[i].d;

	tda_map("(%d) %s: post div = 0x%02x, div = 0x%02x\n",
		i, map_name, *post_भाग, *भाग);
fail:
	वापस ret;
पूर्ण

पूर्णांक tda18271_lookup_map(काष्ठा dvb_frontend *fe,
			क्रमागत tda18271_map_type map_type,
			u32 *freq, u8 *val)
अणु
	काष्ठा tda18271_priv *priv = fe->tuner_priv;
	काष्ठा tda18271_map *map = शून्य;
	अचिन्हित पूर्णांक i = 0;
	अक्षर *map_name;
	पूर्णांक ret = 0;

	BUG_ON(!priv->maps);

	चयन (map_type) अणु
	हाल BP_FILTER:
		map = priv->maps->bp_filter;
		map_name = "bp_filter";
		अवरोध;
	हाल RF_CAL_KMCO:
		map = priv->maps->rf_cal_kmco;
		map_name = "km";
		अवरोध;
	हाल RF_BAND:
		map = priv->maps->rf_band;
		map_name = "rf_band";
		अवरोध;
	हाल GAIN_TAPER:
		map = priv->maps->gain_taper;
		map_name = "gain_taper";
		अवरोध;
	हाल RF_CAL:
		map = priv->maps->rf_cal;
		map_name = "rf_cal";
		अवरोध;
	हाल IR_MEASURE:
		map = priv->maps->ir_measure;
		map_name = "ir_measure";
		अवरोध;
	हाल RF_CAL_DC_OVER_DT:
		map = priv->maps->rf_cal_dc_over_dt;
		map_name = "rf_cal_dc_over_dt";
		अवरोध;
	शेष:
		/* we should never get here */
		map_name = "undefined";
		अवरोध;
	पूर्ण

	अगर (!map) अणु
		tda_warn("%s map is not set!\n", map_name);
		ret = -EINVAL;
		जाओ fail;
	पूर्ण

	जबतक ((map[i].rfmax * 1000) < *freq) अणु
		अगर (map[i + 1].rfmax == 0) अणु
			tda_map("%s: frequency (%d) out of range\n",
				map_name, *freq);
			ret = -दुस्फल;
			अवरोध;
		पूर्ण
		i++;
	पूर्ण
	*val = map[i].val;

	tda_map("(%d) %s: 0x%02x\n", i, map_name, *val);
fail:
	वापस ret;
पूर्ण

/*---------------------------------------------------------------------*/

अटल स्थिर काष्ठा tda18271_std_map tda18271c1_std_map = अणु
	.fm_radio = अणु .अगर_freq = 1250, .fm_rfn = 1, .agc_mode = 3, .std = 0,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x18 */
	.atv_b    = अणु .अगर_freq = 6750, .fm_rfn = 0, .agc_mode = 1, .std = 6,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0e */
	.atv_dk   = अणु .अगर_freq = 7750, .fm_rfn = 0, .agc_mode = 1, .std = 7,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0f */
	.atv_gh   = अणु .अगर_freq = 7750, .fm_rfn = 0, .agc_mode = 1, .std = 7,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0f */
	.atv_i    = अणु .अगर_freq = 7750, .fm_rfn = 0, .agc_mode = 1, .std = 7,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0f */
	.atv_l    = अणु .अगर_freq = 7750, .fm_rfn = 0, .agc_mode = 1, .std = 7,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0f */
	.atv_lc   = अणु .अगर_freq = 1250, .fm_rfn = 0, .agc_mode = 1, .std = 7,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0f */
	.atv_mn   = अणु .अगर_freq = 5750, .fm_rfn = 0, .agc_mode = 1, .std = 5,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0d */
	.atsc_6   = अणु .अगर_freq = 3250, .fm_rfn = 0, .agc_mode = 3, .std = 4,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1c */
	.dvbt_6   = अणु .अगर_freq = 3300, .fm_rfn = 0, .agc_mode = 3, .std = 4,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1c */
	.dvbt_7   = अणु .अगर_freq = 3800, .fm_rfn = 0, .agc_mode = 3, .std = 5,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1d */
	.dvbt_8   = अणु .अगर_freq = 4300, .fm_rfn = 0, .agc_mode = 3, .std = 6,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1e */
	.qam_6    = अणु .अगर_freq = 4000, .fm_rfn = 0, .agc_mode = 3, .std = 5,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1d */
	.qam_7    = अणु .अगर_freq = 4500, .fm_rfn = 0, .agc_mode = 3, .std = 6,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1e */
	.qam_8    = अणु .अगर_freq = 5000, .fm_rfn = 0, .agc_mode = 3, .std = 7,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1f */
पूर्ण;

अटल स्थिर काष्ठा tda18271_std_map tda18271c2_std_map = अणु
	.fm_radio = अणु .अगर_freq = 1250, .fm_rfn = 1, .agc_mode = 3, .std = 0,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x18 */
	.atv_b    = अणु .अगर_freq = 6000, .fm_rfn = 0, .agc_mode = 1, .std = 5,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0d */
	.atv_dk   = अणु .अगर_freq = 6900, .fm_rfn = 0, .agc_mode = 1, .std = 6,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0e */
	.atv_gh   = अणु .अगर_freq = 7100, .fm_rfn = 0, .agc_mode = 1, .std = 6,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0e */
	.atv_i    = अणु .अगर_freq = 7250, .fm_rfn = 0, .agc_mode = 1, .std = 6,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0e */
	.atv_l    = अणु .अगर_freq = 6900, .fm_rfn = 0, .agc_mode = 1, .std = 6,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0e */
	.atv_lc   = अणु .अगर_freq = 1250, .fm_rfn = 0, .agc_mode = 1, .std = 6,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0e */
	.atv_mn   = अणु .अगर_freq = 5400, .fm_rfn = 0, .agc_mode = 1, .std = 4,
		      .अगर_lvl = 0, .rfagc_top = 0x2c, पूर्ण, /* EP3[4:0] 0x0c */
	.atsc_6   = अणु .अगर_freq = 3250, .fm_rfn = 0, .agc_mode = 3, .std = 4,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1c */
	.dvbt_6   = अणु .अगर_freq = 3300, .fm_rfn = 0, .agc_mode = 3, .std = 4,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1c */
	.dvbt_7   = अणु .अगर_freq = 3500, .fm_rfn = 0, .agc_mode = 3, .std = 4,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1c */
	.dvbt_8   = अणु .अगर_freq = 4000, .fm_rfn = 0, .agc_mode = 3, .std = 5,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1d */
	.qam_6    = अणु .अगर_freq = 4000, .fm_rfn = 0, .agc_mode = 3, .std = 5,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1d */
	.qam_7    = अणु .अगर_freq = 4500, .fm_rfn = 0, .agc_mode = 3, .std = 6,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1e */
	.qam_8    = अणु .अगर_freq = 5000, .fm_rfn = 0, .agc_mode = 3, .std = 7,
		      .अगर_lvl = 1, .rfagc_top = 0x37, पूर्ण, /* EP3[4:0] 0x1f */
पूर्ण;

/*---------------------------------------------------------------------*/

अटल काष्ठा tda18271_map_layout tda18271c1_map_layout = अणु
	.मुख्य_pll          = tda18271c1_मुख्य_pll,
	.cal_pll           = tda18271c1_cal_pll,

	.rf_cal            = tda18271c1_rf_cal,
	.rf_cal_kmco       = tda18271c1_km,

	.bp_filter         = tda18271_bp_filter,
	.rf_band           = tda18271_rf_band,
	.gain_taper        = tda18271_gain_taper,
	.ir_measure        = tda18271_ir_measure,
पूर्ण;

अटल काष्ठा tda18271_map_layout tda18271c2_map_layout = अणु
	.मुख्य_pll          = tda18271c2_मुख्य_pll,
	.cal_pll           = tda18271c2_cal_pll,

	.rf_cal            = tda18271c2_rf_cal,
	.rf_cal_kmco       = tda18271c2_km,

	.rf_cal_dc_over_dt = tda18271_rf_cal_dc_over_dt,

	.bp_filter         = tda18271_bp_filter,
	.rf_band           = tda18271_rf_band,
	.gain_taper        = tda18271_gain_taper,
	.ir_measure        = tda18271_ir_measure,
पूर्ण;

पूर्णांक tda18271_assign_map_layout(काष्ठा dvb_frontend *fe)
अणु
	काष्ठा tda18271_priv *priv = fe->tuner_priv;
	पूर्णांक ret = 0;

	चयन (priv->id) अणु
	हाल TDA18271HDC1:
		priv->maps = &tda18271c1_map_layout;
		priv->std = tda18271c1_std_map;
		अवरोध;
	हाल TDA18271HDC2:
		priv->maps = &tda18271c2_map_layout;
		priv->std = tda18271c2_std_map;
		अवरोध;
	शेष:
		ret = -EINVAL;
		अवरोध;
	पूर्ण
	स_नकल(priv->rf_cal_state, &tda18271_rf_band_ढाँचा,
	       माप(tda18271_rf_band_ढाँचा));

	वापस ret;
पूर्ण
