<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित __ASM_SH_IO_NOIOPORT_H
#घोषणा __ASM_SH_IO_NOIOPORT_H

अटल अंतरभूत u8 inb(अचिन्हित दीर्घ addr)
अणु
	BUG();
	वापस -1;
पूर्ण

अटल अंतरभूत u16 inw(अचिन्हित दीर्घ addr)
अणु
	BUG();
	वापस -1;
पूर्ण

अटल अंतरभूत u32 inl(अचिन्हित दीर्घ addr)
अणु
	BUG();
	वापस -1;
पूर्ण

अटल अंतरभूत व्योम outb(अचिन्हित अक्षर x, अचिन्हित दीर्घ port)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम outw(अचिन्हित लघु x, अचिन्हित दीर्घ port)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम outl(अचिन्हित पूर्णांक x, अचिन्हित दीर्घ port)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम __iomem *ioport_map(अचिन्हित दीर्घ port, अचिन्हित पूर्णांक size)
अणु
	BUG();
	वापस शून्य;
पूर्ण

अटल अंतरभूत व्योम ioport_unmap(व्योम __iomem *addr)
अणु
	BUG();
पूर्ण

#घोषणा inb_p(addr)	inb(addr)
#घोषणा inw_p(addr)	inw(addr)
#घोषणा inl_p(addr)	inl(addr)
#घोषणा outb_p(x, addr)	outb((x), (addr))
#घोषणा outw_p(x, addr)	outw((x), (addr))
#घोषणा outl_p(x, addr)	outl((x), (addr))

अटल अंतरभूत व्योम insb(अचिन्हित दीर्घ port, व्योम *dst, अचिन्हित दीर्घ count)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम insw(अचिन्हित दीर्घ port, व्योम *dst, अचिन्हित दीर्घ count)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम insl(अचिन्हित दीर्घ port, व्योम *dst, अचिन्हित दीर्घ count)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम outsb(अचिन्हित दीर्घ port, स्थिर व्योम *src, अचिन्हित दीर्घ count)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम outsw(अचिन्हित दीर्घ port, स्थिर व्योम *src, अचिन्हित दीर्घ count)
अणु
	BUG();
पूर्ण

अटल अंतरभूत व्योम outsl(अचिन्हित दीर्घ port, स्थिर व्योम *src, अचिन्हित दीर्घ count)
अणु
	BUG();
पूर्ण

#पूर्ण_अगर /* __ASM_SH_IO_NOIOPORT_H */
