<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-only */
/*
 * (c) Copyright 2002-2010, Ralink Technology, Inc.
 * Copyright (C) 2015 Jakub Kicinski <kubakici@wp.pl>
 */

#अगर_अघोषित __MT7601U_INITVALS_H
#घोषणा __MT7601U_INITVALS_H

अटल स्थिर काष्ठा mt76_reg_pair bbp_common_vals[] = अणु
	अणु  65,	0x2c पूर्ण,
	अणु  66,	0x38 पूर्ण,
	अणु  68,	0x0b पूर्ण,
	अणु  69,	0x12 पूर्ण,
	अणु  70,	0x0a पूर्ण,
	अणु  73,	0x10 पूर्ण,
	अणु  81,	0x37 पूर्ण,
	अणु  82,	0x62 पूर्ण,
	अणु  83,	0x6a पूर्ण,
	अणु  84,	0x99 पूर्ण,
	अणु  86,	0x00 पूर्ण,
	अणु  91,	0x04 पूर्ण,
	अणु  92,	0x00 पूर्ण,
	अणु 103,	0x00 पूर्ण,
	अणु 105,	0x05 पूर्ण,
	अणु 106,	0x35 पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा mt76_reg_pair bbp_chip_vals[] = अणु
	अणु   1, 0x04 पूर्ण,	अणु   4, 0x40 पूर्ण,	अणु  20, 0x06 पूर्ण,	अणु  31, 0x08 पूर्ण,
	/* CCK Tx Control */
	अणु 178, 0xff पूर्ण,
	/* AGC/Sync controls */
	अणु  66, 0x14 पूर्ण,	अणु  68, 0x8b पूर्ण,	अणु  69, 0x12 पूर्ण,	अणु  70, 0x09 पूर्ण,
	अणु  73, 0x11 पूर्ण,	अणु  75, 0x60 पूर्ण,	अणु  76, 0x44 पूर्ण,	अणु  84, 0x9a पूर्ण,
	अणु  86, 0x38 पूर्ण,	अणु  91, 0x07 पूर्ण,	अणु  92, 0x02 पूर्ण,
	/* Rx Path Controls */
	अणु  99, 0x50 पूर्ण,	अणु 101, 0x00 पूर्ण,	अणु 103, 0xc0 पूर्ण,	अणु 104, 0x92 पूर्ण,
	अणु 105, 0x3c पूर्ण,	अणु 106, 0x03 पूर्ण,	अणु 128, 0x12 पूर्ण,
	/* Change RXWI content: Gain Report */
	अणु 142, 0x04 पूर्ण,	अणु 143, 0x37 पूर्ण,
	/* Change RXWI content: Antenna Report */
	अणु 142, 0x03 पूर्ण,	अणु 143, 0x99 पूर्ण,
	/* Calibration Index Register */
	/* CCK Receiver Control */
	अणु 160, 0xeb पूर्ण,	अणु 161, 0xc4 पूर्ण,	अणु 162, 0x77 पूर्ण,	अणु 163, 0xf9 पूर्ण,
	अणु 164, 0x88 पूर्ण,	अणु 165, 0x80 पूर्ण,	अणु 166, 0xff पूर्ण,	अणु 167, 0xe4 पूर्ण,
	/* Added AGC controls - these AGC/GLRT रेजिस्टरs are accessed
	 * through R195 and R196.
	 */
	अणु 195, 0x00 पूर्ण,	अणु 196, 0x00 पूर्ण,
	अणु 195, 0x01 पूर्ण,	अणु 196, 0x04 पूर्ण,
	अणु 195, 0x02 पूर्ण,	अणु 196, 0x20 पूर्ण,
	अणु 195, 0x03 पूर्ण,	अणु 196, 0x0a पूर्ण,
	अणु 195, 0x06 पूर्ण,	अणु 196, 0x16 पूर्ण,
	अणु 195, 0x07 पूर्ण,	अणु 196, 0x05 पूर्ण,
	अणु 195, 0x08 पूर्ण,	अणु 196, 0x37 पूर्ण,
	अणु 195, 0x0a पूर्ण,	अणु 196, 0x15 पूर्ण,
	अणु 195, 0x0b पूर्ण,	अणु 196, 0x17 पूर्ण,
	अणु 195, 0x0c पूर्ण,	अणु 196, 0x06 पूर्ण,
	अणु 195, 0x0d पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x0e पूर्ण,	अणु 196, 0x05 पूर्ण,
	अणु 195, 0x0f पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x10 पूर्ण,	अणु 196, 0x20 पूर्ण,
	अणु 195, 0x20 पूर्ण,	अणु 196, 0x17 पूर्ण,
	अणु 195, 0x21 पूर्ण,	अणु 196, 0x06 पूर्ण,
	अणु 195, 0x22 पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x23 पूर्ण,	अणु 196, 0x17 पूर्ण,
	अणु 195, 0x24 पूर्ण,	अणु 196, 0x06 पूर्ण,
	अणु 195, 0x25 पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x26 पूर्ण,	अणु 196, 0x17 पूर्ण,
	अणु 195, 0x27 पूर्ण,	अणु 196, 0x06 पूर्ण,
	अणु 195, 0x28 पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x29 पूर्ण,	अणु 196, 0x05 पूर्ण,
	अणु 195, 0x2a पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x80 पूर्ण,	अणु 196, 0x8b पूर्ण,
	अणु 195, 0x81 पूर्ण,	अणु 196, 0x12 पूर्ण,
	अणु 195, 0x82 पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x83 पूर्ण,	अणु 196, 0x17 पूर्ण,
	अणु 195, 0x84 पूर्ण,	अणु 196, 0x11 पूर्ण,
	अणु 195, 0x85 पूर्ण,	अणु 196, 0x00 पूर्ण,
	अणु 195, 0x86 पूर्ण,	अणु 196, 0x00 पूर्ण,
	अणु 195, 0x87 पूर्ण,	अणु 196, 0x18 पूर्ण,
	अणु 195, 0x88 पूर्ण,	अणु 196, 0x60 पूर्ण,
	अणु 195, 0x89 पूर्ण,	अणु 196, 0x44 पूर्ण,
	अणु 195, 0x8a पूर्ण,	अणु 196, 0x8b पूर्ण,
	अणु 195, 0x8b पूर्ण,	अणु 196, 0x8b पूर्ण,
	अणु 195, 0x8c पूर्ण,	अणु 196, 0x8b पूर्ण,
	अणु 195, 0x8d पूर्ण,	अणु 196, 0x8b पूर्ण,
	अणु 195, 0x8e पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x8f पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x90 पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x91 पूर्ण,	अणु 196, 0x09 पूर्ण,
	अणु 195, 0x92 पूर्ण,	अणु 196, 0x11 पूर्ण,
	अणु 195, 0x93 पूर्ण,	अणु 196, 0x11 पूर्ण,
	अणु 195, 0x94 पूर्ण,	अणु 196, 0x11 पूर्ण,
	अणु 195, 0x95 पूर्ण,	अणु 196, 0x11 पूर्ण,
	/* PPAD */
	अणु  47, 0x80 पूर्ण,	अणु  60, 0x80 पूर्ण,	अणु 150, 0xd2 पूर्ण,	अणु 151, 0x32 पूर्ण,
	अणु 152, 0x23 पूर्ण,	अणु 153, 0x41 पूर्ण,	अणु 154, 0x00 पूर्ण,	अणु 155, 0x4f पूर्ण,
	अणु 253, 0x7e पूर्ण,	अणु 195, 0x30 पूर्ण,	अणु 196, 0x32 पूर्ण,	अणु 195, 0x31 पूर्ण,
	अणु 196, 0x23 पूर्ण,	अणु 195, 0x32 पूर्ण,	अणु 196, 0x45 पूर्ण,	अणु 195, 0x35 पूर्ण,
	अणु 196, 0x4a पूर्ण,	अणु 195, 0x36 पूर्ण,	अणु 196, 0x5a पूर्ण,	अणु 195, 0x37 पूर्ण,
	अणु 196, 0x5a पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा mt76_reg_pair mac_common_vals[] = अणु
	अणु MT_LEGACY_BASIC_RATE,		0x0000013f पूर्ण,
	अणु MT_HT_BASIC_RATE,		0x00008003 पूर्ण,
	अणु MT_MAC_SYS_CTRL,		0x00000000 पूर्ण,
	अणु MT_RX_FILTR_CFG,		0x00017f97 पूर्ण,
	अणु MT_BKOFF_SLOT_CFG,		0x00000209 पूर्ण,
	अणु MT_TX_SW_CFG0,		0x00000000 पूर्ण,
	अणु MT_TX_SW_CFG1,		0x00080606 पूर्ण,
	अणु MT_TX_LINK_CFG,		0x00001020 पूर्ण,
	अणु MT_TX_TIMEOUT_CFG,		0x000a2090 पूर्ण,
	अणु MT_MAX_LEN_CFG,		0x00003fff पूर्ण,
	अणु MT_PBF_TX_MAX_PCNT,		0x1fbf1f1f पूर्ण,
	अणु MT_PBF_RX_MAX_PCNT,		0x0000009f पूर्ण,
	अणु MT_TX_RETRY_CFG,		0x47d01f0f पूर्ण,
	अणु MT_AUTO_RSP_CFG,		0x00000013 पूर्ण,
	अणु MT_CCK_PROT_CFG,		0x05740003 पूर्ण,
	अणु MT_OFDM_PROT_CFG,		0x05740003 पूर्ण,
	अणु MT_MM40_PROT_CFG,		0x03f44084 पूर्ण,
	अणु MT_GF20_PROT_CFG,		0x01744004 पूर्ण,
	अणु MT_GF40_PROT_CFG,		0x03f44084 पूर्ण,
	अणु MT_MM20_PROT_CFG,		0x01744004 पूर्ण,
	अणु MT_TXOP_CTRL_CFG,		0x0000583f पूर्ण,
	अणु MT_TX_RTS_CFG,		0x01092b20 पूर्ण,
	अणु MT_EXP_ACK_TIME,		0x002400ca पूर्ण,
	अणु MT_TXOP_HLDR_ET,		0x00000002 पूर्ण,
	अणु MT_XIFS_TIME_CFG,		0x33a41010 पूर्ण,
	अणु MT_PWR_PIN_CFG,		0x00000000 पूर्ण,
	अणु MT_PN_PAD_MODE,		0x00000001 पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा mt76_reg_pair mac_chip_vals[] = अणु
	अणु MT_TSO_CTRL,			0x00006050 पूर्ण,
	अणु MT_BCN_OFFSET(0),		0x18100800 पूर्ण,
	अणु MT_BCN_OFFSET(1),		0x38302820 पूर्ण,
	अणु MT_PBF_SYS_CTRL,		0x00080c00 पूर्ण,
	अणु MT_PBF_CFG,			0x7f723c1f पूर्ण,
	अणु MT_FCE_PSE_CTRL,		0x00000001 पूर्ण,
	अणु MT_PAUSE_ENABLE_CONTROL1,	0x00000000 पूर्ण,
	अणु MT_TX0_RF_GAIN_CORR,		0x003b0005 पूर्ण,
	अणु MT_TX0_RF_GAIN_ATTEN,		0x00006900 पूर्ण,
	अणु MT_TX0_BB_GAIN_ATTEN,		0x00000400 पूर्ण,
	अणु MT_TX_ALC_VGA3,		0x00060006 पूर्ण,
	अणु MT_TX_SW_CFG0,		0x00000402 पूर्ण,
	अणु MT_TX_SW_CFG1,		0x00000000 पूर्ण,
	अणु MT_TX_SW_CFG2,		0x00000000 पूर्ण,
	अणु MT_HEADER_TRANS_CTRL_REG,	0x00000000 पूर्ण,
	अणु MT_FCE_CSO,			0x0000030f पूर्ण,
	अणु MT_FCE_PARAMETERS,		0x00256f0f पूर्ण,
पूर्ण;

#पूर्ण_अगर
