<शैली गुरु>
/* SPDX-License-Identअगरier: MIT */
#अगर_अघोषित __NVBIOS_RAMCFG_H__
#घोषणा __NVBIOS_RAMCFG_H__
काष्ठा nvbios_ramcfg अणु
	अचिन्हित rammap_ver;
	अचिन्हित rammap_hdr;
	अचिन्हित rammap_min;
	अचिन्हित rammap_max;
	जोड़ अणु
		काष्ठा अणु
			अचिन्हित rammap_00_16_20:1;
			अचिन्हित rammap_00_16_40:1;
			अचिन्हित rammap_00_17_02:1;
		पूर्ण;
		काष्ठा अणु
			अचिन्हित rammap_10_04_02:1;
			अचिन्हित rammap_10_04_08:1;
		पूर्ण;
		काष्ठा अणु
			अचिन्हित rammap_11_08_01:1;
			अचिन्हित rammap_11_08_0c:2;
			अचिन्हित rammap_11_08_10:1;
			अचिन्हित rammap_11_09_01ff:9;
			अचिन्हित rammap_11_0a_03fe:9;
			अचिन्हित rammap_11_0a_0400:1;
			अचिन्हित rammap_11_0a_0800:1;
			अचिन्हित rammap_11_0b_01f0:5;
			अचिन्हित rammap_11_0b_0200:1;
			अचिन्हित rammap_11_0b_0400:1;
			अचिन्हित rammap_11_0b_0800:1;
			अचिन्हित rammap_11_0d:8;
			अचिन्हित rammap_11_0e:8;
			अचिन्हित rammap_11_0f:8;
			अचिन्हित rammap_11_11_0c:2;
		पूर्ण;
	पूर्ण;

	अचिन्हित ramcfg_ver;
	अचिन्हित ramcfg_hdr;
	अचिन्हित ramcfg_timing;
	अचिन्हित ramcfg_DLLoff;
	अचिन्हित ramcfg_RON;
	अचिन्हित ramcfg_FBVDDQ;
	जोड़ अणु
		काष्ठा अणु
			अचिन्हित ramcfg_00_03_01:1;
			अचिन्हित ramcfg_00_03_02:1;
			अचिन्हित ramcfg_00_03_08:1;
			अचिन्हित ramcfg_00_03_10:1;
			अचिन्हित ramcfg_00_04_02:1;
			अचिन्हित ramcfg_00_04_04:1;
			अचिन्हित ramcfg_00_04_20:1;
			अचिन्हित ramcfg_00_05:8;
			अचिन्हित ramcfg_00_06:8;
			अचिन्हित ramcfg_00_07:8;
			अचिन्हित ramcfg_00_08:8;
			अचिन्हित ramcfg_00_09:8;
			अचिन्हित ramcfg_00_0a_0f:4;
			अचिन्हित ramcfg_00_0a_f0:4;
		पूर्ण;
		काष्ठा अणु
			अचिन्हित ramcfg_10_02_01:1;
			अचिन्हित ramcfg_10_02_02:1;
			अचिन्हित ramcfg_10_02_04:1;
			अचिन्हित ramcfg_10_02_08:1;
			अचिन्हित ramcfg_10_02_10:1;
			अचिन्हित ramcfg_10_02_20:1;
			अचिन्हित ramcfg_10_03_0f:4;
			अचिन्हित ramcfg_10_04_01:1;
			अचिन्हित ramcfg_10_05:8;
			अचिन्हित ramcfg_10_06:8;
			अचिन्हित ramcfg_10_07:8;
			अचिन्हित ramcfg_10_08:8;
			अचिन्हित ramcfg_10_09_0f:4;
			अचिन्हित ramcfg_10_09_f0:4;
		पूर्ण;
		काष्ठा अणु
			अचिन्हित ramcfg_11_01_01:1;
			अचिन्हित ramcfg_11_01_02:1;
			अचिन्हित ramcfg_11_01_04:1;
			अचिन्हित ramcfg_11_01_08:1;
			अचिन्हित ramcfg_11_01_10:1;
			अचिन्हित ramcfg_11_01_40:1;
			अचिन्हित ramcfg_11_01_80:1;
			अचिन्हित ramcfg_11_02_03:2;
			अचिन्हित ramcfg_11_02_04:1;
			अचिन्हित ramcfg_11_02_08:1;
			अचिन्हित ramcfg_11_02_10:1;
			अचिन्हित ramcfg_11_02_40:1;
			अचिन्हित ramcfg_11_02_80:1;
			अचिन्हित ramcfg_11_03_0f:4;
			अचिन्हित ramcfg_11_03_30:2;
			अचिन्हित ramcfg_11_03_c0:2;
			अचिन्हित ramcfg_11_03_f0:4;
			अचिन्हित ramcfg_11_04:8;
			अचिन्हित ramcfg_11_06:8;
			अचिन्हित ramcfg_11_07_02:1;
			अचिन्हित ramcfg_11_07_04:1;
			अचिन्हित ramcfg_11_07_08:1;
			अचिन्हित ramcfg_11_07_10:1;
			अचिन्हित ramcfg_11_07_40:1;
			अचिन्हित ramcfg_11_07_80:1;
			अचिन्हित ramcfg_11_08_01:1;
			अचिन्हित ramcfg_11_08_02:1;
			अचिन्हित ramcfg_11_08_04:1;
			अचिन्हित ramcfg_11_08_08:1;
			अचिन्हित ramcfg_11_08_10:1;
			अचिन्हित ramcfg_11_08_20:1;
			अचिन्हित ramcfg_11_09:8;
		पूर्ण;
	पूर्ण;

	अचिन्हित timing_ver;
	अचिन्हित timing_hdr;
	अचिन्हित timing[11];
	जोड़ अणु
		काष्ठा अणु
			अचिन्हित timing_10_WR:8;
			अचिन्हित timing_10_WTR:8;
			अचिन्हित timing_10_CL:8;
			अचिन्हित timing_10_RC:8;
			/*empty: 4 */
			अचिन्हित timing_10_RFC:8;        /* Byte 5 */
			/*empty: 6 */
			अचिन्हित timing_10_RAS:8;        /* Byte 7 */
			/*empty: 8 */
			अचिन्हित timing_10_RP:8;         /* Byte 9 */
			अचिन्हित timing_10_RCDRD:8;
			अचिन्हित timing_10_RCDWR:8;
			अचिन्हित timing_10_RRD:8;
			अचिन्हित timing_10_13:8;
			अचिन्हित timing_10_ODT:3;
			/* empty: 15 */
			अचिन्हित timing_10_16:8;
			/* empty: 17 */
			अचिन्हित timing_10_18:8;
			अचिन्हित timing_10_CWL:8;
			अचिन्हित timing_10_20:8;
			अचिन्हित timing_10_21:8;
			/* empty: 22, 23 */
			अचिन्हित timing_10_24:8;
		पूर्ण;
		काष्ठा अणु
			अचिन्हित timing_20_2e_03:2;
			अचिन्हित timing_20_2e_30:2;
			अचिन्हित timing_20_2e_c0:2;
			अचिन्हित timing_20_2f_03:2;
			अचिन्हित timing_20_2c_003f:6;
			अचिन्हित timing_20_2c_1fc0:7;
			अचिन्हित timing_20_30_f8:5;
			अचिन्हित timing_20_30_07:3;
			अचिन्हित timing_20_31_0007:3;
			अचिन्हित timing_20_31_0078:4;
			अचिन्हित timing_20_31_0780:4;
			अचिन्हित timing_20_31_0800:1;
			अचिन्हित timing_20_31_7000:3;
			अचिन्हित timing_20_31_8000:1;
		पूर्ण;
	पूर्ण;
पूर्ण;

u8 nvbios_ramcfg_count(काष्ठा nvkm_bios *);
u8 nvbios_ramcfg_index(काष्ठा nvkm_subdev *);
#पूर्ण_अगर
