<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _XOR_H
#घोषणा _XOR_H

#घोषणा MAX_XOR_BLOCKS 4

बाह्य व्योम xor_blocks(अचिन्हित पूर्णांक count, अचिन्हित पूर्णांक bytes,
	व्योम *dest, व्योम **srcs);

काष्ठा xor_block_ढाँचा अणु
        काष्ठा xor_block_ढाँचा *next;
        स्थिर अक्षर *name;
        पूर्णांक speed;
	व्योम (*करो_2)(अचिन्हित दीर्घ, अचिन्हित दीर्घ *, अचिन्हित दीर्घ *);
	व्योम (*करो_3)(अचिन्हित दीर्घ, अचिन्हित दीर्घ *, अचिन्हित दीर्घ *,
		     अचिन्हित दीर्घ *);
	व्योम (*करो_4)(अचिन्हित दीर्घ, अचिन्हित दीर्घ *, अचिन्हित दीर्घ *,
		     अचिन्हित दीर्घ *, अचिन्हित दीर्घ *);
	व्योम (*करो_5)(अचिन्हित दीर्घ, अचिन्हित दीर्घ *, अचिन्हित दीर्घ *,
		     अचिन्हित दीर्घ *, अचिन्हित दीर्घ *, अचिन्हित दीर्घ *);
पूर्ण;

#पूर्ण_अगर
