<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित INT_TYPEDEFS_H
#घोषणा INT_TYPEDEFS_H

#समावेश <पूर्णांकtypes.h>

प्रकार पूर्णांक8_t s8;
प्रकार uपूर्णांक8_t u8;
प्रकार पूर्णांक16_t s16;
प्रकार uपूर्णांक16_t u16;
प्रकार पूर्णांक32_t s32;
प्रकार uपूर्णांक32_t u32;
प्रकार पूर्णांक64_t s64;
प्रकार uपूर्णांक64_t u64;

प्रकार पूर्णांक8_t __s8;
प्रकार uपूर्णांक8_t __u8;
प्रकार पूर्णांक16_t __s16;
प्रकार uपूर्णांक16_t __u16;
प्रकार पूर्णांक32_t __s32;
प्रकार uपूर्णांक32_t __u32;
प्रकार पूर्णांक64_t __s64;
प्रकार uपूर्णांक64_t __u64;

#घोषणा S8_C(x) INT8_C(x)
#घोषणा U8_C(x) UINT8_C(x)
#घोषणा S16_C(x) INT16_C(x)
#घोषणा U16_C(x) UINT16_C(x)
#घोषणा S32_C(x) INT32_C(x)
#घोषणा U32_C(x) UINT32_C(x)
#घोषणा S64_C(x) INT64_C(x)
#घोषणा U64_C(x) UINT64_C(x)

#पूर्ण_अगर
