<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित AST_DRAM_TABLES_H
#घोषणा AST_DRAM_TABLES_H

/* DRAM timing tables */
काष्ठा ast_dramकाष्ठा अणु
	u16 index;
	u32 data;
पूर्ण;

अटल स्थिर काष्ठा ast_dramकाष्ठा ast2000_dram_table_data[] = अणु
	अणु 0x0108, 0x00000000 पूर्ण,
	अणु 0x0120, 0x00004a21 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x0000, 0xFFFFFFFF पूर्ण,
	अणु 0x0004, 0x00000089 पूर्ण,
	अणु 0x0008, 0x22331353 पूर्ण,
	अणु 0x000C, 0x0d07000b पूर्ण,
	अणु 0x0010, 0x11113333 पूर्ण,
	अणु 0x0020, 0x00110350 पूर्ण,
	अणु 0x0028, 0x1e0828f0 पूर्ण,
	अणु 0x0024, 0x00000001 पूर्ण,
	अणु 0x001C, 0x00000000 पूर्ण,
	अणु 0x0014, 0x00000003 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x0018, 0x00000131 पूर्ण,
	अणु 0x0014, 0x00000001 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x0018, 0x00000031 पूर्ण,
	अणु 0x0014, 0x00000001 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x0028, 0x1e0828f1 पूर्ण,
	अणु 0x0024, 0x00000003 पूर्ण,
	अणु 0x002C, 0x1f0f28fb पूर्ण,
	अणु 0x0030, 0xFFFFFE01 पूर्ण,
	अणु 0xFFFF, 0xFFFFFFFF पूर्ण
पूर्ण;

अटल स्थिर काष्ठा ast_dramकाष्ठा ast1100_dram_table_data[] = अणु
	अणु 0x2000, 0x1688a8a8 पूर्ण,
	अणु 0x2020, 0x000041f0 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x0000, 0xfc600309 पूर्ण,
	अणु 0x006C, 0x00909090 पूर्ण,
	अणु 0x0064, 0x00050000 पूर्ण,
	अणु 0x0004, 0x00000585 पूर्ण,
	अणु 0x0008, 0x0011030f पूर्ण,
	अणु 0x0010, 0x22201724 पूर्ण,
	अणु 0x0018, 0x1e29011a पूर्ण,
	अणु 0x0020, 0x00c82222 पूर्ण,
	अणु 0x0014, 0x01001523 पूर्ण,
	अणु 0x001C, 0x1024010d पूर्ण,
	अणु 0x0024, 0x00cb2522 पूर्ण,
	अणु 0x0038, 0xffffff82 पूर्ण,
	अणु 0x003C, 0x00000000 पूर्ण,
	अणु 0x0040, 0x00000000 पूर्ण,
	अणु 0x0044, 0x00000000 पूर्ण,
	अणु 0x0048, 0x00000000 पूर्ण,
	अणु 0x004C, 0x00000000 पूर्ण,
	अणु 0x0050, 0x00000000 पूर्ण,
	अणु 0x0054, 0x00000000 पूर्ण,
	अणु 0x0058, 0x00000000 पूर्ण,
	अणु 0x005C, 0x00000000 पूर्ण,
	अणु 0x0060, 0x032aa02a पूर्ण,
	अणु 0x0064, 0x002d3000 पूर्ण,
	अणु 0x0068, 0x00000000 पूर्ण,
	अणु 0x0070, 0x00000000 पूर्ण,
	अणु 0x0074, 0x00000000 पूर्ण,
	अणु 0x0078, 0x00000000 पूर्ण,
	अणु 0x007C, 0x00000000 पूर्ण,
	अणु 0x0034, 0x00000001 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x002C, 0x00000732 पूर्ण,
	अणु 0x0030, 0x00000040 पूर्ण,
	अणु 0x0028, 0x00000005 पूर्ण,
	अणु 0x0028, 0x00000007 पूर्ण,
	अणु 0x0028, 0x00000003 पूर्ण,
	अणु 0x0028, 0x00000001 पूर्ण,
	अणु 0x000C, 0x00005a08 पूर्ण,
	अणु 0x002C, 0x00000632 पूर्ण,
	अणु 0x0028, 0x00000001 पूर्ण,
	अणु 0x0030, 0x000003c0 पूर्ण,
	अणु 0x0028, 0x00000003 पूर्ण,
	अणु 0x0030, 0x00000040 पूर्ण,
	अणु 0x0028, 0x00000003 पूर्ण,
	अणु 0x000C, 0x00005a21 पूर्ण,
	अणु 0x0034, 0x00007c03 पूर्ण,
	अणु 0x0120, 0x00004c41 पूर्ण,
	अणु 0xffff, 0xffffffff पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा ast_dramकाष्ठा ast2100_dram_table_data[] = अणु
	अणु 0x2000, 0x1688a8a8 पूर्ण,
	अणु 0x2020, 0x00004120 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x0000, 0xfc600309 पूर्ण,
	अणु 0x006C, 0x00909090 पूर्ण,
	अणु 0x0064, 0x00070000 पूर्ण,
	अणु 0x0004, 0x00000489 पूर्ण,
	अणु 0x0008, 0x0011030f पूर्ण,
	अणु 0x0010, 0x32302926 पूर्ण,
	अणु 0x0018, 0x274c0122 पूर्ण,
	अणु 0x0020, 0x00ce2222 पूर्ण,
	अणु 0x0014, 0x01001523 पूर्ण,
	अणु 0x001C, 0x1024010d पूर्ण,
	अणु 0x0024, 0x00cb2522 पूर्ण,
	अणु 0x0038, 0xffffff82 पूर्ण,
	अणु 0x003C, 0x00000000 पूर्ण,
	अणु 0x0040, 0x00000000 पूर्ण,
	अणु 0x0044, 0x00000000 पूर्ण,
	अणु 0x0048, 0x00000000 पूर्ण,
	अणु 0x004C, 0x00000000 पूर्ण,
	अणु 0x0050, 0x00000000 पूर्ण,
	अणु 0x0054, 0x00000000 पूर्ण,
	अणु 0x0058, 0x00000000 पूर्ण,
	अणु 0x005C, 0x00000000 पूर्ण,
	अणु 0x0060, 0x0f2aa02a पूर्ण,
	अणु 0x0064, 0x003f3005 पूर्ण,
	अणु 0x0068, 0x02020202 पूर्ण,
	अणु 0x0070, 0x00000000 पूर्ण,
	अणु 0x0074, 0x00000000 पूर्ण,
	अणु 0x0078, 0x00000000 पूर्ण,
	अणु 0x007C, 0x00000000 पूर्ण,
	अणु 0x0034, 0x00000001 पूर्ण,
	अणु 0xFF00, 0x00000043 पूर्ण,
	अणु 0x002C, 0x00000942 पूर्ण,
	अणु 0x0030, 0x00000040 पूर्ण,
	अणु 0x0028, 0x00000005 पूर्ण,
	अणु 0x0028, 0x00000007 पूर्ण,
	अणु 0x0028, 0x00000003 पूर्ण,
	अणु 0x0028, 0x00000001 पूर्ण,
	अणु 0x000C, 0x00005a08 पूर्ण,
	अणु 0x002C, 0x00000842 पूर्ण,
	अणु 0x0028, 0x00000001 पूर्ण,
	अणु 0x0030, 0x000003c0 पूर्ण,
	अणु 0x0028, 0x00000003 पूर्ण,
	अणु 0x0030, 0x00000040 पूर्ण,
	अणु 0x0028, 0x00000003 पूर्ण,
	अणु 0x000C, 0x00005a21 पूर्ण,
	अणु 0x0034, 0x00007c03 पूर्ण,
	अणु 0x0120, 0x00005061 पूर्ण,
	अणु 0xffff, 0xffffffff पूर्ण,
पूर्ण;

/*
 * AST2500 DRAM settings modules
 */
#घोषणा REGTBL_NUM           17
#घोषणा REGIDX_010           0
#घोषणा REGIDX_014           1
#घोषणा REGIDX_018           2
#घोषणा REGIDX_020           3
#घोषणा REGIDX_024           4
#घोषणा REGIDX_02C           5
#घोषणा REGIDX_030           6
#घोषणा REGIDX_214           7
#घोषणा REGIDX_2E0           8
#घोषणा REGIDX_2E4           9
#घोषणा REGIDX_2E8           10
#घोषणा REGIDX_2EC           11
#घोषणा REGIDX_2F0           12
#घोषणा REGIDX_2F4           13
#घोषणा REGIDX_2F8           14
#घोषणा REGIDX_RFC           15
#घोषणा REGIDX_PLL           16

अटल स्थिर u32 ast2500_ddr3_1600_timing_table[REGTBL_NUM] = अणु
	0x64604D38,		     /* 0x010 */
	0x29690599,		     /* 0x014 */
	0x00000300,		     /* 0x018 */
	0x00000000,		     /* 0x020 */
	0x00000000,		     /* 0x024 */
	0x02181E70,		     /* 0x02C */
	0x00000040,		     /* 0x030 */
	0x00000024,		     /* 0x214 */
	0x02001300,		     /* 0x2E0 */
	0x0E0000A0,		     /* 0x2E4 */
	0x000E001B,		     /* 0x2E8 */
	0x35B8C105,		     /* 0x2EC */
	0x08090408,		     /* 0x2F0 */
	0x9B000800,		     /* 0x2F4 */
	0x0E400A00,		     /* 0x2F8 */
	0x9971452F,		     /* tRFC  */
	0x000071C1		     /* PLL   */
पूर्ण;

अटल स्थिर u32 ast2500_ddr4_1600_timing_table[REGTBL_NUM] = अणु
	0x63604E37,		     /* 0x010 */
	0xE97AFA99,		     /* 0x014 */
	0x00019000,		     /* 0x018 */
	0x08000000,		     /* 0x020 */
	0x00000400,		     /* 0x024 */
	0x00000410,		     /* 0x02C */
	0x00000101,		     /* 0x030 */
	0x00000024,		     /* 0x214 */
	0x03002900,		     /* 0x2E0 */
	0x0E0000A0,		     /* 0x2E4 */
	0x000E001C,		     /* 0x2E8 */
	0x35B8C106,		     /* 0x2EC */
	0x08080607,		     /* 0x2F0 */
	0x9B000900,		     /* 0x2F4 */
	0x0E400A00,		     /* 0x2F8 */
	0x99714545,		     /* tRFC  */
	0x000071C1		     /* PLL   */
पूर्ण;

#पूर्ण_अगर
