<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-or-later */
/******************************************************************************
 *
 *	(C)Copyright 1998,1999 SysKonnect,
 *	a business unit of Schneider & Koch & Co. Datenप्रणालीe GmbH.
 *
 *	The inक्रमmation in this file is provided "AS IS" without warranty.
 *
 ******************************************************************************/

/*
 * defines क्रम all SMT attributes
 */

/*
 * this boring file was produced by perl
 * thanks Larry !
 */
#घोषणा	SMT_P0012	0x0012

#घोषणा	SMT_P0015	0x0015
#घोषणा	SMT_P0016	0x0016
#घोषणा	SMT_P0017	0x0017
#घोषणा	SMT_P0018	0x0018
#घोषणा	SMT_P0019	0x0019

#घोषणा	SMT_P001A	0x001a
#घोषणा	SMT_P001B	0x001b
#घोषणा	SMT_P001C	0x001c
#घोषणा	SMT_P001D	0x001d

#घोषणा	SMT_P100A	0x100a
#घोषणा	SMT_P100B	0x100b
#घोषणा	SMT_P100C	0x100c
#घोषणा	SMT_P100D	0x100d
#घोषणा	SMT_P100E	0x100e
#घोषणा	SMT_P100F	0x100f
#घोषणा	SMT_P1010	0x1010
#घोषणा	SMT_P1011	0x1011
#घोषणा	SMT_P1012	0x1012
#घोषणा	SMT_P1013	0x1013
#घोषणा	SMT_P1014	0x1014
#घोषणा	SMT_P1015	0x1015
#घोषणा	SMT_P1016	0x1016
#घोषणा	SMT_P1017	0x1017
#घोषणा	SMT_P1018	0x1018
#घोषणा	SMT_P1019	0x1019
#घोषणा	SMT_P101A	0x101a
#घोषणा	SMT_P101B	0x101b
#घोषणा	SMT_P101C	0x101c
#घोषणा	SMT_P101D	0x101d
#घोषणा	SMT_P101E	0x101e
#घोषणा	SMT_P101F	0x101f
#घोषणा	SMT_P1020	0x1020
#घोषणा	SMT_P1021	0x1021
#घोषणा	SMT_P1022	0x1022
#घोषणा	SMT_P1023	0x1023
#घोषणा	SMT_P1024	0x1024
#घोषणा	SMT_P1025	0x1025
#घोषणा	SMT_P1026	0x1026
#घोषणा	SMT_P1027	0x1027
#घोषणा	SMT_P1028	0x1028
#घोषणा	SMT_P1029	0x1029
#घोषणा	SMT_P102A	0x102a
#घोषणा	SMT_P102B	0x102b
#घोषणा	SMT_P102C	0x102c
#घोषणा	SMT_P102D	0x102d
#घोषणा	SMT_P102E	0x102e
#घोषणा	SMT_P102F	0x102f
#घोषणा	SMT_P1030	0x1030
#घोषणा	SMT_P1031	0x1031
#घोषणा	SMT_P1032	0x1032
#घोषणा	SMT_P1033	0x1033
#घोषणा	SMT_P1034	0x1034
#घोषणा	SMT_P1035	0x1035
#घोषणा	SMT_P1036	0x1036
#घोषणा	SMT_P1037	0x1037
#घोषणा	SMT_P1038	0x1038
#घोषणा	SMT_P1039	0x1039
#घोषणा	SMT_P103A	0x103a
#घोषणा	SMT_P103B	0x103b
#घोषणा	SMT_P103C	0x103c
#घोषणा	SMT_P103D	0x103d
#घोषणा	SMT_P103E	0x103e
#घोषणा	SMT_P103F	0x103f
#घोषणा	SMT_P1040	0x1040
#घोषणा	SMT_P1041	0x1041
#घोषणा	SMT_P1042	0x1042
#घोषणा	SMT_P1043	0x1043
#घोषणा	SMT_P1044	0x1044
#घोषणा	SMT_P1045	0x1045
#घोषणा	SMT_P1046	0x1046
#घोषणा	SMT_P1047	0x1047
#घोषणा	SMT_P1048	0x1048
#घोषणा	SMT_P1049	0x1049
#घोषणा	SMT_P104A	0x104a
#घोषणा	SMT_P104B	0x104b
#घोषणा	SMT_P104C	0x104c
#घोषणा	SMT_P104D	0x104d
#घोषणा	SMT_P104E	0x104e
#घोषणा	SMT_P104F	0x104f
#घोषणा	SMT_P1050	0x1050
#घोषणा	SMT_P1051	0x1051
#घोषणा	SMT_P1052	0x1052
#घोषणा	SMT_P1053	0x1053
#घोषणा	SMT_P1054	0x1054

#घोषणा	SMT_P10F0	0x10f0
#घोषणा	SMT_P10F1	0x10f1
#अगर_घोषित	ESS
#घोषणा	SMT_P10F2	0x10f2
#घोषणा	SMT_P10F3	0x10f3
#घोषणा	SMT_P10F4	0x10f4
#घोषणा	SMT_P10F5	0x10f5
#घोषणा	SMT_P10F6	0x10f6
#घोषणा	SMT_P10F7	0x10f7
#पूर्ण_अगर
#अगर_घोषित	SBA
#घोषणा	SMT_P10F8	0x10f8
#घोषणा	SMT_P10F9	0x10f9
#पूर्ण_अगर

#घोषणा	SMT_P200A	0x200a
#घोषणा	SMT_P200B	0x200b
#घोषणा	SMT_P200C	0x200c
#घोषणा	SMT_P200D	0x200d
#घोषणा	SMT_P200E	0x200e
#घोषणा	SMT_P200F	0x200f
#घोषणा	SMT_P2010	0x2010
#घोषणा	SMT_P2011	0x2011
#घोषणा	SMT_P2012	0x2012
#घोषणा	SMT_P2013	0x2013
#घोषणा	SMT_P2014	0x2014
#घोषणा	SMT_P2015	0x2015
#घोषणा	SMT_P2016	0x2016
#घोषणा	SMT_P2017	0x2017
#घोषणा	SMT_P2018	0x2018
#घोषणा	SMT_P2019	0x2019
#घोषणा	SMT_P201A	0x201a
#घोषणा	SMT_P201B	0x201b
#घोषणा	SMT_P201C	0x201c
#घोषणा	SMT_P201D	0x201d
#घोषणा	SMT_P201E	0x201e
#घोषणा	SMT_P201F	0x201f
#घोषणा	SMT_P2020	0x2020
#घोषणा	SMT_P2021	0x2021
#घोषणा	SMT_P2022	0x2022
#घोषणा	SMT_P2023	0x2023
#घोषणा	SMT_P2024	0x2024
#घोषणा	SMT_P2025	0x2025
#घोषणा	SMT_P2026	0x2026
#घोषणा	SMT_P2027	0x2027
#घोषणा	SMT_P2028	0x2028
#घोषणा	SMT_P2029	0x2029
#घोषणा	SMT_P202A	0x202a
#घोषणा	SMT_P202B	0x202b
#घोषणा	SMT_P202C	0x202c
#घोषणा	SMT_P202D	0x202d
#घोषणा	SMT_P202E	0x202e
#घोषणा	SMT_P202F	0x202f
#घोषणा	SMT_P2030	0x2030
#घोषणा	SMT_P2031	0x2031
#घोषणा	SMT_P2032	0x2032
#घोषणा	SMT_P2033	0x2033
#घोषणा	SMT_P2034	0x2034
#घोषणा	SMT_P2035	0x2035
#घोषणा	SMT_P2036	0x2036
#घोषणा	SMT_P2037	0x2037
#घोषणा	SMT_P2038	0x2038
#घोषणा	SMT_P2039	0x2039
#घोषणा	SMT_P203A	0x203a
#घोषणा	SMT_P203B	0x203b
#घोषणा	SMT_P203C	0x203c
#घोषणा	SMT_P203D	0x203d
#घोषणा	SMT_P203E	0x203e
#घोषणा	SMT_P203F	0x203f
#घोषणा	SMT_P2040	0x2040
#घोषणा	SMT_P2041	0x2041
#घोषणा	SMT_P2042	0x2042
#घोषणा	SMT_P2043	0x2043
#घोषणा	SMT_P2044	0x2044
#घोषणा	SMT_P2045	0x2045
#घोषणा	SMT_P2046	0x2046
#घोषणा	SMT_P2047	0x2047
#घोषणा	SMT_P2048	0x2048
#घोषणा	SMT_P2049	0x2049
#घोषणा	SMT_P204A	0x204a
#घोषणा	SMT_P204B	0x204b
#घोषणा	SMT_P204C	0x204c
#घोषणा	SMT_P204D	0x204d
#घोषणा	SMT_P204E	0x204e
#घोषणा	SMT_P204F	0x204f
#घोषणा	SMT_P2050	0x2050
#घोषणा	SMT_P2051	0x2051
#घोषणा	SMT_P2052	0x2052
#घोषणा	SMT_P2053	0x2053
#घोषणा	SMT_P2054	0x2054
#घोषणा	SMT_P2055	0x2055
#घोषणा	SMT_P2056	0x2056
#घोषणा	SMT_P2057	0x2057
#घोषणा	SMT_P2058	0x2058
#घोषणा	SMT_P2059	0x2059
#घोषणा	SMT_P205A	0x205a
#घोषणा	SMT_P205B	0x205b
#घोषणा	SMT_P205C	0x205c
#घोषणा	SMT_P205D	0x205d
#घोषणा	SMT_P205E	0x205e
#घोषणा	SMT_P205F	0x205f
#घोषणा	SMT_P2060	0x2060
#घोषणा	SMT_P2061	0x2061
#घोषणा	SMT_P2062	0x2062
#घोषणा	SMT_P2063	0x2063
#घोषणा	SMT_P2064	0x2064
#घोषणा	SMT_P2065	0x2065
#घोषणा	SMT_P2066	0x2066
#घोषणा	SMT_P2067	0x2067
#घोषणा	SMT_P2068	0x2068
#घोषणा	SMT_P2069	0x2069
#घोषणा	SMT_P206A	0x206a
#घोषणा	SMT_P206B	0x206b
#घोषणा	SMT_P206C	0x206c
#घोषणा	SMT_P206D	0x206d
#घोषणा	SMT_P206E	0x206e
#घोषणा	SMT_P206F	0x206f
#घोषणा	SMT_P2070	0x2070
#घोषणा	SMT_P2071	0x2071
#घोषणा	SMT_P2072	0x2072
#घोषणा	SMT_P2073	0x2073
#घोषणा	SMT_P2074	0x2074
#घोषणा	SMT_P2075	0x2075
#घोषणा	SMT_P2076	0x2076

#घोषणा	SMT_P208C	0x208c
#घोषणा	SMT_P208D	0x208d
#घोषणा	SMT_P208E	0x208e
#घोषणा	SMT_P208F	0x208f
#घोषणा	SMT_P2090	0x2090

#घोषणा	SMT_P20F0	0x20F0
#घोषणा	SMT_P20F1	0x20F1

#घोषणा	SMT_P320A	0x320a
#घोषणा	SMT_P320B	0x320b
#घोषणा	SMT_P320C	0x320c
#घोषणा	SMT_P320D	0x320d
#घोषणा	SMT_P320E	0x320e
#घोषणा	SMT_P320F	0x320f
#घोषणा	SMT_P3210	0x3210
#घोषणा	SMT_P3211	0x3211
#घोषणा	SMT_P3212	0x3212
#घोषणा	SMT_P3213	0x3213
#घोषणा	SMT_P3214	0x3214
#घोषणा	SMT_P3215	0x3215
#घोषणा	SMT_P3216	0x3216
#घोषणा	SMT_P3217	0x3217

#घोषणा	SMT_P400A	0x400a
#घोषणा	SMT_P400B	0x400b
#घोषणा	SMT_P400C	0x400c
#घोषणा	SMT_P400D	0x400d
#घोषणा	SMT_P400E	0x400e
#घोषणा	SMT_P400F	0x400f
#घोषणा	SMT_P4010	0x4010
#घोषणा	SMT_P4011	0x4011
#घोषणा	SMT_P4012	0x4012
#घोषणा	SMT_P4013	0x4013
#घोषणा	SMT_P4014	0x4014
#घोषणा	SMT_P4015	0x4015
#घोषणा	SMT_P4016	0x4016
#घोषणा	SMT_P4017	0x4017
#घोषणा	SMT_P4018	0x4018
#घोषणा	SMT_P4019	0x4019
#घोषणा	SMT_P401A	0x401a
#घोषणा	SMT_P401B	0x401b
#घोषणा	SMT_P401C	0x401c
#घोषणा	SMT_P401D	0x401d
#घोषणा	SMT_P401E	0x401e
#घोषणा	SMT_P401F	0x401f
#घोषणा	SMT_P4020	0x4020
#घोषणा	SMT_P4021	0x4021
#घोषणा	SMT_P4022	0x4022
#घोषणा	SMT_P4023	0x4023
#घोषणा	SMT_P4024	0x4024
#घोषणा	SMT_P4025	0x4025
#घोषणा	SMT_P4026	0x4026
#घोषणा	SMT_P4027	0x4027
#घोषणा	SMT_P4028	0x4028
#घोषणा	SMT_P4029	0x4029
#घोषणा	SMT_P402A	0x402a
#घोषणा	SMT_P402B	0x402b
#घोषणा	SMT_P402C	0x402c
#घोषणा	SMT_P402D	0x402d
#घोषणा	SMT_P402E	0x402e
#घोषणा	SMT_P402F	0x402f
#घोषणा	SMT_P4030	0x4030
#घोषणा	SMT_P4031	0x4031
#घोषणा	SMT_P4032	0x4032
#घोषणा	SMT_P4033	0x4033
#घोषणा	SMT_P4034	0x4034
#घोषणा	SMT_P4035	0x4035
#घोषणा	SMT_P4036	0x4036
#घोषणा	SMT_P4037	0x4037
#घोषणा	SMT_P4038	0x4038
#घोषणा	SMT_P4039	0x4039
#घोषणा	SMT_P403A	0x403a
#घोषणा	SMT_P403B	0x403b
#घोषणा	SMT_P403C	0x403c
#घोषणा	SMT_P403D	0x403d
#घोषणा	SMT_P403E	0x403e
#घोषणा	SMT_P403F	0x403f
#घोषणा	SMT_P4040	0x4040
#घोषणा	SMT_P4041	0x4041
#घोषणा	SMT_P4042	0x4042
#घोषणा	SMT_P4043	0x4043
#घोषणा	SMT_P4044	0x4044
#घोषणा	SMT_P4045	0x4045
#घोषणा	SMT_P4046	0x4046

#घोषणा	SMT_P4050	0x4050
#घोषणा	SMT_P4051	0x4051
#घोषणा	SMT_P4052	0x4052
#घोषणा	SMT_P4053	0x4053
