<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */

#अगर_अघोषित __ABI_CSKY_PTRACE_H
#घोषणा __ABI_CSKY_PTRACE_H

काष्ठा चयन_stack अणु
#अगर_घोषित CONFIG_CPU_HAS_HILO
	अचिन्हित दीर्घ rhi;
	अचिन्हित दीर्घ rlo;
	अचिन्हित दीर्घ cr14;
	अचिन्हित दीर्घ pad;
#पूर्ण_अगर
	अचिन्हित दीर्घ r4;
	अचिन्हित दीर्घ r5;
	अचिन्हित दीर्घ r6;
	अचिन्हित दीर्घ r7;
	अचिन्हित दीर्घ r8;
	अचिन्हित दीर्घ r9;
	अचिन्हित दीर्घ r10;
	अचिन्हित दीर्घ r11;

	अचिन्हित दीर्घ r15;
	अचिन्हित दीर्घ r16;
	अचिन्हित दीर्घ r17;
	अचिन्हित दीर्घ r26;
	अचिन्हित दीर्घ r27;
	अचिन्हित दीर्घ r28;
	अचिन्हित दीर्घ r29;
	अचिन्हित दीर्घ r30;
पूर्ण;
#पूर्ण_अगर /* __ABI_CSKY_PTRACE_H */
