<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0-or-later
/*
 * upहाल.c - Generate the full NTFS Unicode upहाल table in little endian.
 *	      Part of the Linux-NTFS project.
 *
 * Copyright (c) 2001 Riअक्षरd Russon <ntfs@flatcap.org>
 * Copyright (c) 2001-2006 Anton Altaparmakov
 */

#समावेश "malloc.h"
#समावेश "ntfs.h"

ntfsअक्षर *generate_शेष_upहाल(व्योम)
अणु
	अटल स्थिर पूर्णांक uc_run_table[][3] = अणु /* Start, End, Add */
	अणु0x0061, 0x007B,  -32पूर्ण, अणु0x0451, 0x045D, -80पूर्ण, अणु0x1F70, 0x1F72,  74पूर्ण,
	अणु0x00E0, 0x00F7,  -32पूर्ण, अणु0x045E, 0x0460, -80पूर्ण, अणु0x1F72, 0x1F76,  86पूर्ण,
	अणु0x00F8, 0x00FF,  -32पूर्ण, अणु0x0561, 0x0587, -48पूर्ण, अणु0x1F76, 0x1F78, 100पूर्ण,
	अणु0x0256, 0x0258, -205पूर्ण, अणु0x1F00, 0x1F08,   8पूर्ण, अणु0x1F78, 0x1F7A, 128पूर्ण,
	अणु0x028A, 0x028C, -217पूर्ण, अणु0x1F10, 0x1F16,   8पूर्ण, अणु0x1F7A, 0x1F7C, 112पूर्ण,
	अणु0x03AC, 0x03AD,  -38पूर्ण, अणु0x1F20, 0x1F28,   8पूर्ण, अणु0x1F7C, 0x1F7E, 126पूर्ण,
	अणु0x03AD, 0x03B0,  -37पूर्ण, अणु0x1F30, 0x1F38,   8पूर्ण, अणु0x1FB0, 0x1FB2,   8पूर्ण,
	अणु0x03B1, 0x03C2,  -32पूर्ण, अणु0x1F40, 0x1F46,   8पूर्ण, अणु0x1FD0, 0x1FD2,   8पूर्ण,
	अणु0x03C2, 0x03C3,  -31पूर्ण, अणु0x1F51, 0x1F52,   8पूर्ण, अणु0x1FE0, 0x1FE2,   8पूर्ण,
	अणु0x03C3, 0x03CC,  -32पूर्ण, अणु0x1F53, 0x1F54,   8पूर्ण, अणु0x1FE5, 0x1FE6,   7पूर्ण,
	अणु0x03CC, 0x03CD,  -64पूर्ण, अणु0x1F55, 0x1F56,   8पूर्ण, अणु0x2170, 0x2180, -16पूर्ण,
	अणु0x03CD, 0x03CF,  -63पूर्ण, अणु0x1F57, 0x1F58,   8पूर्ण, अणु0x24D0, 0x24EA, -26पूर्ण,
	अणु0x0430, 0x0450,  -32पूर्ण, अणु0x1F60, 0x1F68,   8पूर्ण, अणु0xFF41, 0xFF5B, -32पूर्ण,
	अणु0पूर्ण
	पूर्ण;

	अटल स्थिर पूर्णांक uc_dup_table[][2] = अणु /* Start, End */
	अणु0x0100, 0x012Fपूर्ण, अणु0x01A0, 0x01A6पूर्ण, अणु0x03E2, 0x03EFपूर्ण, अणु0x04CB, 0x04CCपूर्ण,
	अणु0x0132, 0x0137पूर्ण, अणु0x01B3, 0x01B7पूर्ण, अणु0x0460, 0x0481पूर्ण, अणु0x04D0, 0x04EBपूर्ण,
	अणु0x0139, 0x0149पूर्ण, अणु0x01CD, 0x01DDपूर्ण, अणु0x0490, 0x04BFपूर्ण, अणु0x04EE, 0x04F5पूर्ण,
	अणु0x014A, 0x0178पूर्ण, अणु0x01DE, 0x01EFपूर्ण, अणु0x04BF, 0x04BFपूर्ण, अणु0x04F8, 0x04F9पूर्ण,
	अणु0x0179, 0x017Eपूर्ण, अणु0x01F4, 0x01F5पूर्ण, अणु0x04C1, 0x04C4पूर्ण, अणु0x1E00, 0x1E95पूर्ण,
	अणु0x018B, 0x018Bपूर्ण, अणु0x01FA, 0x0218पूर्ण, अणु0x04C7, 0x04C8पूर्ण, अणु0x1EA0, 0x1EF9पूर्ण,
	अणु0पूर्ण
	पूर्ण;

	अटल स्थिर पूर्णांक uc_word_table[][2] = अणु /* Offset, Value */
	अणु0x00FF, 0x0178पूर्ण, अणु0x01AD, 0x01ACपूर्ण, अणु0x01F3, 0x01F1पूर्ण, अणु0x0269, 0x0196पूर्ण,
	अणु0x0183, 0x0182पूर्ण, अणु0x01B0, 0x01AFपूर्ण, अणु0x0253, 0x0181पूर्ण, अणु0x026F, 0x019Cपूर्ण,
	अणु0x0185, 0x0184पूर्ण, अणु0x01B9, 0x01B8पूर्ण, अणु0x0254, 0x0186पूर्ण, अणु0x0272, 0x019Dपूर्ण,
	अणु0x0188, 0x0187पूर्ण, अणु0x01BD, 0x01BCपूर्ण, अणु0x0259, 0x018Fपूर्ण, अणु0x0275, 0x019Fपूर्ण,
	अणु0x018C, 0x018Bपूर्ण, अणु0x01C6, 0x01C4पूर्ण, अणु0x025B, 0x0190पूर्ण, अणु0x0283, 0x01A9पूर्ण,
	अणु0x0192, 0x0191पूर्ण, अणु0x01C9, 0x01C7पूर्ण, अणु0x0260, 0x0193पूर्ण, अणु0x0288, 0x01AEपूर्ण,
	अणु0x0199, 0x0198पूर्ण, अणु0x01CC, 0x01CAपूर्ण, अणु0x0263, 0x0194पूर्ण, अणु0x0292, 0x01B7पूर्ण,
	अणु0x01A8, 0x01A7पूर्ण, अणु0x01DD, 0x018Eपूर्ण, अणु0x0268, 0x0197पूर्ण,
	अणु0पूर्ण
	पूर्ण;

	पूर्णांक i, r;
	ntfsअक्षर *uc;

	uc = ntfs_दो_स्मृति_nofs(शेष_upहाल_len * माप(ntfsअक्षर));
	अगर (!uc)
		वापस uc;
	स_रखो(uc, 0, शेष_upहाल_len * माप(ntfsअक्षर));
	/* Generate the little endian Unicode upहाल table used by ntfs. */
	क्रम (i = 0; i < शेष_upहाल_len; i++)
		uc[i] = cpu_to_le16(i);
	क्रम (r = 0; uc_run_table[r][0]; r++)
		क्रम (i = uc_run_table[r][0]; i < uc_run_table[r][1]; i++)
			le16_add_cpu(&uc[i], uc_run_table[r][2]);
	क्रम (r = 0; uc_dup_table[r][0]; r++)
		क्रम (i = uc_dup_table[r][0]; i < uc_dup_table[r][1]; i += 2)
			le16_add_cpu(&uc[i + 1], -1);
	क्रम (r = 0; uc_word_table[r][0]; r++)
		uc[uc_word_table[r][0]] = cpu_to_le16(uc_word_table[r][1]);
	वापस uc;
पूर्ण
