<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-only */
/*
 * include/linux/sizes.h
 */
#अगर_अघोषित __LINUX_SIZES_H__
#घोषणा __LINUX_SIZES_H__

#समावेश <linux/स्थिर.h>

#घोषणा SZ_1				0x00000001
#घोषणा SZ_2				0x00000002
#घोषणा SZ_4				0x00000004
#घोषणा SZ_8				0x00000008
#घोषणा SZ_16				0x00000010
#घोषणा SZ_32				0x00000020
#घोषणा SZ_64				0x00000040
#घोषणा SZ_128				0x00000080
#घोषणा SZ_256				0x00000100
#घोषणा SZ_512				0x00000200

#घोषणा SZ_1K				0x00000400
#घोषणा SZ_2K				0x00000800
#घोषणा SZ_4K				0x00001000
#घोषणा SZ_8K				0x00002000
#घोषणा SZ_16K				0x00004000
#घोषणा SZ_32K				0x00008000
#घोषणा SZ_64K				0x00010000
#घोषणा SZ_128K				0x00020000
#घोषणा SZ_256K				0x00040000
#घोषणा SZ_512K				0x00080000

#घोषणा SZ_1M				0x00100000
#घोषणा SZ_2M				0x00200000
#घोषणा SZ_4M				0x00400000
#घोषणा SZ_8M				0x00800000
#घोषणा SZ_16M				0x01000000
#घोषणा SZ_32M				0x02000000
#घोषणा SZ_64M				0x04000000
#घोषणा SZ_128M				0x08000000
#घोषणा SZ_256M				0x10000000
#घोषणा SZ_512M				0x20000000

#घोषणा SZ_1G				0x40000000
#घोषणा SZ_2G				0x80000000

#घोषणा SZ_4G				_AC(0x100000000, ULL)
#घोषणा SZ_8G				_AC(0x200000000, ULL)
#घोषणा SZ_16G				_AC(0x400000000, ULL)
#घोषणा SZ_32G				_AC(0x800000000, ULL)
#घोषणा SZ_64T				_AC(0x400000000000, ULL)

#पूर्ण_अगर /* __LINUX_SIZES_H__ */
