<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _M68K_DIV64_H
#घोषणा _M68K_DIV64_H

#अगर_घोषित CONFIG_CPU_HAS_NO_MULDIV64
#समावेश <यंत्र-generic/भाग64.h>
#अन्यथा

#समावेश <linux/types.h>

/* n = n / base; वापस rem; */

#घोषणा करो_भाग(n, base) (अणु					\
	जोड़ अणु							\
		अचिन्हित दीर्घ n32[2];				\
		अचिन्हित दीर्घ दीर्घ n64;				\
	पूर्ण __n;							\
	अचिन्हित दीर्घ __rem, __upper;				\
	अचिन्हित दीर्घ __base = (base);				\
								\
	__n.n64 = (n);						\
	अगर ((__upper = __n.n32[0])) अणु				\
		यंत्र ("divul.l %2,%1:%0"				\
		     : "=d" (__n.n32[0]), "=d" (__upper)	\
		     : "d" (__base), "0" (__n.n32[0]));		\
	पूर्ण							\
	यंत्र ("divu.l %2,%1:%0"					\
	     : "=d" (__n.n32[1]), "=d" (__rem)			\
	     : "d" (__base), "1" (__upper), "0" (__n.n32[1]));	\
	(n) = __n.n64;						\
	__rem;							\
पूर्ण)

#पूर्ण_अगर /* CONFIG_CPU_HAS_NO_MULDIV64 */

#पूर्ण_अगर /* _M68K_DIV64_H */
