<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
   /* SQCIF */
   अणु
      अणु0, 0, अणु0x04, 0x01, 0x03पूर्णपूर्ण,
      अणु8, 0, अणु0x05, 0x01, 0x03पूर्णपूर्ण,
      अणु7, 0, अणु0x08, 0x01, 0x03पूर्णपूर्ण,
      अणु7, 0, अणु0x0A, 0x01, 0x03पूर्णपूर्ण,
      अणु6, 0, अणु0x0C, 0x01, 0x03पूर्णपूर्ण,
      अणु5, 0, अणु0x0F, 0x01, 0x03पूर्णपूर्ण,
      अणु4, 0, अणु0x14, 0x01, 0x03पूर्णपूर्ण,
      अणु3, 0, अणु0x18, 0x01, 0x03पूर्णपूर्ण,
   पूर्ण,
   /* QSIF */
   अणु
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
   पूर्ण,
   /* QCIF */
   अणु
      अणु0, 0, अणु0x04, 0x01, 0x02पूर्णपूर्ण,
      अणु8, 0, अणु0x05, 0x01, 0x02पूर्णपूर्ण,
      अणु7, 0, अणु0x08, 0x01, 0x02पूर्णपूर्ण,
      अणु6, 0, अणु0x0A, 0x01, 0x02पूर्णपूर्ण,
      अणु5, 0, अणु0x0C, 0x01, 0x02पूर्णपूर्ण,
      अणु4, 0, अणु0x0F, 0x01, 0x02पूर्णपूर्ण,
      अणु1, 0, अणु0x14, 0x01, 0x02पूर्णपूर्ण,
      अणु1, 0, अणु0x18, 0x01, 0x02पूर्णपूर्ण,
   पूर्ण,
   /* SIF */
   अणु
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
   पूर्ण,
   /* CIF */
   अणु
      अणु4, 0, अणु0x04, 0x01, 0x01पूर्णपूर्ण,
      अणु7, 1, अणु0x05, 0x03, 0x01पूर्णपूर्ण,
      अणु6, 1, अणु0x08, 0x03, 0x01पूर्णपूर्ण,
      अणु4, 1, अणु0x0A, 0x03, 0x01पूर्णपूर्ण,
      अणु3, 1, अणु0x0C, 0x03, 0x01पूर्णपूर्ण,
      अणु2, 1, अणु0x0F, 0x03, 0x01पूर्णपूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
   पूर्ण,
   /* VGA */
   अणु
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
      अणु0पूर्ण,
   पूर्ण,
