<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
/*
 * Support क्रम OmniVision OV2680 5M camera sensor.
 *
 * Copyright (c) 2013 Intel Corporation. All Rights Reserved.
 *
 * This program is मुक्त software; you can redistribute it and/or
 * modअगरy it under the terms of the GNU General Public License version
 * 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License क्रम more details.
 *
 *
 */

#अगर_अघोषित __OV2680_H__
#घोषणा __OV2680_H__
#समावेश <linux/kernel.h>
#समावेश <linux/types.h>
#समावेश <linux/i2c.h>
#समावेश <linux/delay.h>
#समावेश <linux/videodev2.h>
#समावेश <linux/spinlock.h>
#समावेश <media/v4l2-subdev.h>
#समावेश <media/v4l2-device.h>
#समावेश <media/v4l2-ctrls.h>
#समावेश <linux/v4l2-mediabus.h>
#समावेश <media/media-entity.h>

#समावेश "../include/linux/atomisp_platform.h"

/* Defines क्रम रेजिस्टर ग_लिखोs and रेजिस्टर array processing */
#घोषणा I2C_MSG_LENGTH		0x2
#घोषणा I2C_RETRY_COUNT		5

#घोषणा OV2680_FOCAL_LENGTH_NUM	334	/*3.34mm*/
#घोषणा OV2680_FOCAL_LENGTH_DEM	100
#घोषणा OV2680_F_NUMBER_DEFAULT_NUM	24
#घोषणा OV2680_F_NUMBER_DEM	10

#घोषणा OV2680_BIN_FACTOR_MAX 4

#घोषणा MAX_FMTS		1

/* sensor_mode_data पढ़ो_mode adaptation */
#घोषणा OV2680_READ_MODE_BINNING_ON	0x0400
#घोषणा OV2680_READ_MODE_BINNING_OFF	0x00
#घोषणा OV2680_INTEGRATION_TIME_MARGIN	8

#घोषणा OV2680_MAX_EXPOSURE_VALUE	0xFFF1
#घोषणा OV2680_MAX_GAIN_VALUE		0xFF

/*
 * focal length bits definition:
 * bits 31-16: numerator, bits 15-0: denominator
 */
#घोषणा OV2680_FOCAL_LENGTH_DEFAULT 0x1B70064

/*
 * current f-number bits definition:
 * bits 31-16: numerator, bits 15-0: denominator
 */
#घोषणा OV2680_F_NUMBER_DEFAULT 0x18000a

/*
 * f-number range bits definition:
 * bits 31-24: max f-number numerator
 * bits 23-16: max f-number denominator
 * bits 15-8: min f-number numerator
 * bits 7-0: min f-number denominator
 */
#घोषणा OV2680_F_NUMBER_RANGE 0x180a180a
#घोषणा OV2680_ID	0x2680

#घोषणा OV2680_FINE_INTG_TIME_MIN 0
#घोषणा OV2680_FINE_INTG_TIME_MAX_MARGIN 0
#घोषणा OV2680_COARSE_INTG_TIME_MIN 1
#घोषणा OV2680_COARSE_INTG_TIME_MAX_MARGIN 6

/*
 * OV2680 System control रेजिस्टरs
 */
#घोषणा OV2680_SW_SLEEP				0x0100
#घोषणा OV2680_SW_RESET				0x0103
#घोषणा OV2680_SW_STREAM			0x0100

#घोषणा OV2680_SC_CMMN_CHIP_ID_H		0x300A
#घोषणा OV2680_SC_CMMN_CHIP_ID_L		0x300B
#घोषणा OV2680_SC_CMMN_SCCB_ID			0x302B /* 0x300C*/
#घोषणा OV2680_SC_CMMN_SUB_ID			0x302A /* process, version*/

#घोषणा OV2680_GROUP_ACCESS							0x3208 /*Bit[7:4] Group control, Bit[3:0] Group ID*/

#घोषणा OV2680_EXPOSURE_H							0x3500 /*Bit[3:0] Bit[19:16] of exposure, reमुख्यing 16 bits lies in Reg0x3501&Reg0x3502*/
#घोषणा OV2680_EXPOSURE_M							0x3501
#घोषणा OV2680_EXPOSURE_L							0x3502
#घोषणा OV2680_AGC_H								0x350A /*Bit[1:0] means Bit[9:8] of gain*/
#घोषणा OV2680_AGC_L								0x350B /*Bit[7:0] of gain*/

#घोषणा OV2680_HORIZONTAL_START_H					0x3800 /*Bit[11:8]*/
#घोषणा OV2680_HORIZONTAL_START_L					0x3801 /*Bit[7:0]*/
#घोषणा OV2680_VERTICAL_START_H						0x3802 /*Bit[11:8]*/
#घोषणा OV2680_VERTICAL_START_L						0x3803 /*Bit[7:0]*/
#घोषणा OV2680_HORIZONTAL_END_H						0x3804 /*Bit[11:8]*/
#घोषणा OV2680_HORIZONTAL_END_L						0x3805 /*Bit[7:0]*/
#घोषणा OV2680_VERTICAL_END_H						0x3806 /*Bit[11:8]*/
#घोषणा OV2680_VERTICAL_END_L						0x3807 /*Bit[7:0]*/
#घोषणा OV2680_HORIZONTAL_OUTPUT_SIZE_H				0x3808 /*Bit[3:0]*/
#घोषणा OV2680_HORIZONTAL_OUTPUT_SIZE_L				0x3809 /*Bit[7:0]*/
#घोषणा OV2680_VERTICAL_OUTPUT_SIZE_H				0x380a /*Bit[3:0]*/
#घोषणा OV2680_VERTICAL_OUTPUT_SIZE_L				0x380b /*Bit[7:0]*/
#घोषणा OV2680_TIMING_HTS_H							0x380C  /*High 8-bit, and low 8-bit HTS address is 0x380d*/
#घोषणा OV2680_TIMING_HTS_L							0x380D  /*High 8-bit, and low 8-bit HTS address is 0x380d*/
#घोषणा OV2680_TIMING_VTS_H							0x380e  /*High 8-bit, and low 8-bit HTS address is 0x380f*/
#घोषणा OV2680_TIMING_VTS_L							0x380f  /*High 8-bit, and low 8-bit HTS address is 0x380f*/
#घोषणा OV2680_FRAME_OFF_NUM						0x4202

/*Flip/Mirror*/
#घोषणा OV2680_FLIP_REG				0x3820
#घोषणा OV2680_MIRROR_REG			0x3821
#घोषणा OV2680_FLIP_BIT				1
#घोषणा OV2680_MIRROR_BIT			2
#घोषणा OV2680_FLIP_MIRROR_BIT_ENABLE		4

#घोषणा OV2680_MWB_RED_GAIN_H			0x5004/*0x3400*/
#घोषणा OV2680_MWB_GREEN_GAIN_H			0x5006/*0x3402*/
#घोषणा OV2680_MWB_BLUE_GAIN_H			0x5008/*0x3404*/
#घोषणा OV2680_MWB_GAIN_MAX				0x0fff

#घोषणा OV2680_START_STREAMING			0x01
#घोषणा OV2680_STOP_STREAMING			0x00

#घोषणा OV2680_INVALID_CONFIG	0xffffffff

काष्ठा regval_list अणु
	u16 reg_num;
	u8 value;
पूर्ण;

काष्ठा ov2680_resolution अणु
	u8 *desc;
	स्थिर काष्ठा ov2680_reg *regs;
	पूर्णांक res;
	पूर्णांक width;
	पूर्णांक height;
	पूर्णांक fps;
	पूर्णांक pix_clk_freq;
	u32 skip_frames;
	u16 pixels_per_line;
	u16 lines_per_frame;
	u8 bin_factor_x;
	u8 bin_factor_y;
	u8 bin_mode;
	bool used;
पूर्ण;

काष्ठा ov2680_क्रमmat अणु
	u8 *desc;
	u32 pixelक्रमmat;
	काष्ठा ov2680_reg *regs;
पूर्ण;

/*
 * ov2680 device काष्ठाure.
 */
काष्ठा ov2680_device अणु
	काष्ठा v4l2_subdev sd;
	काष्ठा media_pad pad;
	काष्ठा v4l2_mbus_framefmt क्रमmat;
	काष्ठा mutex input_lock;
	काष्ठा v4l2_ctrl_handler ctrl_handler;
	काष्ठा camera_sensor_platक्रमm_data *platक्रमm_data;
	पूर्णांक vt_pix_clk_freq_mhz;
	पूर्णांक fmt_idx;
	पूर्णांक run_mode;
	u8 res;
	u8 type;
पूर्ण;

/**
 * काष्ठा ov2680_reg - MI sensor  रेजिस्टर क्रमmat
 * @type: type of the रेजिस्टर
 * @reg: 16-bit offset to रेजिस्टर
 * @val: 8/16/32-bit रेजिस्टर value
 *
 * Define a काष्ठाure क्रम sensor रेजिस्टर initialization values
 */
काष्ठा ov2680_reg अणु
	u16 reg;
	u32 val;	/* @set value क्रम पढ़ो/mod/ग_लिखो, @mask */
पूर्ण;

#घोषणा to_ov2680_sensor(x) container_of(x, काष्ठा ov2680_device, sd)

#घोषणा OV2680_MAX_WRITE_BUF_SIZE	30

काष्ठा ov2680_ग_लिखो_buffer अणु
	u16 addr;
	u8 data[OV2680_MAX_WRITE_BUF_SIZE];
पूर्ण;

काष्ठा ov2680_ग_लिखो_ctrl अणु
	पूर्णांक index;
	काष्ठा ov2680_ग_लिखो_buffer buffer;
पूर्ण;

अटल काष्ठा ov2680_reg स्थिर ov2680_global_setting[] = अणु
	अणु0x0103, 0x01पूर्ण,
	अणु0x3002, 0x00पूर्ण,
	अणु0x3016, 0x1cपूर्ण,
	अणु0x3018, 0x44पूर्ण,
	अणु0x3020, 0x00पूर्ण,
	अणु0x3080, 0x02पूर्ण,
	अणु0x3082, 0x45पूर्ण,
	अणु0x3084, 0x09पूर्ण,
	अणु0x3085, 0x04पूर्ण,
	अणु0x3503, 0x03पूर्ण,
	अणु0x350b, 0x36पूर्ण,
	अणु0x3600, 0xb4पूर्ण,
	अणु0x3603, 0x39पूर्ण,
	अणु0x3604, 0x24पूर्ण,
	अणु0x3605, 0x00पूर्ण,
	अणु0x3620, 0x26पूर्ण,
	अणु0x3621, 0x37पूर्ण,
	अणु0x3622, 0x04पूर्ण,
	अणु0x3628, 0x00पूर्ण,
	अणु0x3705, 0x3cपूर्ण,
	अणु0x370c, 0x50पूर्ण,
	अणु0x370d, 0xc0पूर्ण,
	अणु0x3718, 0x88पूर्ण,
	अणु0x3720, 0x00पूर्ण,
	अणु0x3721, 0x00पूर्ण,
	अणु0x3722, 0x00पूर्ण,
	अणु0x3723, 0x00पूर्ण,
	अणु0x3738, 0x00पूर्ण,
	अणु0x3717, 0x58पूर्ण,
	अणु0x3781, 0x80पूर्ण,
	अणु0x3789, 0x60पूर्ण,
	अणु0x3800, 0x00पूर्ण,
	अणु0x3819, 0x04पूर्ण,
	अणु0x4000, 0x81पूर्ण,
	अणु0x4001, 0x40पूर्ण,
	अणु0x4602, 0x02पूर्ण,
	अणु0x481f, 0x36पूर्ण,
	अणु0x4825, 0x36पूर्ण,
	अणु0x4837, 0x18पूर्ण,
	अणु0x5002, 0x30पूर्ण,
	अणु0x5004, 0x04पूर्ण,//manual awb 1x
	अणु0x5005, 0x00पूर्ण,
	अणु0x5006, 0x04पूर्ण,
	अणु0x5007, 0x00पूर्ण,
	अणु0x5008, 0x04पूर्ण,
	अणु0x5009, 0x00पूर्ण,
	अणु0x5080, 0x00पूर्ण,
	अणु0x3701, 0x64पूर्ण,  //add on 14/05/13
	अणु0x3784, 0x0cपूर्ण,  //based OV2680_R1A_AM10.ovt add on 14/06/13
	अणु0x5780, 0x3eपूर्ण,  //based OV2680_R1A_AM10.ovt,Adjust DPC setting (57xx) on 14/06/13
	अणु0x5781, 0x0fपूर्ण,
	अणु0x5782, 0x04पूर्ण,
	अणु0x5783, 0x02पूर्ण,
	अणु0x5784, 0x01पूर्ण,
	अणु0x5785, 0x01पूर्ण,
	अणु0x5786, 0x00पूर्ण,
	अणु0x5787, 0x04पूर्ण,
	अणु0x5788, 0x02पूर्ण,
	अणु0x5789, 0x00पूर्ण,
	अणु0x578a, 0x01पूर्ण,
	अणु0x578b, 0x02पूर्ण,
	अणु0x578c, 0x03पूर्ण,
	अणु0x578d, 0x03पूर्ण,
	अणु0x578e, 0x08पूर्ण,
	अणु0x578f, 0x0cपूर्ण,
	अणु0x5790, 0x08पूर्ण,
	अणु0x5791, 0x04पूर्ण,
	अणु0x5792, 0x00पूर्ण,
	अणु0x5793, 0x00पूर्ण,
	अणु0x5794, 0x03पूर्ण, //based OV2680_R1A_AM10.ovt,Adjust DPC setting (57xx) on 14/06/13
	अणु0x0100, 0x00पूर्ण,	//stream off

	अणुपूर्ण
पूर्ण;

#अगर 0 /* None of the definitions below are used currently */
/*
 * 176x144 30fps  VBlanking 1lane 10Bit (binning)
 */
अटल काष्ठा ov2680_reg स्थिर ov2680_QCIF_30fps[] = अणु
	अणु0x3086, 0x01पूर्ण,
	अणु0x3501, 0x24पूर्ण,
	अणु0x3502, 0x40पूर्ण,
	अणु0x370a, 0x23पूर्ण,
	अणु0x3801, 0xa0पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x78पूर्ण,
	अणु0x3804, 0x05पूर्ण,
	अणु0x3805, 0xafपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0x47पूर्ण,
	अणु0x3808, 0x00पूर्ण,
	अणु0x3809, 0xC0पूर्ण,
	अणु0x380a, 0x00पूर्ण,
	अणु0x380b, 0xa0पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xb0पूर्ण,
	अणु0x380e, 0x02पूर्ण,
	अणु0x380f, 0x84पूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x04पूर्ण,
	अणु0x3814, 0x31पूर्ण,
	अणु0x3815, 0x31पूर्ण,
	अणु0x4000, 0x81पूर्ण,
	अणु0x4001, 0x40पूर्ण,
	अणु0x4008, 0x00पूर्ण,
	अणु0x4009, 0x03पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x00पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x10पूर्ण,
	अणु0x5705, 0xa0पूर्ण,
	अणु0x5706, 0x0cपूर्ण,
	अणु0x5707, 0x78पूर्ण,
	अणु0x3820, 0xc2पूर्ण,
	अणु0x3821, 0x01पूर्ण,
	// अणु0x5090, 0x0cपूर्ण,
	अणुपूर्ण
पूर्ण;

/*
 * 352x288 30fps  VBlanking 1lane 10Bit (binning)
 */
अटल काष्ठा ov2680_reg स्थिर ov2680_CIF_30fps[] = अणु
	अणु0x3086, 0x01पूर्ण,
	अणु0x3501, 0x24पूर्ण,
	अणु0x3502, 0x40पूर्ण,
	अणु0x370a, 0x23पूर्ण,
	अणु0x3801, 0xa0पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x78पूर्ण,
	अणु0x3804, 0x03पूर्ण,
	अणु0x3805, 0x8fपूर्ण,
	अणु0x3806, 0x02पूर्ण,
	अणु0x3807, 0xe7पूर्ण,
	अणु0x3808, 0x01पूर्ण,
	अणु0x3809, 0x70पूर्ण,
	अणु0x380a, 0x01पूर्ण,
	अणु0x380b, 0x30पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xb0पूर्ण,
	अणु0x380e, 0x02पूर्ण,
	अणु0x380f, 0x84पूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x04पूर्ण,
	अणु0x3814, 0x31पूर्ण,
	अणु0x3815, 0x31पूर्ण,
	अणु0x4008, 0x00पूर्ण,
	अणु0x4009, 0x03पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x00पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x10पूर्ण,
	अणु0x5705, 0xa0पूर्ण,
	अणु0x5706, 0x0cपूर्ण,
	अणु0x5707, 0x78पूर्ण,
	अणु0x3820, 0xc2पूर्ण,
	अणु0x3821, 0x01पूर्ण,
	// अणु0x5090, 0x0cपूर्ण,
	अणुपूर्ण
पूर्ण;

/*
 * 336x256 30fps  VBlanking 1lane 10Bit (binning)
 */
अटल काष्ठा ov2680_reg स्थिर ov2680_QVGA_30fps[] = अणु
	अणु0x3086, 0x01पूर्ण,
	अणु0x3501, 0x24पूर्ण,
	अणु0x3502, 0x40पूर्ण,
	अणु0x370a, 0x23पूर्ण,
	अणु0x3801, 0xa0पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x78पूर्ण,
	अणु0x3804, 0x03पूर्ण,
	अणु0x3805, 0x4fपूर्ण,
	अणु0x3806, 0x02पूर्ण,
	अणु0x3807, 0x87पूर्ण,
	अणु0x3808, 0x01पूर्ण,
	अणु0x3809, 0x50पूर्ण,
	अणु0x380a, 0x01पूर्ण,
	अणु0x380b, 0x00पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xb0पूर्ण,
	अणु0x380e, 0x02पूर्ण,
	अणु0x380f, 0x84पूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x04पूर्ण,
	अणु0x3814, 0x31पूर्ण,
	अणु0x3815, 0x31पूर्ण,
	अणु0x4008, 0x00पूर्ण,
	अणु0x4009, 0x03पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x00पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x10पूर्ण,
	अणु0x5705, 0xa0पूर्ण,
	अणु0x5706, 0x0cपूर्ण,
	अणु0x5707, 0x78पूर्ण,
	अणु0x3820, 0xc2पूर्ण,
	अणु0x3821, 0x01पूर्ण,
	// अणु0x5090, 0x0cपूर्ण,
	अणुपूर्ण
पूर्ण;

/*
 * 656x496 30fps  VBlanking 1lane 10Bit (binning)
 */
अटल काष्ठा ov2680_reg स्थिर ov2680_656x496_30fps[] = अणु
	अणु0x3086, 0x01पूर्ण,
	अणु0x3501, 0x24पूर्ण,
	अणु0x3502, 0x40पूर्ण,
	अणु0x370a, 0x23पूर्ण,
	अणु0x3801, 0xa0पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x78पूर्ण,
	अणु0x3804, 0x05पूर्ण,
	अणु0x3805, 0xcfपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0x67पूर्ण,
	अणु0x3808, 0x02पूर्ण,
	अणु0x3809, 0x90पूर्ण,
	अणु0x380a, 0x01पूर्ण,
	अणु0x380b, 0xf0पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xb0पूर्ण,
	अणु0x380e, 0x02पूर्ण,
	अणु0x380f, 0x84पूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x04पूर्ण,
	अणु0x3814, 0x31पूर्ण,
	अणु0x3815, 0x31पूर्ण,
	अणु0x4008, 0x00पूर्ण,
	अणु0x4009, 0x03पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x00पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x10पूर्ण,
	अणु0x5705, 0xa0पूर्ण,
	अणु0x5706, 0x0cपूर्ण,
	अणु0x5707, 0x78पूर्ण,
	अणु0x3820, 0xc2पूर्ण,
	अणु0x3821, 0x01पूर्ण,
	// अणु0x5090, 0x0cपूर्ण,
	अणुपूर्ण
पूर्ण;

/*
* 800x600 30fps  VBlanking 1lane 10Bit (binning)
*/
अटल काष्ठा ov2680_reg स्थिर ov2680_720x592_30fps[] = अणु
	अणु0x3086, 0x01पूर्ण,
	अणु0x3501, 0x26पूर्ण,
	अणु0x3502, 0x40पूर्ण,
	अणु0x370a, 0x23पूर्ण,
	अणु0x3801, 0x00पूर्ण, // X_ADDR_START;
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x00पूर्ण, // Y_ADDR_START;
	अणु0x3804, 0x05पूर्ण,
	अणु0x3805, 0xafपूर्ण, // X_ADDR_END;
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0xafपूर्ण, // Y_ADDR_END;
	अणु0x3808, 0x02पूर्ण,
	अणु0x3809, 0xd0पूर्ण, // X_OUTPUT_SIZE;
	अणु0x380a, 0x02पूर्ण,
	अणु0x380b, 0x50पूर्ण, // Y_OUTPUT_SIZE;
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xacपूर्ण, // HTS;
	अणु0x380e, 0x02पूर्ण,
	अणु0x380f, 0x84पूर्ण, // VTS;
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x00पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x00पूर्ण,
	अणु0x3814, 0x31पूर्ण,
	अणु0x3815, 0x31पूर्ण,
	अणु0x4008, 0x00पूर्ण,
	अणु0x4009, 0x03पूर्ण,
	अणु0x5708, 0x00पूर्ण,
	अणु0x5704, 0x02पूर्ण,
	अणु0x5705, 0xd0पूर्ण, // X_WIN;
	अणु0x5706, 0x02पूर्ण,
	अणु0x5707, 0x50पूर्ण, // Y_WIN;
	अणु0x3820, 0xc2पूर्ण, // FLIP_FORMAT;
	अणु0x3821, 0x01पूर्ण, // MIRROR_FORMAT;
	अणु0x5090, 0x00पूर्ण, // PRE ISP CTRL16, शेष value is 0x0C;
	// BIT[3]: Mirror order, BG or GB;
	// BIT[2]: Flip order, BR or RB;
	अणु0x5081, 0x41पूर्ण,
	अणुपूर्ण
पूर्ण;

/*
* 800x600 30fps  VBlanking 1lane 10Bit (binning)
*/
अटल काष्ठा ov2680_reg स्थिर ov2680_800x600_30fps[] = अणु
	अणु0x3086, 0x01पूर्ण,
	अणु0x3501, 0x26पूर्ण,
	अणु0x3502, 0x40पूर्ण,
	अणु0x370a, 0x23पूर्ण,
	अणु0x3801, 0x00पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x00पूर्ण,
	अणु0x3804, 0x06पूर्ण,
	अणु0x3805, 0x4fपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0xbfपूर्ण,
	अणु0x3808, 0x03पूर्ण,
	अणु0x3809, 0x20पूर्ण,
	अणु0x380a, 0x02पूर्ण,
	अणु0x380b, 0x58पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xacपूर्ण,
	अणु0x380e, 0x02पूर्ण,
	अणु0x380f, 0x84पूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x00पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x00पूर्ण,
	अणु0x3814, 0x31पूर्ण,
	अणु0x3815, 0x31पूर्ण,
	अणु0x5708, 0x00पूर्ण,
	अणु0x5704, 0x03पूर्ण,
	अणु0x5705, 0x20पूर्ण,
	अणु0x5706, 0x02पूर्ण,
	अणु0x5707, 0x58पूर्ण,
	अणु0x3820, 0xc2पूर्ण,
	अणु0x3821, 0x01पूर्ण,
	अणु0x5090, 0x00पूर्ण,
	अणु0x4008, 0x00पूर्ण,
	अणु0x4009, 0x03पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणुपूर्ण
पूर्ण;

/*
 * 720p=1280*720 30fps  VBlanking 1lane 10Bit (no-Scaling)
 */
अटल काष्ठा ov2680_reg स्थिर ov2680_720p_30fps[] = अणु
	अणु0x3086, 0x00पूर्ण,
	अणु0x3501, 0x48पूर्ण,
	अणु0x3502, 0xe0पूर्ण,
	अणु0x370a, 0x21पूर्ण,
	अणु0x3801, 0xa0पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0xf2पूर्ण,
	अणु0x3804, 0x05पूर्ण,
	अणु0x3805, 0xbfपूर्ण,
	अणु0x3806, 0x03पूर्ण,
	अणु0x3807, 0xddपूर्ण,
	अणु0x3808, 0x05पूर्ण,
	अणु0x3809, 0x10पूर्ण,
	अणु0x380a, 0x02पूर्ण,
	अणु0x380b, 0xe0पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xa8पूर्ण,
	अणु0x380e, 0x05पूर्ण,
	अणु0x380f, 0x0eपूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x08पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x06पूर्ण,
	अणु0x3814, 0x11पूर्ण,
	अणु0x3815, 0x11पूर्ण,
	अणु0x4008, 0x02पूर्ण,
	अणु0x4009, 0x09पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x00पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x10पूर्ण,
	अणु0x5705, 0xa0पूर्ण,
	अणु0x5706, 0x0cपूर्ण,
	अणु0x5707, 0x78पूर्ण,
	अणु0x3820, 0xc0पूर्ण,
	अणु0x3821, 0x00पूर्ण,
	// अणु0x5090, 0x0cपूर्ण,
	अणुपूर्ण
पूर्ण;

/*
 * 1296x976 30fps  VBlanking 1lane 10Bit(no-scaling)
 */
अटल काष्ठा ov2680_reg स्थिर ov2680_1296x976_30fps[] = अणु
	अणु0x3086, 0x00पूर्ण,
	अणु0x3501, 0x48पूर्ण,
	अणु0x3502, 0xe0पूर्ण,
	अणु0x370a, 0x21पूर्ण,
	अणु0x3801, 0xa0पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x78पूर्ण,
	अणु0x3804, 0x05पूर्ण,
	अणु0x3805, 0xbfपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0x57पूर्ण,
	अणु0x3808, 0x05पूर्ण,
	अणु0x3809, 0x10पूर्ण,
	अणु0x380a, 0x03पूर्ण,
	अणु0x380b, 0xd0पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xa8पूर्ण,
	अणु0x380e, 0x05पूर्ण,
	अणु0x380f, 0x0eपूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x08पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x08पूर्ण,
	अणु0x3814, 0x11पूर्ण,
	अणु0x3815, 0x11पूर्ण,
	अणु0x4008, 0x02पूर्ण,
	अणु0x4009, 0x09पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x00पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x10पूर्ण,
	अणु0x5705, 0xa0पूर्ण,
	अणु0x5706, 0x0cपूर्ण,
	अणु0x5707, 0x78पूर्ण,
	अणु0x3820, 0xc0पूर्ण,
	अणु0x3821, 0x00पूर्ण, //miror/flip
	// अणु0x5090, 0x0cपूर्ण,
	अणुपूर्ण
पूर्ण;

/*
 *   1456*1096 30fps  VBlanking 1lane 10bit(no-scaling)
*/
अटल काष्ठा ov2680_reg स्थिर ov2680_1456x1096_30fps[] = अणु
	अणु0x3086, 0x00पूर्ण,
	अणु0x3501, 0x48पूर्ण,
	अणु0x3502, 0xe0पूर्ण,
	अणु0x370a, 0x21पूर्ण,
	अणु0x3801, 0x90पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x78पूर्ण,
	अणु0x3804, 0x06पूर्ण,
	अणु0x3805, 0x4fपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0xC0पूर्ण,
	अणु0x3808, 0x05पूर्ण,
	अणु0x3809, 0xb0पूर्ण,
	अणु0x380a, 0x04पूर्ण,
	अणु0x380b, 0x48पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xa8पूर्ण,
	अणु0x380e, 0x05पूर्ण,
	अणु0x380f, 0x0eपूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x08पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x00पूर्ण,
	अणु0x3814, 0x11पूर्ण,
	अणु0x3815, 0x11पूर्ण,
	अणु0x4008, 0x02पूर्ण,
	अणु0x4009, 0x09पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x00पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x10पूर्ण,
	अणु0x5705, 0xa0पूर्ण,
	अणु0x5706, 0x0cपूर्ण,
	अणु0x5707, 0x78पूर्ण,
	अणु0x3820, 0xc0पूर्ण,
	अणु0x3821, 0x00पूर्ण,
	// अणु0x5090, 0x0cपूर्ण,
	अणुपूर्ण
पूर्ण;
#पूर्ण_अगर

/*
 *1616x916  30fps  VBlanking 1lane 10bit
 */

अटल काष्ठा ov2680_reg स्थिर ov2680_1616x916_30fps[] = अणु
	अणु0x3086, 0x00पूर्ण,
	अणु0x3501, 0x48पूर्ण,
	अणु0x3502, 0xe0पूर्ण,
	अणु0x370a, 0x21पूर्ण,
	अणु0x3801, 0x00पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x96पूर्ण,
	अणु0x3804, 0x06पूर्ण,
	अणु0x3805, 0x4fपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0x39पूर्ण,
	अणु0x3808, 0x06पूर्ण,
	अणु0x3809, 0x50पूर्ण,
	अणु0x380a, 0x03पूर्ण,
	अणु0x380b, 0x94पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xa8पूर्ण,
	अणु0x380e, 0x05पूर्ण,
	अणु0x380f, 0x0eपूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x00पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x08पूर्ण,
	अणु0x3814, 0x11पूर्ण,
	अणु0x3815, 0x11पूर्ण,
	अणु0x4008, 0x02पूर्ण,
	अणु0x4009, 0x09पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणु0x5708, 0x01पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x06पूर्ण,
	अणु0x5705, 0x50पूर्ण,
	अणु0x5706, 0x03पूर्ण,
	अणु0x5707, 0x94पूर्ण,
	अणु0x3820, 0xc0पूर्ण,
	अणु0x3821, 0x00पूर्ण,
	// अणु0x5090, 0x0Cपूर्ण,
	अणुपूर्ण
पूर्ण;

/*
 * 1612x1212 30fps VBlanking 1lane 10Bit
 */
#अगर 0
अटल काष्ठा ov2680_reg स्थिर ov2680_1616x1082_30fps[] = अणु
	अणु0x3086, 0x00पूर्ण,
	अणु0x3501, 0x48पूर्ण,
	अणु0x3502, 0xe0पूर्ण,
	अणु0x370a, 0x21पूर्ण,
	अणु0x3801, 0x00पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x86पूर्ण,
	अणु0x3804, 0x06पूर्ण,
	अणु0x3805, 0x4fपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0xbfपूर्ण,
	अणु0x3808, 0x06पूर्ण,
	अणु0x3809, 0x50पूर्ण,
	अणु0x380a, 0x04पूर्ण,
	अणु0x380b, 0x3aपूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xa8पूर्ण,
	अणु0x380e, 0x05पूर्ण,
	अणु0x380f, 0x0eपूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x00पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x00पूर्ण,
	अणु0x3814, 0x11पूर्ण,
	अणु0x3815, 0x11पूर्ण,
	अणु0x5708, 0x01पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x06पूर्ण,
	अणु0x5705, 0x50पूर्ण,
	अणु0x5706, 0x04पूर्ण,
	अणु0x5707, 0x3aपूर्ण,
	अणु0x3820, 0xc0पूर्ण,
	अणु0x3821, 0x00पूर्ण,
	// अणु0x5090, 0x0Cपूर्ण,
	अणु0x4008, 0x02पूर्ण,
	अणु0x4009, 0x09पूर्ण,
	अणु0x5081, 0x41पूर्ण,
	अणुपूर्ण
पूर्ण;
#पूर्ण_अगर
/*
 * 1616x1216 30fps VBlanking 1lane 10Bit
 */
अटल काष्ठा ov2680_reg स्थिर ov2680_1616x1216_30fps[] = अणु
	अणु0x3086, 0x00पूर्ण,
	अणु0x3501, 0x48पूर्ण,
	अणु0x3502, 0xe0पूर्ण,
	अणु0x370a, 0x21पूर्ण,
	अणु0x3801, 0x00पूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x00पूर्ण,
	अणु0x3804, 0x06पूर्ण,
	अणु0x3805, 0x4fपूर्ण,
	अणु0x3806, 0x04पूर्ण,
	अणु0x3807, 0xbfपूर्ण,
	अणु0x3808, 0x06पूर्ण,
	अणु0x3809, 0x50पूर्ण,//50पूर्ण,//4line क्रम mirror and flip
	अणु0x380a, 0x04पूर्ण,
	अणु0x380b, 0xc0पूर्ण,//c0पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0xa8पूर्ण,
	अणु0x380e, 0x05पूर्ण,
	अणु0x380f, 0x0eपूर्ण,
	अणु0x3810, 0x00पूर्ण,
	अणु0x3811, 0x00पूर्ण,
	अणु0x3812, 0x00पूर्ण,
	अणु0x3813, 0x00पूर्ण,
	अणु0x3814, 0x11पूर्ण,
	अणु0x3815, 0x11पूर्ण,
	अणु0x4008, 0x00पूर्ण,
	अणु0x4009, 0x0bपूर्ण,
	अणु0x5081, 0x01पूर्ण,
	अणु0x5708, 0x01पूर्ण, //add क्रम full size flip off and mirror off 2014/09/11
	अणु0x5704, 0x06पूर्ण,
	अणु0x5705, 0x50पूर्ण,
	अणु0x5706, 0x04पूर्ण,
	अणु0x5707, 0xccपूर्ण,
	अणु0x3820, 0xc0पूर्ण,
	अणु0x3821, 0x00पूर्ण,
	// अणु0x5090, 0x0Cपूर्ण,
	अणुपूर्ण
पूर्ण;

अटल काष्ठा ov2680_resolution ov2680_res_preview[] = अणु
	अणु
		.desc = "ov2680_1616x1216_30fps",
		.width = 1616,
		.height = 1216,
		.pix_clk_freq = 66,
		.fps = 30,
		.used = 0,
		.pixels_per_line = 1698,//1704,
		.lines_per_frame = 1294,
		.bin_factor_x = 0,
		.bin_factor_y = 0,
		.bin_mode = 0,
		.skip_frames = 3,
		.regs = ov2680_1616x1216_30fps,
	पूर्ण,
	अणु
		.desc = "ov2680_1616x916_30fps",
		.width = 1616,
		.height = 916,
		.fps = 30,
		.pix_clk_freq = 66,
		.used = 0,
		.pixels_per_line = 1698,//1704,
		.lines_per_frame = 1294,
		.bin_factor_x = 0,
		.bin_factor_y = 0,
		.bin_mode = 0,
		.skip_frames = 3,
		.regs = ov2680_1616x916_30fps,
	पूर्ण,
पूर्ण;

#घोषणा N_RES_PREVIEW (ARRAY_SIZE(ov2680_res_preview))

अटल काष्ठा ov2680_resolution *ov2680_res = ov2680_res_preview;
अटल अचिन्हित दीर्घ N_RES = N_RES_PREVIEW;

#पूर्ण_अगर
