<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#समावेश <linux/bitops.h>
#अघोषित __स_रखो
बाह्य व्योम *__स_रखो(व्योम *, पूर्णांक, __kernel_माप_प्रकार);
#अघोषित __स_नकल
बाह्य व्योम *__स_नकल(व्योम *, स्थिर व्योम *, __kernel_माप_प्रकार);
#अघोषित __स_हटाओ
बाह्य व्योम *__स_हटाओ(व्योम *, स्थिर व्योम *, __kernel_माप_प्रकार);
#अघोषित स_रखो
बाह्य व्योम *स_रखो(व्योम *, पूर्णांक, __kernel_माप_प्रकार);
#अघोषित स_नकल
बाह्य व्योम *स_नकल(व्योम *, स्थिर व्योम *, __kernel_माप_प्रकार);
#अघोषित स_हटाओ
बाह्य व्योम *स_हटाओ(व्योम *, स्थिर व्योम *, __kernel_माप_प्रकार);
