<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_घोषित __NR_नाम
__NR_नाम,
#पूर्ण_अगर
#अगर_घोषित __NR_सूची_गढ़ो
__NR_सूची_गढ़ो,
#पूर्ण_अगर
#अगर_घोषित __NR_सूची_हटाओ
__NR_सूची_हटाओ,
#पूर्ण_अगर
#अगर_घोषित __NR_creat
__NR_creat,
#पूर्ण_अगर
#अगर_घोषित __NR_link
__NR_link,
#पूर्ण_अगर
#अगर_घोषित __NR_unlink
__NR_unlink,
#पूर्ण_अगर
#अगर_घोषित __NR_symlink
__NR_symlink,
#पूर्ण_अगर
#अगर_घोषित __NR_mknod
__NR_mknod,
#पूर्ण_अगर
#अगर_घोषित __NR_सूची_गढ़ोat
__NR_सूची_गढ़ोat,
__NR_mknodat,
__NR_unlinkat,
#अगर_घोषित __NR_नामat
__NR_नामat,
#पूर्ण_अगर
__NR_linkat,
__NR_symlinkat,
#पूर्ण_अगर
#अगर_घोषित __NR_नामat2
__NR_नामat2,
#पूर्ण_अगर
