<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _ASM_POWERPC_STRING_H
#घोषणा _ASM_POWERPC_STRING_H

#अगर_घोषित __KERNEL__

#अगर_अघोषित CONFIG_KASAN
#घोषणा __HAVE_ARCH_STRNCPY
#घोषणा __HAVE_ARCH_STRNCMP
#घोषणा __HAVE_ARCH_MEMCHR
#घोषणा __HAVE_ARCH_MEMCMP
#घोषणा __HAVE_ARCH_MEMSET16
#पूर्ण_अगर

#घोषणा __HAVE_ARCH_MEMSET
#घोषणा __HAVE_ARCH_MEMCPY
#घोषणा __HAVE_ARCH_MEMMOVE
#घोषणा __HAVE_ARCH_MEMCPY_FLUSHCACHE

बाह्य अक्षर * म_नकल(अक्षर *,स्थिर अक्षर *);
बाह्य अक्षर * म_नकलन(अक्षर *,स्थिर अक्षर *, __kernel_माप_प्रकार);
बाह्य __kernel_माप_प्रकार म_माप(स्थिर अक्षर *);
बाह्य पूर्णांक म_भेद(स्थिर अक्षर *,स्थिर अक्षर *);
बाह्य पूर्णांक म_भेदन(स्थिर अक्षर *, स्थिर अक्षर *, __kernel_माप_प्रकार);
बाह्य अक्षर * म_जोड़ो(अक्षर *, स्थिर अक्षर *);
बाह्य व्योम * स_रखो(व्योम *,पूर्णांक,__kernel_माप_प्रकार);
बाह्य व्योम * स_नकल(व्योम *,स्थिर व्योम *,__kernel_माप_प्रकार);
बाह्य व्योम * स_हटाओ(व्योम *,स्थिर व्योम *,__kernel_माप_प्रकार);
बाह्य पूर्णांक स_भेद(स्थिर व्योम *,स्थिर व्योम *,__kernel_माप_प्रकार);
बाह्य व्योम * स_प्रथम(स्थिर व्योम *,पूर्णांक,__kernel_माप_प्रकार);
व्योम स_नकल_flushcache(व्योम *dest, स्थिर व्योम *src, माप_प्रकार size);

व्योम *__स_रखो(व्योम *s, पूर्णांक c, __kernel_माप_प्रकार count);
व्योम *__स_नकल(व्योम *to, स्थिर व्योम *from, __kernel_माप_प्रकार n);
व्योम *__स_हटाओ(व्योम *to, स्थिर व्योम *from, __kernel_माप_प्रकार n);

#अगर defined(CONFIG_KASAN) && !defined(__SANITIZE_ADDRESS__)
/*
 * For files that are not instrumented (e.g. mm/slub.c) we
 * should use not instrumented version of mem* functions.
 */
#घोषणा स_नकल(dst, src, len) __स_नकल(dst, src, len)
#घोषणा स_हटाओ(dst, src, len) __स_हटाओ(dst, src, len)
#घोषणा स_रखो(s, c, n) __स_रखो(s, c, n)

#अगर_अघोषित __NO_FORTIFY
#घोषणा __NO_FORTIFY /* FORTIFY_SOURCE uses __builtin_स_नकल, etc. */
#पूर्ण_अगर

#पूर्ण_अगर

#अगर_घोषित CONFIG_PPC64
#अगर_अघोषित CONFIG_KASAN
#घोषणा __HAVE_ARCH_MEMSET32
#घोषणा __HAVE_ARCH_MEMSET64

बाह्य व्योम *__स_रखो16(uपूर्णांक16_t *, uपूर्णांक16_t v, __kernel_माप_प्रकार);
बाह्य व्योम *__स_रखो32(uपूर्णांक32_t *, uपूर्णांक32_t v, __kernel_माप_प्रकार);
बाह्य व्योम *__स_रखो64(uपूर्णांक64_t *, uपूर्णांक64_t v, __kernel_माप_प्रकार);

अटल अंतरभूत व्योम *स_रखो16(uपूर्णांक16_t *p, uपूर्णांक16_t v, __kernel_माप_प्रकार n)
अणु
	वापस __स_रखो16(p, v, n * 2);
पूर्ण

अटल अंतरभूत व्योम *स_रखो32(uपूर्णांक32_t *p, uपूर्णांक32_t v, __kernel_माप_प्रकार n)
अणु
	वापस __स_रखो32(p, v, n * 4);
पूर्ण

अटल अंतरभूत व्योम *स_रखो64(uपूर्णांक64_t *p, uपूर्णांक64_t v, __kernel_माप_प्रकार n)
अणु
	वापस __स_रखो64(p, v, n * 8);
पूर्ण
#पूर्ण_अगर
#अन्यथा
#अगर_अघोषित CONFIG_KASAN
#घोषणा __HAVE_ARCH_STRLEN
#पूर्ण_अगर

बाह्य व्योम *स_रखो16(uपूर्णांक16_t *, uपूर्णांक16_t, __kernel_माप_प्रकार);
#पूर्ण_अगर
#पूर्ण_अगर /* __KERNEL__ */

#पूर्ण_अगर	/* _ASM_POWERPC_STRING_H */
