<शैली गुरु>
/*
 * Atheros CARL9170 driver
 *
 * PHY and RF code
 *
 * Copyright 2008, Johannes Berg <johannes@sipsolutions.net>
 *
 * This program is मुक्त software; you can redistribute it and/or modअगरy
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License क्रम more details.
 *
 * You should have received a copy of the GNU General Public License
 * aदीर्घ with this program; see the file COPYING.  If not, see
 * http://www.gnu.org/licenses/.
 *
 * This file incorporates work covered by the following copyright and
 * permission notice:
 *    Copyright (c) 2007-2008 Atheros Communications, Inc.
 *
 *    Permission to use, copy, modअगरy, and/or distribute this software क्रम any
 *    purpose with or without fee is hereby granted, provided that the above
 *    copyright notice and this permission notice appear in all copies.
 *
 *    THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 *    WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 *    MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
 *    ANY SPECIAL, सूचीECT, INसूचीECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 *    WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
 *    ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
 *    OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 */

#समावेश <linux/bitrev.h>
#समावेश "carl9170.h"
#समावेश "cmd.h"
#समावेश "phy.h"

अटल पूर्णांक carl9170_init_घातer_cal(काष्ठा ar9170 *ar)
अणु
	carl9170_regग_लिखो_begin(ar);

	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE_MAX, 0x7f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE1, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE2, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE3, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE4, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE5, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE6, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE7, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE8, 0x3f3f3f3f);
	carl9170_regग_लिखो(AR9170_PHY_REG_POWER_TX_RATE9, 0x3f3f3f3f);

	carl9170_regग_लिखो_finish();
	वापस carl9170_regग_लिखो_result();
पूर्ण

काष्ठा carl9170_phy_init अणु
	u32 reg, _5ghz_20, _5ghz_40, _2ghz_40, _2ghz_20;
पूर्ण;

अटल काष्ठा carl9170_phy_init ar5416_phy_init[] = अणु
	अणु 0x1c5800, 0x00000007, 0x00000007, 0x00000007, 0x00000007, पूर्ण,
	अणु 0x1c5804, 0x00000300, 0x000003c4, 0x000003c4, 0x00000300, पूर्ण,
	अणु 0x1c5808, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c580c, 0xad848e19, 0xad848e19, 0xad848e19, 0xad848e19, पूर्ण,
	अणु 0x1c5810, 0x7d14e000, 0x7d14e000, 0x7d14e000, 0x7d14e000, पूर्ण,
	अणु 0x1c5814, 0x9c0a9f6b, 0x9c0a9f6b, 0x9c0a9f6b, 0x9c0a9f6b, पूर्ण,
	अणु 0x1c5818, 0x00000090, 0x00000090, 0x00000090, 0x00000090, पूर्ण,
	अणु 0x1c581c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5820, 0x02020200, 0x02020200, 0x02020200, 0x02020200, पूर्ण,
	अणु 0x1c5824, 0x00000e0e, 0x00000e0e, 0x00000e0e, 0x00000e0e, पूर्ण,
	अणु 0x1c5828, 0x0a020001, 0x0a020001, 0x0a020001, 0x0a020001, पूर्ण,
	अणु 0x1c582c, 0x0000a000, 0x0000a000, 0x0000a000, 0x0000a000, पूर्ण,
	अणु 0x1c5830, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5834, 0x00000e0e, 0x00000e0e, 0x00000e0e, 0x00000e0e, पूर्ण,
	अणु 0x1c5838, 0x00000007, 0x00000007, 0x00000007, 0x00000007, पूर्ण,
	अणु 0x1c583c, 0x00200400, 0x00200400, 0x00200400, 0x00200400, पूर्ण,
	अणु 0x1c5840, 0x206a002e, 0x206a002e, 0x206a002e, 0x206a002e, पूर्ण,
	अणु 0x1c5844, 0x1372161e, 0x13721c1e, 0x13721c24, 0x137216a4, पूर्ण,
	अणु 0x1c5848, 0x001a6a65, 0x001a6a65, 0x00197a68, 0x00197a68, पूर्ण,
	अणु 0x1c584c, 0x1284233c, 0x1284233c, 0x1284233c, 0x1284233c, पूर्ण,
	अणु 0x1c5850, 0x6c48b4e4, 0x6d48b4e4, 0x6d48b0e4, 0x6c48b0e4, पूर्ण,
	अणु 0x1c5854, 0x00000859, 0x00000859, 0x00000859, 0x00000859, पूर्ण,
	अणु 0x1c5858, 0x7ec80d2e, 0x7ec80d2e, 0x7ec80d2e, 0x7ec80d2e, पूर्ण,
	अणु 0x1c585c, 0x31395c5e, 0x3139605e, 0x3139605e, 0x31395c5e, पूर्ण,
	अणु 0x1c5860, 0x0004dd10, 0x0004dd10, 0x0004dd20, 0x0004dd20, पूर्ण,
	अणु 0x1c5864, 0x0001c600, 0x0001c600, 0x0001c600, 0x0001c600, पूर्ण,
	अणु 0x1c5868, 0x409a4190, 0x409a4190, 0x409a4190, 0x409a4190, पूर्ण,
	अणु 0x1c586c, 0x050cb081, 0x050cb081, 0x050cb081, 0x050cb081, पूर्ण,
	अणु 0x1c5900, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5904, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5908, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c590c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5914, 0x000007d0, 0x000007d0, 0x00000898, 0x00000898, पूर्ण,
	अणु 0x1c5918, 0x00000118, 0x00000230, 0x00000268, 0x00000134, पूर्ण,
	अणु 0x1c591c, 0x10000fff, 0x10000fff, 0x10000fff, 0x10000fff, पूर्ण,
	अणु 0x1c5920, 0x0510081c, 0x0510081c, 0x0510001c, 0x0510001c, पूर्ण,
	अणु 0x1c5924, 0xd0058a15, 0xd0058a15, 0xd0058a15, 0xd0058a15, पूर्ण,
	अणु 0x1c5928, 0x00000001, 0x00000001, 0x00000001, 0x00000001, पूर्ण,
	अणु 0x1c592c, 0x00000004, 0x00000004, 0x00000004, 0x00000004, पूर्ण,
	अणु 0x1c5934, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c5938, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c593c, 0x0000007f, 0x0000007f, 0x0000007f, 0x0000007f, पूर्ण,
	अणु 0x1c5944, 0xdfb81020, 0xdfb81020, 0xdfb81020, 0xdfb81020, पूर्ण,
	अणु 0x1c5948, 0x9280b212, 0x9280b212, 0x9280b212, 0x9280b212, पूर्ण,
	अणु 0x1c594c, 0x00020028, 0x00020028, 0x00020028, 0x00020028, पूर्ण,
	अणु 0x1c5954, 0x5d50e188, 0x5d50e188, 0x5d50e188, 0x5d50e188, पूर्ण,
	अणु 0x1c5958, 0x00081fff, 0x00081fff, 0x00081fff, 0x00081fff, पूर्ण,
	अणु 0x1c5960, 0x00009b40, 0x00009b40, 0x00009b40, 0x00009b40, पूर्ण,
	अणु 0x1c5964, 0x00001120, 0x00001120, 0x00001120, 0x00001120, पूर्ण,
	अणु 0x1c5970, 0x190fb515, 0x190fb515, 0x190fb515, 0x190fb515, पूर्ण,
	अणु 0x1c5974, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5978, 0x00000001, 0x00000001, 0x00000001, 0x00000001, पूर्ण,
	अणु 0x1c597c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5980, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5984, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5988, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c598c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5990, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5994, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5998, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c599c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c59a0, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c59a4, 0x00000007, 0x00000007, 0x00000007, 0x00000007, पूर्ण,
	अणु 0x1c59a8, 0x001fff00, 0x001fff00, 0x001fff00, 0x001fff00, पूर्ण,
	अणु 0x1c59ac, 0x006f00c4, 0x006f00c4, 0x006f00c4, 0x006f00c4, पूर्ण,
	अणु 0x1c59b0, 0x03051000, 0x03051000, 0x03051000, 0x03051000, पूर्ण,
	अणु 0x1c59b4, 0x00000820, 0x00000820, 0x00000820, 0x00000820, पूर्ण,
	अणु 0x1c59bc, 0x00181400, 0x00181400, 0x00181400, 0x00181400, पूर्ण,
	अणु 0x1c59c0, 0x038919be, 0x038919be, 0x038919be, 0x038919be, पूर्ण,
	अणु 0x1c59c4, 0x06336f77, 0x06336f77, 0x06336f77, 0x06336f77, पूर्ण,
	अणु 0x1c59c8, 0x6af6532c, 0x6af6532c, 0x6af6532c, 0x6af6532c, पूर्ण,
	अणु 0x1c59cc, 0x08f186c8, 0x08f186c8, 0x08f186c8, 0x08f186c8, पूर्ण,
	अणु 0x1c59d0, 0x00046384, 0x00046384, 0x00046384, 0x00046384, पूर्ण,
	अणु 0x1c59d4, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c59d8, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c59dc, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c59e0, 0x00000200, 0x00000200, 0x00000200, 0x00000200, पूर्ण,
	अणु 0x1c59e4, 0x64646464, 0x64646464, 0x64646464, 0x64646464, पूर्ण,
	अणु 0x1c59e8, 0x3c787878, 0x3c787878, 0x3c787878, 0x3c787878, पूर्ण,
	अणु 0x1c59ec, 0x000000aa, 0x000000aa, 0x000000aa, 0x000000aa, पूर्ण,
	अणु 0x1c59f0, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c59fc, 0x00001042, 0x00001042, 0x00001042, 0x00001042, पूर्ण,
	अणु 0x1c5a00, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5a04, 0x00000040, 0x00000040, 0x00000040, 0x00000040, पूर्ण,
	अणु 0x1c5a08, 0x00000080, 0x00000080, 0x00000080, 0x00000080, पूर्ण,
	अणु 0x1c5a0c, 0x000001a1, 0x000001a1, 0x00000141, 0x00000141, पूर्ण,
	अणु 0x1c5a10, 0x000001e1, 0x000001e1, 0x00000181, 0x00000181, पूर्ण,
	अणु 0x1c5a14, 0x00000021, 0x00000021, 0x000001c1, 0x000001c1, पूर्ण,
	अणु 0x1c5a18, 0x00000061, 0x00000061, 0x00000001, 0x00000001, पूर्ण,
	अणु 0x1c5a1c, 0x00000168, 0x00000168, 0x00000041, 0x00000041, पूर्ण,
	अणु 0x1c5a20, 0x000001a8, 0x000001a8, 0x000001a8, 0x000001a8, पूर्ण,
	अणु 0x1c5a24, 0x000001e8, 0x000001e8, 0x000001e8, 0x000001e8, पूर्ण,
	अणु 0x1c5a28, 0x00000028, 0x00000028, 0x00000028, 0x00000028, पूर्ण,
	अणु 0x1c5a2c, 0x00000068, 0x00000068, 0x00000068, 0x00000068, पूर्ण,
	अणु 0x1c5a30, 0x00000189, 0x00000189, 0x000000a8, 0x000000a8, पूर्ण,
	अणु 0x1c5a34, 0x000001c9, 0x000001c9, 0x00000169, 0x00000169, पूर्ण,
	अणु 0x1c5a38, 0x00000009, 0x00000009, 0x000001a9, 0x000001a9, पूर्ण,
	अणु 0x1c5a3c, 0x00000049, 0x00000049, 0x000001e9, 0x000001e9, पूर्ण,
	अणु 0x1c5a40, 0x00000089, 0x00000089, 0x00000029, 0x00000029, पूर्ण,
	अणु 0x1c5a44, 0x00000170, 0x00000170, 0x00000069, 0x00000069, पूर्ण,
	अणु 0x1c5a48, 0x000001b0, 0x000001b0, 0x00000190, 0x00000190, पूर्ण,
	अणु 0x1c5a4c, 0x000001f0, 0x000001f0, 0x000001d0, 0x000001d0, पूर्ण,
	अणु 0x1c5a50, 0x00000030, 0x00000030, 0x00000010, 0x00000010, पूर्ण,
	अणु 0x1c5a54, 0x00000070, 0x00000070, 0x00000050, 0x00000050, पूर्ण,
	अणु 0x1c5a58, 0x00000191, 0x00000191, 0x00000090, 0x00000090, पूर्ण,
	अणु 0x1c5a5c, 0x000001d1, 0x000001d1, 0x00000151, 0x00000151, पूर्ण,
	अणु 0x1c5a60, 0x00000011, 0x00000011, 0x00000191, 0x00000191, पूर्ण,
	अणु 0x1c5a64, 0x00000051, 0x00000051, 0x000001d1, 0x000001d1, पूर्ण,
	अणु 0x1c5a68, 0x00000091, 0x00000091, 0x00000011, 0x00000011, पूर्ण,
	अणु 0x1c5a6c, 0x000001b8, 0x000001b8, 0x00000051, 0x00000051, पूर्ण,
	अणु 0x1c5a70, 0x000001f8, 0x000001f8, 0x00000198, 0x00000198, पूर्ण,
	अणु 0x1c5a74, 0x00000038, 0x00000038, 0x000001d8, 0x000001d8, पूर्ण,
	अणु 0x1c5a78, 0x00000078, 0x00000078, 0x00000018, 0x00000018, पूर्ण,
	अणु 0x1c5a7c, 0x00000199, 0x00000199, 0x00000058, 0x00000058, पूर्ण,
	अणु 0x1c5a80, 0x000001d9, 0x000001d9, 0x00000098, 0x00000098, पूर्ण,
	अणु 0x1c5a84, 0x00000019, 0x00000019, 0x00000159, 0x00000159, पूर्ण,
	अणु 0x1c5a88, 0x00000059, 0x00000059, 0x00000199, 0x00000199, पूर्ण,
	अणु 0x1c5a8c, 0x00000099, 0x00000099, 0x000001d9, 0x000001d9, पूर्ण,
	अणु 0x1c5a90, 0x000000d9, 0x000000d9, 0x00000019, 0x00000019, पूर्ण,
	अणु 0x1c5a94, 0x000000f9, 0x000000f9, 0x00000059, 0x00000059, पूर्ण,
	अणु 0x1c5a98, 0x000000f9, 0x000000f9, 0x00000099, 0x00000099, पूर्ण,
	अणु 0x1c5a9c, 0x000000f9, 0x000000f9, 0x000000d9, 0x000000d9, पूर्ण,
	अणु 0x1c5aa0, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5aa4, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5aa8, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5aac, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ab0, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ab4, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ab8, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5abc, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ac0, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ac4, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ac8, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5acc, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ad0, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ad4, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ad8, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5adc, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ae0, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ae4, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5ae8, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5aec, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5af0, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5af4, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5af8, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5afc, 0x000000f9, 0x000000f9, 0x000000f9, 0x000000f9, पूर्ण,
	अणु 0x1c5b00, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5b04, 0x00000001, 0x00000001, 0x00000001, 0x00000001, पूर्ण,
	अणु 0x1c5b08, 0x00000002, 0x00000002, 0x00000002, 0x00000002, पूर्ण,
	अणु 0x1c5b0c, 0x00000003, 0x00000003, 0x00000003, 0x00000003, पूर्ण,
	अणु 0x1c5b10, 0x00000004, 0x00000004, 0x00000004, 0x00000004, पूर्ण,
	अणु 0x1c5b14, 0x00000005, 0x00000005, 0x00000005, 0x00000005, पूर्ण,
	अणु 0x1c5b18, 0x00000008, 0x00000008, 0x00000008, 0x00000008, पूर्ण,
	अणु 0x1c5b1c, 0x00000009, 0x00000009, 0x00000009, 0x00000009, पूर्ण,
	अणु 0x1c5b20, 0x0000000a, 0x0000000a, 0x0000000a, 0x0000000a, पूर्ण,
	अणु 0x1c5b24, 0x0000000b, 0x0000000b, 0x0000000b, 0x0000000b, पूर्ण,
	अणु 0x1c5b28, 0x0000000c, 0x0000000c, 0x0000000c, 0x0000000c, पूर्ण,
	अणु 0x1c5b2c, 0x0000000d, 0x0000000d, 0x0000000d, 0x0000000d, पूर्ण,
	अणु 0x1c5b30, 0x00000010, 0x00000010, 0x00000010, 0x00000010, पूर्ण,
	अणु 0x1c5b34, 0x00000011, 0x00000011, 0x00000011, 0x00000011, पूर्ण,
	अणु 0x1c5b38, 0x00000012, 0x00000012, 0x00000012, 0x00000012, पूर्ण,
	अणु 0x1c5b3c, 0x00000013, 0x00000013, 0x00000013, 0x00000013, पूर्ण,
	अणु 0x1c5b40, 0x00000014, 0x00000014, 0x00000014, 0x00000014, पूर्ण,
	अणु 0x1c5b44, 0x00000015, 0x00000015, 0x00000015, 0x00000015, पूर्ण,
	अणु 0x1c5b48, 0x00000018, 0x00000018, 0x00000018, 0x00000018, पूर्ण,
	अणु 0x1c5b4c, 0x00000019, 0x00000019, 0x00000019, 0x00000019, पूर्ण,
	अणु 0x1c5b50, 0x0000001a, 0x0000001a, 0x0000001a, 0x0000001a, पूर्ण,
	अणु 0x1c5b54, 0x0000001b, 0x0000001b, 0x0000001b, 0x0000001b, पूर्ण,
	अणु 0x1c5b58, 0x0000001c, 0x0000001c, 0x0000001c, 0x0000001c, पूर्ण,
	अणु 0x1c5b5c, 0x0000001d, 0x0000001d, 0x0000001d, 0x0000001d, पूर्ण,
	अणु 0x1c5b60, 0x00000020, 0x00000020, 0x00000020, 0x00000020, पूर्ण,
	अणु 0x1c5b64, 0x00000021, 0x00000021, 0x00000021, 0x00000021, पूर्ण,
	अणु 0x1c5b68, 0x00000022, 0x00000022, 0x00000022, 0x00000022, पूर्ण,
	अणु 0x1c5b6c, 0x00000023, 0x00000023, 0x00000023, 0x00000023, पूर्ण,
	अणु 0x1c5b70, 0x00000024, 0x00000024, 0x00000024, 0x00000024, पूर्ण,
	अणु 0x1c5b74, 0x00000025, 0x00000025, 0x00000025, 0x00000025, पूर्ण,
	अणु 0x1c5b78, 0x00000028, 0x00000028, 0x00000028, 0x00000028, पूर्ण,
	अणु 0x1c5b7c, 0x00000029, 0x00000029, 0x00000029, 0x00000029, पूर्ण,
	अणु 0x1c5b80, 0x0000002a, 0x0000002a, 0x0000002a, 0x0000002a, पूर्ण,
	अणु 0x1c5b84, 0x0000002b, 0x0000002b, 0x0000002b, 0x0000002b, पूर्ण,
	अणु 0x1c5b88, 0x0000002c, 0x0000002c, 0x0000002c, 0x0000002c, पूर्ण,
	अणु 0x1c5b8c, 0x0000002d, 0x0000002d, 0x0000002d, 0x0000002d, पूर्ण,
	अणु 0x1c5b90, 0x00000030, 0x00000030, 0x00000030, 0x00000030, पूर्ण,
	अणु 0x1c5b94, 0x00000031, 0x00000031, 0x00000031, 0x00000031, पूर्ण,
	अणु 0x1c5b98, 0x00000032, 0x00000032, 0x00000032, 0x00000032, पूर्ण,
	अणु 0x1c5b9c, 0x00000033, 0x00000033, 0x00000033, 0x00000033, पूर्ण,
	अणु 0x1c5ba0, 0x00000034, 0x00000034, 0x00000034, 0x00000034, पूर्ण,
	अणु 0x1c5ba4, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5ba8, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bac, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bb0, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bb4, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bb8, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bbc, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bc0, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bc4, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bc8, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bcc, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bd0, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bd4, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bd8, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bdc, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5be0, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5be4, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5be8, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bec, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bf0, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bf4, 0x00000035, 0x00000035, 0x00000035, 0x00000035, पूर्ण,
	अणु 0x1c5bf8, 0x00000010, 0x00000010, 0x00000010, 0x00000010, पूर्ण,
	अणु 0x1c5bfc, 0x0000001a, 0x0000001a, 0x0000001a, 0x0000001a, पूर्ण,
	अणु 0x1c5c00, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c0c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c10, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c14, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c18, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c1c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c20, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c24, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c28, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c2c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c30, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c34, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c38, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5c3c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5cf0, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5cf4, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5cf8, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c5cfc, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6200, 0x00000008, 0x00000008, 0x0000000e, 0x0000000e, पूर्ण,
	अणु 0x1c6204, 0x00000440, 0x00000440, 0x00000440, 0x00000440, पूर्ण,
	अणु 0x1c6208, 0xd6be4788, 0xd6be4788, 0xd03e4788, 0xd03e4788, पूर्ण,
	अणु 0x1c620c, 0x012e8160, 0x012e8160, 0x012a8160, 0x012a8160, पूर्ण,
	अणु 0x1c6210, 0x40806333, 0x40806333, 0x40806333, 0x40806333, पूर्ण,
	अणु 0x1c6214, 0x00106c10, 0x00106c10, 0x00106c10, 0x00106c10, पूर्ण,
	अणु 0x1c6218, 0x009c4060, 0x009c4060, 0x009c4060, 0x009c4060, पूर्ण,
	अणु 0x1c621c, 0x1883800a, 0x1883800a, 0x1883800a, 0x1883800a, पूर्ण,
	अणु 0x1c6220, 0x018830c6, 0x018830c6, 0x018830c6, 0x018830c6, पूर्ण,
	अणु 0x1c6224, 0x00000400, 0x00000400, 0x00000400, 0x00000400, पूर्ण,
	अणु 0x1c6228, 0x000009b5, 0x000009b5, 0x000009b5, 0x000009b5, पूर्ण,
	अणु 0x1c622c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6230, 0x00000108, 0x00000210, 0x00000210, 0x00000108, पूर्ण,
	अणु 0x1c6234, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c6238, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c623c, 0x13c889af, 0x13c889af, 0x13c889af, 0x13c889af, पूर्ण,
	अणु 0x1c6240, 0x38490a20, 0x38490a20, 0x38490a20, 0x38490a20, पूर्ण,
	अणु 0x1c6244, 0x00007bb6, 0x00007bb6, 0x00007bb6, 0x00007bb6, पूर्ण,
	अणु 0x1c6248, 0x0fff3ffc, 0x0fff3ffc, 0x0fff3ffc, 0x0fff3ffc, पूर्ण,
	अणु 0x1c624c, 0x00000001, 0x00000001, 0x00000001, 0x00000001, पूर्ण,
	अणु 0x1c6250, 0x0000a000, 0x0000a000, 0x0000a000, 0x0000a000, पूर्ण,
	अणु 0x1c6254, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6258, 0x0cc75380, 0x0cc75380, 0x0cc75380, 0x0cc75380, पूर्ण,
	अणु 0x1c625c, 0x0f0f0f01, 0x0f0f0f01, 0x0f0f0f01, 0x0f0f0f01, पूर्ण,
	अणु 0x1c6260, 0xdfa91f01, 0xdfa91f01, 0xdfa91f01, 0xdfa91f01, पूर्ण,
	अणु 0x1c6264, 0x00418a11, 0x00418a11, 0x00418a11, 0x00418a11, पूर्ण,
	अणु 0x1c6268, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c626c, 0x09249126, 0x09249126, 0x09249126, 0x09249126, पूर्ण,
	अणु 0x1c6274, 0x0a1a9caa, 0x0a1a9caa, 0x0a1a7caa, 0x0a1a7caa, पूर्ण,
	अणु 0x1c6278, 0x1ce739ce, 0x1ce739ce, 0x1ce739ce, 0x1ce739ce, पूर्ण,
	अणु 0x1c627c, 0x051701ce, 0x051701ce, 0x051701ce, 0x051701ce, पूर्ण,
	अणु 0x1c6300, 0x18010000, 0x18010000, 0x18010000, 0x18010000, पूर्ण,
	अणु 0x1c6304, 0x30032602, 0x30032602, 0x2e032402, 0x2e032402, पूर्ण,
	अणु 0x1c6308, 0x48073e06, 0x48073e06, 0x4a0a3c06, 0x4a0a3c06, पूर्ण,
	अणु 0x1c630c, 0x560b4c0a, 0x560b4c0a, 0x621a540b, 0x621a540b, पूर्ण,
	अणु 0x1c6310, 0x641a600f, 0x641a600f, 0x764f6c1b, 0x764f6c1b, पूर्ण,
	अणु 0x1c6314, 0x7a4f6e1b, 0x7a4f6e1b, 0x845b7a5a, 0x845b7a5a, पूर्ण,
	अणु 0x1c6318, 0x8c5b7e5a, 0x8c5b7e5a, 0x950f8ccf, 0x950f8ccf, पूर्ण,
	अणु 0x1c631c, 0x9d0f96cf, 0x9d0f96cf, 0xa5cf9b4f, 0xa5cf9b4f, पूर्ण,
	अणु 0x1c6320, 0xb51fa69f, 0xb51fa69f, 0xbddfaf1f, 0xbddfaf1f, पूर्ण,
	अणु 0x1c6324, 0xcb3fbd07, 0xcb3fbcbf, 0xd1ffc93f, 0xd1ffc93f, पूर्ण,
	अणु 0x1c6328, 0x0000d7bf, 0x0000d7bf, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c632c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6330, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6334, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6338, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c633c, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6340, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6344, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c6348, 0x3fffffff, 0x3fffffff, 0x3fffffff, 0x3fffffff, पूर्ण,
	अणु 0x1c634c, 0x3fffffff, 0x3fffffff, 0x3fffffff, 0x3fffffff, पूर्ण,
	अणु 0x1c6350, 0x3fffffff, 0x3fffffff, 0x3fffffff, 0x3fffffff, पूर्ण,
	अणु 0x1c6354, 0x0003ffff, 0x0003ffff, 0x0003ffff, 0x0003ffff, पूर्ण,
	अणु 0x1c6358, 0x79a8aa1f, 0x79a8aa1f, 0x79a8aa1f, 0x79a8aa1f, पूर्ण,
	अणु 0x1c6388, 0x08000000, 0x08000000, 0x08000000, 0x08000000, पूर्ण,
	अणु 0x1c638c, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c6390, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c6394, 0x1ce739ce, 0x1ce739ce, 0x1ce739ce, 0x1ce739ce, पूर्ण,
	अणु 0x1c6398, 0x000001ce, 0x000001ce, 0x000001ce, 0x000001ce, पूर्ण,
	अणु 0x1c639c, 0x00000007, 0x00000007, 0x00000007, 0x00000007, पूर्ण,
	अणु 0x1c63a0, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63a4, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63a8, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63ac, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63b0, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63b4, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63b8, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63bc, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63c0, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63c4, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63c8, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63cc, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c63d0, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c63d4, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, 0x3f3f3f3f, पूर्ण,
	अणु 0x1c63d8, 0x00000000, 0x00000000, 0x00000000, 0x00000000, पूर्ण,
	अणु 0x1c63dc, 0x1ce739ce, 0x1ce739ce, 0x1ce739ce, 0x1ce739ce, पूर्ण,
	अणु 0x1c63e0, 0x000000c0, 0x000000c0, 0x000000c0, 0x000000c0, पूर्ण,
	अणु 0x1c6848, 0x00180a65, 0x00180a65, 0x00180a68, 0x00180a68, पूर्ण,
	अणु 0x1c6920, 0x0510001c, 0x0510001c, 0x0510001c, 0x0510001c, पूर्ण,
	अणु 0x1c6960, 0x00009b40, 0x00009b40, 0x00009b40, 0x00009b40, पूर्ण,
	अणु 0x1c720c, 0x012e8160, 0x012e8160, 0x012a8160, 0x012a8160, पूर्ण,
	अणु 0x1c726c, 0x09249126, 0x09249126, 0x09249126, 0x09249126, पूर्ण,
	अणु 0x1c7848, 0x00180a65, 0x00180a65, 0x00180a68, 0x00180a68, पूर्ण,
	अणु 0x1c7920, 0x0510001c, 0x0510001c, 0x0510001c, 0x0510001c, पूर्ण,
	अणु 0x1c7960, 0x00009b40, 0x00009b40, 0x00009b40, 0x00009b40, पूर्ण,
	अणु 0x1c820c, 0x012e8160, 0x012e8160, 0x012a8160, 0x012a8160, पूर्ण,
	अणु 0x1c826c, 0x09249126, 0x09249126, 0x09249126, 0x09249126, पूर्ण,
/*	अणु 0x1c8864, 0x0001ce00, 0x0001ce00, 0x0001ce00, 0x0001ce00, पूर्ण, */
	अणु 0x1c8864, 0x0001c600, 0x0001c600, 0x0001c600, 0x0001c600, पूर्ण,
	अणु 0x1c895c, 0x004b6a8e, 0x004b6a8e, 0x004b6a8e, 0x004b6a8e, पूर्ण,
	अणु 0x1c8968, 0x000003ce, 0x000003ce, 0x000003ce, 0x000003ce, पूर्ण,
	अणु 0x1c89bc, 0x00181400, 0x00181400, 0x00181400, 0x00181400, पूर्ण,
	अणु 0x1c9270, 0x00820820, 0x00820820, 0x00820820, 0x00820820, पूर्ण,
	अणु 0x1c935c, 0x066c420f, 0x066c420f, 0x066c420f, 0x066c420f, पूर्ण,
	अणु 0x1c9360, 0x0f282207, 0x0f282207, 0x0f282207, 0x0f282207, पूर्ण,
	अणु 0x1c9364, 0x17601685, 0x17601685, 0x17601685, 0x17601685, पूर्ण,
	अणु 0x1c9368, 0x1f801104, 0x1f801104, 0x1f801104, 0x1f801104, पूर्ण,
	अणु 0x1c936c, 0x37a00c03, 0x37a00c03, 0x37a00c03, 0x37a00c03, पूर्ण,
	अणु 0x1c9370, 0x3fc40883, 0x3fc40883, 0x3fc40883, 0x3fc40883, पूर्ण,
	अणु 0x1c9374, 0x57c00803, 0x57c00803, 0x57c00803, 0x57c00803, पूर्ण,
	अणु 0x1c9378, 0x5fd80682, 0x5fd80682, 0x5fd80682, 0x5fd80682, पूर्ण,
	अणु 0x1c937c, 0x7fe00482, 0x7fe00482, 0x7fe00482, 0x7fe00482, पूर्ण,
	अणु 0x1c9380, 0x7f3c7bba, 0x7f3c7bba, 0x7f3c7bba, 0x7f3c7bba, पूर्ण,
	अणु 0x1c9384, 0xf3307ff0, 0xf3307ff0, 0xf3307ff0, 0xf3307ff0, पूर्ण
पूर्ण;

/*
 * look up a certain रेजिस्टर in ar5416_phy_init[] and वापस the init. value
 * क्रम the band and bandwidth given. Return 0 अगर रेजिस्टर address not found.
 */
अटल u32 carl9170_def_val(u32 reg, bool is_2ghz, bool is_40mhz)
अणु
	अचिन्हित पूर्णांक i;
	क्रम (i = 0; i < ARRAY_SIZE(ar5416_phy_init); i++) अणु
		अगर (ar5416_phy_init[i].reg != reg)
			जारी;

		अगर (is_2ghz) अणु
			अगर (is_40mhz)
				वापस ar5416_phy_init[i]._2ghz_40;
			अन्यथा
				वापस ar5416_phy_init[i]._2ghz_20;
		पूर्ण अन्यथा अणु
			अगर (is_40mhz)
				वापस ar5416_phy_init[i]._5ghz_40;
			अन्यथा
				वापस ar5416_phy_init[i]._5ghz_20;
		पूर्ण
	पूर्ण
	वापस 0;
पूर्ण

/*
 * initialize some phy regs from eeprom values in modal_header[]
 * acc. to band and bandwidth
 */
अटल पूर्णांक carl9170_init_phy_from_eeprom(काष्ठा ar9170 *ar,
				bool is_2ghz, bool is_40mhz)
अणु
	अटल स्थिर u8 xpd2pd[16] = अणु
		0x2, 0x2, 0x2, 0x1, 0x2, 0x2, 0x6, 0x2,
		0x2, 0x3, 0x7, 0x2, 0xb, 0x2, 0x2, 0x2
	पूर्ण;
	/* poपूर्णांकer to the modal_header acc. to band */
	काष्ठा ar9170_eeprom_modal *m = &ar->eeprom.modal_header[is_2ghz];
	u32 val;

	carl9170_regग_लिखो_begin(ar);

	/* ant common control (index 0) */
	carl9170_regग_लिखो(AR9170_PHY_REG_SWITCH_COM,
		le32_to_cpu(m->antCtrlCommon));

	/* ant control chain 0 (index 1) */
	carl9170_regग_लिखो(AR9170_PHY_REG_SWITCH_CHAIN_0,
		le32_to_cpu(m->antCtrlChain[0]));

	/* ant control chain 2 (index 2) */
	carl9170_regग_लिखो(AR9170_PHY_REG_SWITCH_CHAIN_2,
		le32_to_cpu(m->antCtrlChain[1]));

	/* SwSettle (index 3) */
	अगर (!is_40mhz) अणु
		val = carl9170_def_val(AR9170_PHY_REG_SETTLING,
				     is_2ghz, is_40mhz);
		SET_VAL(AR9170_PHY_SETTLING_SWITCH, val, m->चयनSettling);
		carl9170_regग_लिखो(AR9170_PHY_REG_SETTLING, val);
	पूर्ण

	/* adcDesired, pdaDesired (index 4) */
	val = carl9170_def_val(AR9170_PHY_REG_DESIRED_SZ, is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_DESIRED_SZ_PGA, val, m->pgaDesiredSize);
	SET_VAL(AR9170_PHY_DESIRED_SZ_ADC, val, m->adcDesiredSize);
	carl9170_regग_लिखो(AR9170_PHY_REG_DESIRED_SZ, val);

	/* TxEndToXpaOff, TxFrameToXpaOn (index 5) */
	val = carl9170_def_val(AR9170_PHY_REG_RF_CTL4, is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_RF_CTL4_TX_END_XPAB_OFF, val, m->txEndToXpaOff);
	SET_VAL(AR9170_PHY_RF_CTL4_TX_END_XPAA_OFF, val, m->txEndToXpaOff);
	SET_VAL(AR9170_PHY_RF_CTL4_FRAME_XPAB_ON, val, m->txFrameToXpaOn);
	SET_VAL(AR9170_PHY_RF_CTL4_FRAME_XPAA_ON, val, m->txFrameToXpaOn);
	carl9170_regग_लिखो(AR9170_PHY_REG_RF_CTL4, val);

	/* TxEndToRxOn (index 6) */
	val = carl9170_def_val(AR9170_PHY_REG_RF_CTL3, is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_RF_CTL3_TX_END_TO_A2_RX_ON, val, m->txEndToRxOn);
	carl9170_regग_लिखो(AR9170_PHY_REG_RF_CTL3, val);

	/* thresh62 (index 7) */
	val = carl9170_def_val(0x1c8864, is_2ghz, is_40mhz);
	val = (val & ~0x7f000) | (m->thresh62 << 12);
	carl9170_regग_लिखो(0x1c8864, val);

	/* tx/rx attenuation chain 0 (index 8) */
	val = carl9170_def_val(AR9170_PHY_REG_RXGAIN, is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_RXGAIN_TXRX_ATTEN, val, m->txRxAttenCh[0]);
	carl9170_regग_लिखो(AR9170_PHY_REG_RXGAIN, val);

	/* tx/rx attenuation chain 2 (index 9) */
	val = carl9170_def_val(AR9170_PHY_REG_RXGAIN_CHAIN_2,
			       is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_RXGAIN_TXRX_ATTEN, val, m->txRxAttenCh[1]);
	carl9170_regग_लिखो(AR9170_PHY_REG_RXGAIN_CHAIN_2, val);

	/* tx/rx margin chain 0 (index 10) */
	val = carl9170_def_val(AR9170_PHY_REG_GAIN_2GHZ, is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_GAIN_2GHZ_RXTX_MARGIN, val, m->rxTxMarginCh[0]);
	/* bsw margin chain 0 क्रम 5GHz only */
	अगर (!is_2ghz)
		SET_VAL(AR9170_PHY_GAIN_2GHZ_BSW_MARGIN, val, m->bswMargin[0]);
	carl9170_regग_लिखो(AR9170_PHY_REG_GAIN_2GHZ, val);

	/* tx/rx margin chain 2 (index 11) */
	val = carl9170_def_val(AR9170_PHY_REG_GAIN_2GHZ_CHAIN_2,
			       is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_GAIN_2GHZ_RXTX_MARGIN, val, m->rxTxMarginCh[1]);
	carl9170_regग_लिखो(AR9170_PHY_REG_GAIN_2GHZ_CHAIN_2, val);

	/* iqCall, iqCallq chain 0 (index 12) */
	val = carl9170_def_val(AR9170_PHY_REG_TIMING_CTRL4(0),
			       is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_TIMING_CTRL4_IQCORR_Q_I_COFF, val, m->iqCalICh[0]);
	SET_VAL(AR9170_PHY_TIMING_CTRL4_IQCORR_Q_Q_COFF, val, m->iqCalQCh[0]);
	carl9170_regग_लिखो(AR9170_PHY_REG_TIMING_CTRL4(0), val);

	/* iqCall, iqCallq chain 2 (index 13) */
	val = carl9170_def_val(AR9170_PHY_REG_TIMING_CTRL4(2),
			       is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_TIMING_CTRL4_IQCORR_Q_I_COFF, val, m->iqCalICh[1]);
	SET_VAL(AR9170_PHY_TIMING_CTRL4_IQCORR_Q_Q_COFF, val, m->iqCalQCh[1]);
	carl9170_regग_लिखो(AR9170_PHY_REG_TIMING_CTRL4(2), val);

	/* xpd gain mask (index 14) */
	val = carl9170_def_val(AR9170_PHY_REG_TPCRG1, is_2ghz, is_40mhz);
	SET_VAL(AR9170_PHY_TPCRG1_PD_GAIN_1, val,
		xpd2pd[m->xpdGain & 0xf] & 3);
	SET_VAL(AR9170_PHY_TPCRG1_PD_GAIN_2, val,
		xpd2pd[m->xpdGain & 0xf] >> 2);
	carl9170_regग_लिखो(AR9170_PHY_REG_TPCRG1, val);

	carl9170_regग_लिखो(AR9170_PHY_REG_RX_CHAINMASK, ar->eeprom.rx_mask);
	carl9170_regग_लिखो(AR9170_PHY_REG_CAL_CHAINMASK, ar->eeprom.rx_mask);

	carl9170_regग_लिखो_finish();
	वापस carl9170_regग_लिखो_result();
पूर्ण

अटल पूर्णांक carl9170_init_phy(काष्ठा ar9170 *ar, क्रमागत nl80211_band band)
अणु
	पूर्णांक i, err;
	u32 val;
	bool is_2ghz = band == NL80211_BAND_2GHZ;
	bool is_40mhz = conf_is_ht40(&ar->hw->conf);

	carl9170_regग_लिखो_begin(ar);

	क्रम (i = 0; i < ARRAY_SIZE(ar5416_phy_init); i++) अणु
		अगर (is_40mhz) अणु
			अगर (is_2ghz)
				val = ar5416_phy_init[i]._2ghz_40;
			अन्यथा
				val = ar5416_phy_init[i]._5ghz_40;
		पूर्ण अन्यथा अणु
			अगर (is_2ghz)
				val = ar5416_phy_init[i]._2ghz_20;
			अन्यथा
				val = ar5416_phy_init[i]._5ghz_20;
		पूर्ण

		carl9170_regग_लिखो(ar5416_phy_init[i].reg, val);
	पूर्ण

	carl9170_regग_लिखो_finish();
	err = carl9170_regग_लिखो_result();
	अगर (err)
		वापस err;

	err = carl9170_init_phy_from_eeprom(ar, is_2ghz, is_40mhz);
	अगर (err)
		वापस err;

	err = carl9170_init_घातer_cal(ar);
	अगर (err)
		वापस err;

	अगर (!ar->fw.hw_counters) अणु
		err = carl9170_ग_लिखो_reg(ar, AR9170_PWR_REG_PLL_ADDAC,
					 is_2ghz ? 0x5163 : 0x5143);
	पूर्ण

	वापस err;
पूर्ण

काष्ठा carl9170_rf_initvals अणु
	u32 reg, _5ghz, _2ghz;
पूर्ण;

अटल काष्ठा carl9170_rf_initvals carl9170_rf_initval[] = अणु
	/* bank 0 */
	अणु 0x1c58b0, 0x1e5795e5, 0x1e5795e5पूर्ण,
	अणु 0x1c58e0, 0x02008020, 0x02008020पूर्ण,
	/* bank 1 */
	अणु 0x1c58b0, 0x02108421, 0x02108421पूर्ण,
	अणु 0x1c58ec, 0x00000008, 0x00000008पूर्ण,
	/* bank 2 */
	अणु 0x1c58b0, 0x0e73ff17, 0x0e73ff17पूर्ण,
	अणु 0x1c58e0, 0x00000420, 0x00000420पूर्ण,
	/* bank 3 */
	अणु 0x1c58f0, 0x01400018, 0x01c00018पूर्ण,
	/* bank 4 */
	अणु 0x1c58b0, 0x000001a1, 0x000001a1पूर्ण,
	अणु 0x1c58e8, 0x00000001, 0x00000001पूर्ण,
	/* bank 5 */
	अणु 0x1c58b0, 0x00000013, 0x00000013पूर्ण,
	अणु 0x1c58e4, 0x00000002, 0x00000002पूर्ण,
	/* bank 6 */
	अणु 0x1c58b0, 0x00000000, 0x00000000पूर्ण,
	अणु 0x1c58b0, 0x00000000, 0x00000000पूर्ण,
	अणु 0x1c58b0, 0x00000000, 0x00000000पूर्ण,
	अणु 0x1c58b0, 0x00000000, 0x00000000पूर्ण,
	अणु 0x1c58b0, 0x00000000, 0x00000000पूर्ण,
	अणु 0x1c58b0, 0x00004000, 0x00004000पूर्ण,
	अणु 0x1c58b0, 0x00006c00, 0x00006c00पूर्ण,
	अणु 0x1c58b0, 0x00002c00, 0x00002c00पूर्ण,
	अणु 0x1c58b0, 0x00004800, 0x00004800पूर्ण,
	अणु 0x1c58b0, 0x00004000, 0x00004000पूर्ण,
	अणु 0x1c58b0, 0x00006000, 0x00006000पूर्ण,
	अणु 0x1c58b0, 0x00001000, 0x00001000पूर्ण,
	अणु 0x1c58b0, 0x00004000, 0x00004000पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00087c00, 0x00087c00पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00005400, 0x00005400पूर्ण,
	अणु 0x1c58b0, 0x00000c00, 0x00000c00पूर्ण,
	अणु 0x1c58b0, 0x00001800, 0x00001800पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00006c00, 0x00006c00पूर्ण,
	अणु 0x1c58b0, 0x00006c00, 0x00006c00पूर्ण,
	अणु 0x1c58b0, 0x00007c00, 0x00007c00पूर्ण,
	अणु 0x1c58b0, 0x00002c00, 0x00002c00पूर्ण,
	अणु 0x1c58b0, 0x00003c00, 0x00003c00पूर्ण,
	अणु 0x1c58b0, 0x00003800, 0x00003800पूर्ण,
	अणु 0x1c58b0, 0x00001c00, 0x00001c00पूर्ण,
	अणु 0x1c58b0, 0x00000800, 0x00000800पूर्ण,
	अणु 0x1c58b0, 0x00000408, 0x00000408पूर्ण,
	अणु 0x1c58b0, 0x00004c15, 0x00004c15पूर्ण,
	अणु 0x1c58b0, 0x00004188, 0x00004188पूर्ण,
	अणु 0x1c58b0, 0x0000201e, 0x0000201eपूर्ण,
	अणु 0x1c58b0, 0x00010408, 0x00010408पूर्ण,
	अणु 0x1c58b0, 0x00000801, 0x00000801पूर्ण,
	अणु 0x1c58b0, 0x00000c08, 0x00000c08पूर्ण,
	अणु 0x1c58b0, 0x0000181e, 0x0000181eपूर्ण,
	अणु 0x1c58b0, 0x00001016, 0x00001016पूर्ण,
	अणु 0x1c58b0, 0x00002800, 0x00002800पूर्ण,
	अणु 0x1c58b0, 0x00004010, 0x00004010पूर्ण,
	अणु 0x1c58b0, 0x0000081c, 0x0000081cपूर्ण,
	अणु 0x1c58b0, 0x00000115, 0x00000115पूर्ण,
	अणु 0x1c58b0, 0x00000015, 0x00000015पूर्ण,
	अणु 0x1c58b0, 0x00000066, 0x00000066पूर्ण,
	अणु 0x1c58b0, 0x0000001c, 0x0000001cपूर्ण,
	अणु 0x1c58b0, 0x00000000, 0x00000000पूर्ण,
	अणु 0x1c58b0, 0x00000004, 0x00000004पूर्ण,
	अणु 0x1c58b0, 0x00000015, 0x00000015पूर्ण,
	अणु 0x1c58b0, 0x0000001f, 0x0000001fपूर्ण,
	अणु 0x1c58e0, 0x00000000, 0x00000400पूर्ण,
	/* bank 7 */
	अणु 0x1c58b0, 0x000000a0, 0x000000a0पूर्ण,
	अणु 0x1c58b0, 0x00000000, 0x00000000पूर्ण,
	अणु 0x1c58b0, 0x00000040, 0x00000040पूर्ण,
	अणु 0x1c58f0, 0x0000001c, 0x0000001cपूर्ण,
पूर्ण;

अटल पूर्णांक carl9170_init_rf_banks_0_7(काष्ठा ar9170 *ar, bool band5ghz)
अणु
	पूर्णांक err, i;

	carl9170_regग_लिखो_begin(ar);

	क्रम (i = 0; i < ARRAY_SIZE(carl9170_rf_initval); i++)
		carl9170_regग_लिखो(carl9170_rf_initval[i].reg,
				  band5ghz ? carl9170_rf_initval[i]._5ghz
					   : carl9170_rf_initval[i]._2ghz);

	carl9170_regग_लिखो_finish();
	err = carl9170_regग_लिखो_result();
	अगर (err)
		wiphy_err(ar->hw->wiphy, "rf init failed\n");

	वापस err;
पूर्ण

काष्ठा carl9170_phy_freq_params अणु
	u8 coeff_exp;
	u16 coeff_man;
	u8 coeff_exp_shgi;
	u16 coeff_man_shgi;
पूर्ण;

क्रमागत carl9170_bw अणु
	CARL9170_BW_20,
	CARL9170_BW_40_BELOW,
	CARL9170_BW_40_ABOVE,

	__CARL9170_NUM_BW,
पूर्ण;

काष्ठा carl9170_phy_freq_entry अणु
	u16 freq;
	काष्ठा carl9170_phy_freq_params params[__CARL9170_NUM_BW];
पूर्ण;

/* NB: must be in sync with channel tables in मुख्य! */
अटल स्थिर काष्ठा carl9170_phy_freq_entry carl9170_phy_freq_params[] = अणु
/*
 *	freq,
 *		20MHz,
 *		40MHz (below),
 *		40Mhz (above),
 */
	अणु 2412, अणु
		अणु 3, 21737, 3, 19563, पूर्ण,
		अणु 3, 21827, 3, 19644, पूर्ण,
		अणु 3, 21647, 3, 19482, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2417, अणु
		अणु 3, 21692, 3, 19523, पूर्ण,
		अणु 3, 21782, 3, 19604, पूर्ण,
		अणु 3, 21602, 3, 19442, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2422, अणु
		अणु 3, 21647, 3, 19482, पूर्ण,
		अणु 3, 21737, 3, 19563, पूर्ण,
		अणु 3, 21558, 3, 19402, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2427, अणु
		अणु 3, 21602, 3, 19442, पूर्ण,
		अणु 3, 21692, 3, 19523, पूर्ण,
		अणु 3, 21514, 3, 19362, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2432, अणु
		अणु 3, 21558, 3, 19402, पूर्ण,
		अणु 3, 21647, 3, 19482, पूर्ण,
		अणु 3, 21470, 3, 19323, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2437, अणु
		अणु 3, 21514, 3, 19362, पूर्ण,
		अणु 3, 21602, 3, 19442, पूर्ण,
		अणु 3, 21426, 3, 19283, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2442, अणु
		अणु 3, 21470, 3, 19323, पूर्ण,
		अणु 3, 21558, 3, 19402, पूर्ण,
		अणु 3, 21382, 3, 19244, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2447, अणु
		अणु 3, 21426, 3, 19283, पूर्ण,
		अणु 3, 21514, 3, 19362, पूर्ण,
		अणु 3, 21339, 3, 19205, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2452, अणु
		अणु 3, 21382, 3, 19244, पूर्ण,
		अणु 3, 21470, 3, 19323, पूर्ण,
		अणु 3, 21295, 3, 19166, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2457, अणु
		अणु 3, 21339, 3, 19205, पूर्ण,
		अणु 3, 21426, 3, 19283, पूर्ण,
		अणु 3, 21252, 3, 19127, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2462, अणु
		अणु 3, 21295, 3, 19166, पूर्ण,
		अणु 3, 21382, 3, 19244, पूर्ण,
		अणु 3, 21209, 3, 19088, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2467, अणु
		अणु 3, 21252, 3, 19127, पूर्ण,
		अणु 3, 21339, 3, 19205, पूर्ण,
		अणु 3, 21166, 3, 19050, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2472, अणु
		अणु 3, 21209, 3, 19088, पूर्ण,
		अणु 3, 21295, 3, 19166, पूर्ण,
		अणु 3, 21124, 3, 19011, पूर्ण,
	पूर्ण पूर्ण,
	अणु 2484, अणु
		अणु 3, 21107, 3, 18996, पूर्ण,
		अणु 3, 21192, 3, 19073, पूर्ण,
		अणु 3, 21022, 3, 18920, पूर्ण,
	पूर्ण पूर्ण,
	अणु 4920, अणु
		अणु 4, 21313, 4, 19181, पूर्ण,
		अणु 4, 21356, 4, 19220, पूर्ण,
		अणु 4, 21269, 4, 19142, पूर्ण,
	पूर्ण पूर्ण,
	अणु 4940, अणु
		अणु 4, 21226, 4, 19104, पूर्ण,
		अणु 4, 21269, 4, 19142, पूर्ण,
		अणु 4, 21183, 4, 19065, पूर्ण,
	पूर्ण पूर्ण,
	अणु 4960, अणु
		अणु 4, 21141, 4, 19027, पूर्ण,
		अणु 4, 21183, 4, 19065, पूर्ण,
		अणु 4, 21098, 4, 18988, पूर्ण,
	पूर्ण पूर्ण,
	अणु 4980, अणु
		अणु 4, 21056, 4, 18950, पूर्ण,
		अणु 4, 21098, 4, 18988, पूर्ण,
		अणु 4, 21014, 4, 18912, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5040, अणु
		अणु 4, 20805, 4, 18725, पूर्ण,
		अणु 4, 20846, 4, 18762, पूर्ण,
		अणु 4, 20764, 4, 18687, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5060, अणु
		अणु 4, 20723, 4, 18651, पूर्ण,
		अणु 4, 20764, 4, 18687, पूर्ण,
		अणु 4, 20682, 4, 18614, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5080, अणु
		अणु 4, 20641, 4, 18577, पूर्ण,
		अणु 4, 20682, 4, 18614, पूर्ण,
		अणु 4, 20601, 4, 18541, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5180, अणु
		अणु 4, 20243, 4, 18219, पूर्ण,
		अणु 4, 20282, 4, 18254, पूर्ण,
		अणु 4, 20204, 4, 18183, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5200, अणु
		अणु 4, 20165, 4, 18148, पूर्ण,
		अणु 4, 20204, 4, 18183, पूर्ण,
		अणु 4, 20126, 4, 18114, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5220, अणु
		अणु 4, 20088, 4, 18079, पूर्ण,
		अणु 4, 20126, 4, 18114, पूर्ण,
		अणु 4, 20049, 4, 18044, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5240, अणु
		अणु 4, 20011, 4, 18010, पूर्ण,
		अणु 4, 20049, 4, 18044, पूर्ण,
		अणु 4, 19973, 4, 17976, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5260, अणु
		अणु 4, 19935, 4, 17941, पूर्ण,
		अणु 4, 19973, 4, 17976, पूर्ण,
		अणु 4, 19897, 4, 17907, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5280, अणु
		अणु 4, 19859, 4, 17873, पूर्ण,
		अणु 4, 19897, 4, 17907, पूर्ण,
		अणु 4, 19822, 4, 17840, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5300, अणु
		अणु 4, 19784, 4, 17806, पूर्ण,
		अणु 4, 19822, 4, 17840, पूर्ण,
		अणु 4, 19747, 4, 17772, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5320, अणु
		अणु 4, 19710, 4, 17739, पूर्ण,
		अणु 4, 19747, 4, 17772, पूर्ण,
		अणु 4, 19673, 4, 17706, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5500, अणु
		अणु 4, 19065, 4, 17159, पूर्ण,
		अणु 4, 19100, 4, 17190, पूर्ण,
		अणु 4, 19030, 4, 17127, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5520, अणु
		अणु 4, 18996, 4, 17096, पूर्ण,
		अणु 4, 19030, 4, 17127, पूर्ण,
		अणु 4, 18962, 4, 17065, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5540, अणु
		अणु 4, 18927, 4, 17035, पूर्ण,
		अणु 4, 18962, 4, 17065, पूर्ण,
		अणु 4, 18893, 4, 17004, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5560, अणु
		अणु 4, 18859, 4, 16973, पूर्ण,
		अणु 4, 18893, 4, 17004, पूर्ण,
		अणु 4, 18825, 4, 16943, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5580, अणु
		अणु 4, 18792, 4, 16913, पूर्ण,
		अणु 4, 18825, 4, 16943, पूर्ण,
		अणु 4, 18758, 4, 16882, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5600, अणु
		अणु 4, 18725, 4, 16852, पूर्ण,
		अणु 4, 18758, 4, 16882, पूर्ण,
		अणु 4, 18691, 4, 16822, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5620, अणु
		अणु 4, 18658, 4, 16792, पूर्ण,
		अणु 4, 18691, 4, 16822, पूर्ण,
		अणु 4, 18625, 4, 16762, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5640, अणु
		अणु 4, 18592, 4, 16733, पूर्ण,
		अणु 4, 18625, 4, 16762, पूर्ण,
		अणु 4, 18559, 4, 16703, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5660, अणु
		अणु 4, 18526, 4, 16673, पूर्ण,
		अणु 4, 18559, 4, 16703, पूर्ण,
		अणु 4, 18493, 4, 16644, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5680, अणु
		अणु 4, 18461, 4, 16615, पूर्ण,
		अणु 4, 18493, 4, 16644, पूर्ण,
		अणु 4, 18428, 4, 16586, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5700, अणु
		अणु 4, 18396, 4, 16556, पूर्ण,
		अणु 4, 18428, 4, 16586, पूर्ण,
		अणु 4, 18364, 4, 16527, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5745, अणु
		अणु 4, 18252, 4, 16427, पूर्ण,
		अणु 4, 18284, 4, 16455, पूर्ण,
		अणु 4, 18220, 4, 16398, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5765, अणु
		अणु 4, 18189, 5, 32740, पूर्ण,
		अणु 4, 18220, 4, 16398, पूर्ण,
		अणु 4, 18157, 5, 32683, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5785, अणु
		अणु 4, 18126, 5, 32626, पूर्ण,
		अणु 4, 18157, 5, 32683, पूर्ण,
		अणु 4, 18094, 5, 32570, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5805, अणु
		अणु 4, 18063, 5, 32514, पूर्ण,
		अणु 4, 18094, 5, 32570, पूर्ण,
		अणु 4, 18032, 5, 32458, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5825, अणु
		अणु 4, 18001, 5, 32402, पूर्ण,
		अणु 4, 18032, 5, 32458, पूर्ण,
		अणु 4, 17970, 5, 32347, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5170, अणु
		अणु 4, 20282, 4, 18254, पूर्ण,
		अणु 4, 20321, 4, 18289, पूर्ण,
		अणु 4, 20243, 4, 18219, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5190, अणु
		अणु 4, 20204, 4, 18183, पूर्ण,
		अणु 4, 20243, 4, 18219, पूर्ण,
		अणु 4, 20165, 4, 18148, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5210, अणु
		अणु 4, 20126, 4, 18114, पूर्ण,
		अणु 4, 20165, 4, 18148, पूर्ण,
		अणु 4, 20088, 4, 18079, पूर्ण,
	पूर्ण पूर्ण,
	अणु 5230, अणु
		अणु 4, 20049, 4, 18044, पूर्ण,
		अणु 4, 20088, 4, 18079, पूर्ण,
		अणु 4, 20011, 4, 18010, पूर्ण,
	पूर्ण पूर्ण,
पूर्ण;

अटल पूर्णांक carl9170_init_rf_bank4_pwr(काष्ठा ar9170 *ar, bool band5ghz,
				      u32 freq, क्रमागत carl9170_bw bw)
अणु
	पूर्णांक err;
	u32 d0, d1, td0, td1, fd0, fd1;
	u8 chansel;
	u8 refsel0 = 1, refsel1 = 0;
	u8 lf_synth = 0;

	चयन (bw) अणु
	हाल CARL9170_BW_40_ABOVE:
		freq += 10;
		अवरोध;
	हाल CARL9170_BW_40_BELOW:
		freq -= 10;
		अवरोध;
	हाल CARL9170_BW_20:
		अवरोध;
	शेष:
		BUG();
		वापस -ENOSYS;
	पूर्ण

	अगर (band5ghz) अणु
		अगर (freq % 10) अणु
			chansel = (freq - 4800) / 5;
		पूर्ण अन्यथा अणु
			chansel = ((freq - 4800) / 10) * 2;
			refsel0 = 0;
			refsel1 = 1;
		पूर्ण
		chansel = bitrev8(chansel);
	पूर्ण अन्यथा अणु
		अगर (freq == 2484) अणु
			chansel = 10 + (freq - 2274) / 5;
			lf_synth = 1;
		पूर्ण अन्यथा
			chansel = 16 + (freq - 2272) / 5;
		chansel *= 4;
		chansel = bitrev8(chansel);
	पूर्ण

	d1 =	chansel;
	d0 =	0x21 |
		refsel0 << 3 |
		refsel1 << 2 |
		lf_synth << 1;
	td0 =	d0 & 0x1f;
	td1 =	d1 & 0x1f;
	fd0 =	td1 << 5 | td0;

	td0 =	(d0 >> 5) & 0x7;
	td1 =	(d1 >> 5) & 0x7;
	fd1 =	td1 << 5 | td0;

	carl9170_regग_लिखो_begin(ar);

	carl9170_regग_लिखो(0x1c58b0, fd0);
	carl9170_regग_लिखो(0x1c58e8, fd1);

	carl9170_regग_लिखो_finish();
	err = carl9170_regग_लिखो_result();
	अगर (err)
		वापस err;

	वापस 0;
पूर्ण

अटल स्थिर काष्ठा carl9170_phy_freq_params *
carl9170_get_hw_dyn_params(काष्ठा ieee80211_channel *channel,
			   क्रमागत carl9170_bw bw)
अणु
	अचिन्हित पूर्णांक chanidx = 0;
	u16 freq = 2412;

	अगर (channel) अणु
		chanidx = channel->hw_value;
		freq = channel->center_freq;
	पूर्ण

	BUG_ON(chanidx >= ARRAY_SIZE(carl9170_phy_freq_params));

	BUILD_BUG_ON(__CARL9170_NUM_BW != 3);

	WARN_ON(carl9170_phy_freq_params[chanidx].freq != freq);

	वापस &carl9170_phy_freq_params[chanidx].params[bw];
पूर्ण

अटल पूर्णांक carl9170_find_freq_idx(पूर्णांक nfreqs, u8 *freqs, u8 f)
अणु
	पूर्णांक idx = nfreqs - 2;

	जबतक (idx >= 0) अणु
		अगर (f >= freqs[idx])
			वापस idx;
		idx--;
	पूर्ण

	वापस 0;
पूर्ण

अटल s32 carl9170_पूर्णांकerpolate_s32(s32 x, s32 x1, s32 y1, s32 x2, s32 y2)
अणु
	/* nothing to पूर्णांकerpolate, it's horizontal */
	अगर (y2 == y1)
		वापस y1;

	/* check अगर we hit one of the edges */
	अगर (x == x1)
		वापस y1;
	अगर (x == x2)
		वापस y2;

	/* x1 == x2 is bad, hopefully == x */
	अगर (x2 == x1)
		वापस y1;

	वापस y1 + (((y2 - y1) * (x - x1)) / (x2 - x1));
पूर्ण

अटल u8 carl9170_पूर्णांकerpolate_u8(u8 x, u8 x1, u8 y1, u8 x2, u8 y2)
अणु
#घोषणा SHIFT		8
	s32 y;

	y = carl9170_पूर्णांकerpolate_s32(x << SHIFT, x1 << SHIFT,
		y1 << SHIFT, x2 << SHIFT, y2 << SHIFT);

	/*
	 * XXX: unwrap this expression
	 *	Isn't it just DIV_ROUND_UP(y, 1<<SHIFT)?
	 *	Can we rely on the compiler to optimise away the भाग?
	 */
	वापस (y >> SHIFT) + ((y & (1 << (SHIFT - 1))) >> (SHIFT - 1));
#अघोषित SHIFT
पूर्ण

अटल u8 carl9170_पूर्णांकerpolate_val(u8 x, u8 *x_array, u8 *y_array)
अणु
	पूर्णांक i;

	क्रम (i = 0; i < 3; i++) अणु
		अगर (x <= x_array[i + 1])
			अवरोध;
	पूर्ण

	वापस carl9170_पूर्णांकerpolate_u8(x, x_array[i], y_array[i],
		x_array[i + 1], y_array[i + 1]);
पूर्ण

अटल पूर्णांक carl9170_set_freq_cal_data(काष्ठा ar9170 *ar,
	काष्ठा ieee80211_channel *channel)
अणु
	u8 *cal_freq_pier;
	u8 vpds[2][AR5416_PD_GAIN_ICEPTS];
	u8 pwrs[2][AR5416_PD_GAIN_ICEPTS];
	पूर्णांक chain, idx, i;
	u32 phy_data = 0;
	u8 f, पंचांगp;

	चयन (channel->band) अणु
	हाल NL80211_BAND_2GHZ:
		f = channel->center_freq - 2300;
		cal_freq_pier = ar->eeprom.cal_freq_pier_2G;
		i = AR5416_NUM_2G_CAL_PIERS - 1;
		अवरोध;

	हाल NL80211_BAND_5GHZ:
		f = (channel->center_freq - 4800) / 5;
		cal_freq_pier = ar->eeprom.cal_freq_pier_5G;
		i = AR5416_NUM_5G_CAL_PIERS - 1;
		अवरोध;

	शेष:
		वापस -EINVAL;
	पूर्ण

	क्रम (; i >= 0; i--) अणु
		अगर (cal_freq_pier[i] != 0xff)
			अवरोध;
	पूर्ण
	अगर (i < 0)
		वापस -EINVAL;

	idx = carl9170_find_freq_idx(i, cal_freq_pier, f);

	carl9170_regग_लिखो_begin(ar);

	क्रम (chain = 0; chain < AR5416_MAX_CHAINS; chain++) अणु
		क्रम (i = 0; i < AR5416_PD_GAIN_ICEPTS; i++) अणु
			काष्ठा ar9170_calibration_data_per_freq *cal_pier_data;
			पूर्णांक j;

			चयन (channel->band) अणु
			हाल NL80211_BAND_2GHZ:
				cal_pier_data = &ar->eeprom.
					cal_pier_data_2G[chain][idx];
				अवरोध;

			हाल NL80211_BAND_5GHZ:
				cal_pier_data = &ar->eeprom.
					cal_pier_data_5G[chain][idx];
				अवरोध;

			शेष:
				वापस -EINVAL;
			पूर्ण

			क्रम (j = 0; j < 2; j++) अणु
				vpds[j][i] = carl9170_पूर्णांकerpolate_u8(f,
					cal_freq_pier[idx],
					cal_pier_data->vpd_pdg[j][i],
					cal_freq_pier[idx + 1],
					cal_pier_data[1].vpd_pdg[j][i]);

				pwrs[j][i] = carl9170_पूर्णांकerpolate_u8(f,
					cal_freq_pier[idx],
					cal_pier_data->pwr_pdg[j][i],
					cal_freq_pier[idx + 1],
					cal_pier_data[1].pwr_pdg[j][i]) / 2;
			पूर्ण
		पूर्ण

		क्रम (i = 0; i < 76; i++) अणु
			अगर (i < 25) अणु
				पंचांगp = carl9170_पूर्णांकerpolate_val(i, &pwrs[0][0],
							       &vpds[0][0]);
			पूर्ण अन्यथा अणु
				पंचांगp = carl9170_पूर्णांकerpolate_val(i - 12,
							       &pwrs[1][0],
							       &vpds[1][0]);
			पूर्ण

			phy_data |= पंचांगp << ((i & 3) << 3);
			अगर ((i & 3) == 3) अणु
				carl9170_regग_लिखो(0x1c6280 + chain * 0x1000 +
						  (i & ~3), phy_data);
				phy_data = 0;
			पूर्ण
		पूर्ण

		क्रम (i = 19; i < 32; i++)
			carl9170_regग_लिखो(0x1c6280 + chain * 0x1000 + (i << 2),
					  0x0);
	पूर्ण

	carl9170_regग_लिखो_finish();
	वापस carl9170_regग_लिखो_result();
पूर्ण

अटल u8 carl9170_get_max_edge_घातer(काष्ठा ar9170 *ar,
	u32 freq, काष्ठा ar9170_calctl_edges edges[])
अणु
	पूर्णांक i;
	u8 rc = AR5416_MAX_RATE_POWER;
	u8 f;
	अगर (freq < 3000)
		f = freq - 2300;
	अन्यथा
		f = (freq - 4800) / 5;

	क्रम (i = 0; i < AR5416_NUM_BAND_EDGES; i++) अणु
		अगर (edges[i].channel == 0xff)
			अवरोध;
		अगर (f == edges[i].channel) अणु
			/* exact freq match */
			rc = edges[i].घातer_flags & ~AR9170_CALCTL_EDGE_FLAGS;
			अवरोध;
		पूर्ण
		अगर (i > 0 && f < edges[i].channel) अणु
			अगर (f > edges[i - 1].channel &&
			    edges[i - 1].घातer_flags &
			    AR9170_CALCTL_EDGE_FLAGS) अणु
				/* lower channel has the inband flag set */
				rc = edges[i - 1].घातer_flags &
					~AR9170_CALCTL_EDGE_FLAGS;
			पूर्ण
			अवरोध;
		पूर्ण
	पूर्ण

	अगर (i == AR5416_NUM_BAND_EDGES) अणु
		अगर (f > edges[i - 1].channel &&
		    edges[i - 1].घातer_flags & AR9170_CALCTL_EDGE_FLAGS) अणु
			/* lower channel has the inband flag set */
			rc = edges[i - 1].घातer_flags &
				~AR9170_CALCTL_EDGE_FLAGS;
		पूर्ण
	पूर्ण
	वापस rc;
पूर्ण

अटल u8 carl9170_get_heavy_clip(काष्ठा ar9170 *ar, u32 freq,
	क्रमागत carl9170_bw bw, काष्ठा ar9170_calctl_edges edges[])
अणु
	u8 f;
	पूर्णांक i;
	u8 rc = 0;

	अगर (freq < 3000)
		f = freq - 2300;
	अन्यथा
		f = (freq - 4800) / 5;

	अगर (bw == CARL9170_BW_40_BELOW || bw == CARL9170_BW_40_ABOVE)
		rc |= 0xf0;

	क्रम (i = 0; i < AR5416_NUM_BAND_EDGES; i++) अणु
		अगर (edges[i].channel == 0xff)
			अवरोध;
		अगर (f == edges[i].channel) अणु
			अगर (!(edges[i].घातer_flags & AR9170_CALCTL_EDGE_FLAGS))
				rc |= 0x0f;
			अवरोध;
		पूर्ण
	पूर्ण

	वापस rc;
पूर्ण

/*
 * calculate the conक्रमmance test limits and the heavy clip parameter
 * and apply them to ar->घातer* (derived from otus hal/hpमुख्य.c, line 3706)
 */
अटल व्योम carl9170_calc_ctl(काष्ठा ar9170 *ar, u32 freq, क्रमागत carl9170_bw bw)
अणु
	u8 ctl_grp; /* CTL group */
	u8 ctl_idx; /* CTL index */
	पूर्णांक i, j;
	काष्ठा ctl_modes अणु
		u8 ctl_mode;
		u8 max_घातer;
		u8 *pwr_cal_data;
		पूर्णांक pwr_cal_len;
	पूर्ण *modes;

	/*
	 * order is relevant in the mode_list_*: we fall back to the
	 * lower indices अगर any mode is missed in the EEPROM.
	 */
	काष्ठा ctl_modes mode_list_2ghz[] = अणु
		अणु CTL_11B, 0, ar->घातer_2G_cck, 4 पूर्ण,
		अणु CTL_11G, 0, ar->घातer_2G_ofdm, 4 पूर्ण,
		अणु CTL_2GHT20, 0, ar->घातer_2G_ht20, 8 पूर्ण,
		अणु CTL_2GHT40, 0, ar->घातer_2G_ht40, 8 पूर्ण,
	पूर्ण;
	काष्ठा ctl_modes mode_list_5ghz[] = अणु
		अणु CTL_11A, 0, ar->घातer_5G_leg, 4 पूर्ण,
		अणु CTL_5GHT20, 0, ar->घातer_5G_ht20, 8 पूर्ण,
		अणु CTL_5GHT40, 0, ar->घातer_5G_ht40, 8 पूर्ण,
	पूर्ण;
	पूर्णांक nr_modes;

#घोषणा EDGES(c, n) (ar->eeprom.ctl_data[c].control_edges[n])

	ar->heavy_clip = 0;

	/*
	 * TODO: investigate the dअगरferences between OTUS'
	 * hpreg.c::zfHpGetRegulatoryDoमुख्य() and
	 * ath/regd.c::ath_regd_get_band_ctl() -
	 * e.g. क्रम FCC3_WORLD the OTUS procedure
	 * always वापसs CTL_FCC, जबतक the one in ath/ delivers
	 * CTL_ETSI क्रम 2GHz and CTL_FCC क्रम 5GHz.
	 */
	ctl_grp = ath_regd_get_band_ctl(&ar->common.regulatory,
					ar->hw->conf.chandef.chan->band);

	/* ctl group not found - either invalid band (NO_CTL) or ww roaming */
	अगर (ctl_grp == NO_CTL || ctl_grp == SD_NO_CTL)
		ctl_grp = CTL_FCC;

	अगर (ctl_grp != CTL_FCC)
		/* skip CTL and heavy clip क्रम CTL_MKK and CTL_ETSI */
		वापस;

	अगर (ar->hw->conf.chandef.chan->band == NL80211_BAND_2GHZ) अणु
		modes = mode_list_2ghz;
		nr_modes = ARRAY_SIZE(mode_list_2ghz);
	पूर्ण अन्यथा अणु
		modes = mode_list_5ghz;
		nr_modes = ARRAY_SIZE(mode_list_5ghz);
	पूर्ण

	क्रम (i = 0; i < nr_modes; i++) अणु
		u8 c = ctl_grp | modes[i].ctl_mode;
		क्रम (ctl_idx = 0; ctl_idx < AR5416_NUM_CTLS; ctl_idx++)
			अगर (c == ar->eeprom.ctl_index[ctl_idx])
				अवरोध;
		अगर (ctl_idx < AR5416_NUM_CTLS) अणु
			पूर्णांक f_off = 0;

			/*
			 * determine heavy clip parameter
			 * from the 11G edges array
			 */
			अगर (modes[i].ctl_mode == CTL_11G) अणु
				ar->heavy_clip =
					carl9170_get_heavy_clip(ar,
						freq, bw, EDGES(ctl_idx, 1));
			पूर्ण

			/* adjust freq क्रम 40MHz */
			अगर (modes[i].ctl_mode == CTL_2GHT40 ||
			    modes[i].ctl_mode == CTL_5GHT40) अणु
				अगर (bw == CARL9170_BW_40_BELOW)
					f_off = -10;
				अन्यथा
					f_off = 10;
			पूर्ण

			modes[i].max_घातer =
				carl9170_get_max_edge_घातer(ar,
					freq + f_off, EDGES(ctl_idx, 1));

			/*
			 * TODO: check अगर the regulatory max. घातer is
			 * controlled by cfg80211 क्रम DFS.
			 * (hpमुख्य applies it to max_घातer itself क्रम DFS freq)
			 */

		पूर्ण अन्यथा अणु
			/*
			 * Workaround in otus driver, hpमुख्य.c, line 3906:
			 * अगर no data क्रम 5GHT20 are found, take the
			 * legacy 5G value. We extend this here to fallback
			 * from any other HT* or 11G, too.
			 */
			पूर्णांक k = i;

			modes[i].max_घातer = AR5416_MAX_RATE_POWER;
			जबतक (k-- > 0) अणु
				अगर (modes[k].max_घातer !=
				    AR5416_MAX_RATE_POWER) अणु
					modes[i].max_घातer = modes[k].max_घातer;
					अवरोध;
				पूर्ण
			पूर्ण
		पूर्ण

		/* apply max घातer to pwr_cal_data (ar->घातer_*) */
		क्रम (j = 0; j < modes[i].pwr_cal_len; j++) अणु
			modes[i].pwr_cal_data[j] = min(modes[i].pwr_cal_data[j],
						       modes[i].max_घातer);
		पूर्ण
	पूर्ण

	अगर (ar->heavy_clip & 0xf0) अणु
		ar->घातer_2G_ht40[0]--;
		ar->घातer_2G_ht40[1]--;
		ar->घातer_2G_ht40[2]--;
	पूर्ण
	अगर (ar->heavy_clip & 0xf) अणु
		ar->घातer_2G_ht20[0]++;
		ar->घातer_2G_ht20[1]++;
		ar->घातer_2G_ht20[2]++;
	पूर्ण

#अघोषित EDGES
पूर्ण

अटल व्योम carl9170_set_घातer_cal(काष्ठा ar9170 *ar, u32 freq,
				   क्रमागत carl9170_bw bw)
अणु
	काष्ठा ar9170_calibration_target_घातer_legacy *ctpl;
	काष्ठा ar9170_calibration_target_घातer_ht *ctph;
	u8 *ctpres;
	पूर्णांक ntarमाला_लो;
	पूर्णांक idx, i, n;
	u8 f;
	u8 pwr_freqs[AR5416_MAX_NUM_TGT_PWRS];

	अगर (freq < 3000)
		f = freq - 2300;
	अन्यथा
		f = (freq - 4800) / 5;

	/*
	 * cycle through the various modes
	 *
	 * legacy modes first: 5G, 2G CCK, 2G OFDM
	 */
	क्रम (i = 0; i < 3; i++) अणु
		चयन (i) अणु
		हाल 0: /* 5 GHz legacy */
			ctpl = &ar->eeprom.cal_tgt_pwr_5G[0];
			ntarमाला_लो = AR5416_NUM_5G_TARGET_PWRS;
			ctpres = ar->घातer_5G_leg;
			अवरोध;
		हाल 1: /* 2.4 GHz CCK */
			ctpl = &ar->eeprom.cal_tgt_pwr_2G_cck[0];
			ntarमाला_लो = AR5416_NUM_2G_CCK_TARGET_PWRS;
			ctpres = ar->घातer_2G_cck;
			अवरोध;
		हाल 2: /* 2.4 GHz OFDM */
			ctpl = &ar->eeprom.cal_tgt_pwr_2G_ofdm[0];
			ntarमाला_लो = AR5416_NUM_2G_OFDM_TARGET_PWRS;
			ctpres = ar->घातer_2G_ofdm;
			अवरोध;
		शेष:
			BUG();
		पूर्ण

		क्रम (n = 0; n < ntarमाला_लो; n++) अणु
			अगर (ctpl[n].freq == 0xff)
				अवरोध;
			pwr_freqs[n] = ctpl[n].freq;
		पूर्ण
		ntarमाला_लो = n;
		idx = carl9170_find_freq_idx(ntarमाला_लो, pwr_freqs, f);
		क्रम (n = 0; n < 4; n++)
			ctpres[n] = carl9170_पूर्णांकerpolate_u8(f,
				ctpl[idx + 0].freq, ctpl[idx + 0].घातer[n],
				ctpl[idx + 1].freq, ctpl[idx + 1].घातer[n]);
	पूर्ण

	/* HT modes now: 5G HT20, 5G HT40, 2G CCK, 2G OFDM, 2G HT20, 2G HT40 */
	क्रम (i = 0; i < 4; i++) अणु
		चयन (i) अणु
		हाल 0: /* 5 GHz HT 20 */
			ctph = &ar->eeprom.cal_tgt_pwr_5G_ht20[0];
			ntarमाला_लो = AR5416_NUM_5G_TARGET_PWRS;
			ctpres = ar->घातer_5G_ht20;
			अवरोध;
		हाल 1: /* 5 GHz HT 40 */
			ctph = &ar->eeprom.cal_tgt_pwr_5G_ht40[0];
			ntarमाला_लो = AR5416_NUM_5G_TARGET_PWRS;
			ctpres = ar->घातer_5G_ht40;
			अवरोध;
		हाल 2: /* 2.4 GHz HT 20 */
			ctph = &ar->eeprom.cal_tgt_pwr_2G_ht20[0];
			ntarमाला_लो = AR5416_NUM_2G_OFDM_TARGET_PWRS;
			ctpres = ar->घातer_2G_ht20;
			अवरोध;
		हाल 3: /* 2.4 GHz HT 40 */
			ctph = &ar->eeprom.cal_tgt_pwr_2G_ht40[0];
			ntarमाला_लो = AR5416_NUM_2G_OFDM_TARGET_PWRS;
			ctpres = ar->घातer_2G_ht40;
			अवरोध;
		शेष:
			BUG();
		पूर्ण

		क्रम (n = 0; n < ntarमाला_लो; n++) अणु
			अगर (ctph[n].freq == 0xff)
				अवरोध;
			pwr_freqs[n] = ctph[n].freq;
		पूर्ण
		ntarमाला_लो = n;
		idx = carl9170_find_freq_idx(ntarमाला_लो, pwr_freqs, f);
		क्रम (n = 0; n < 8; n++)
			ctpres[n] = carl9170_पूर्णांकerpolate_u8(f,
				ctph[idx + 0].freq, ctph[idx + 0].घातer[n],
				ctph[idx + 1].freq, ctph[idx + 1].घातer[n]);
	पूर्ण

	/* calc. conक्रमmance test limits and apply to ar->घातer*[] */
	carl9170_calc_ctl(ar, freq, bw);
पूर्ण

पूर्णांक carl9170_get_noiseन्यूनमान(काष्ठा ar9170 *ar)
अणु
	अटल स्थिर u32 phy_regs[] = अणु
		AR9170_PHY_REG_CCA, AR9170_PHY_REG_CH2_CCA,
		AR9170_PHY_REG_EXT_CCA, AR9170_PHY_REG_CH2_EXT_CCA पूर्ण;
	u32 phy_res[ARRAY_SIZE(phy_regs)];
	पूर्णांक err, i;

	BUILD_BUG_ON(ARRAY_SIZE(phy_regs) != ARRAY_SIZE(ar->noise));

	err = carl9170_पढ़ो_mreg(ar, ARRAY_SIZE(phy_regs), phy_regs, phy_res);
	अगर (err)
		वापस err;

	क्रम (i = 0; i < 2; i++) अणु
		ar->noise[i] = sign_extend32(GET_VAL(
			AR9170_PHY_CCA_MIN_PWR, phy_res[i]), 8);

		ar->noise[i + 2] = sign_extend32(GET_VAL(
			AR9170_PHY_EXT_CCA_MIN_PWR, phy_res[i + 2]), 8);
	पूर्ण

	अगर (ar->channel)
		ar->survey[ar->channel->hw_value].noise = ar->noise[0];

	वापस 0;
पूर्ण

अटल क्रमागत carl9170_bw nl80211_to_carl(क्रमागत nl80211_channel_type type)
अणु
	चयन (type) अणु
	हाल NL80211_CHAN_NO_HT:
	हाल NL80211_CHAN_HT20:
		वापस CARL9170_BW_20;
	हाल NL80211_CHAN_HT40MINUS:
		वापस CARL9170_BW_40_BELOW;
	हाल NL80211_CHAN_HT40PLUS:
		वापस CARL9170_BW_40_ABOVE;
	शेष:
		BUG();
	पूर्ण
पूर्ण

पूर्णांक carl9170_set_channel(काष्ठा ar9170 *ar, काष्ठा ieee80211_channel *channel,
			 क्रमागत nl80211_channel_type _bw)
अणु
	स्थिर काष्ठा carl9170_phy_freq_params *freqpar;
	काष्ठा carl9170_rf_init_result rf_res;
	काष्ठा carl9170_rf_init rf;
	u32 पंचांगp, offs = 0, new_ht = 0;
	पूर्णांक err;
	क्रमागत carl9170_bw bw;
	काष्ठा ieee80211_channel *old_channel = शून्य;

	bw = nl80211_to_carl(_bw);

	अगर (conf_is_ht(&ar->hw->conf))
		new_ht |= CARL9170FW_PHY_HT_ENABLE;

	अगर (conf_is_ht40(&ar->hw->conf))
		new_ht |= CARL9170FW_PHY_HT_DYN2040;

	/* may be शून्य at first setup */
	अगर (ar->channel) अणु
		old_channel = ar->channel;
		ar->channel = शून्य;
	पूर्ण

	/* cold reset BB/ADDA */
	err = carl9170_ग_लिखो_reg(ar, AR9170_PWR_REG_RESET,
				 AR9170_PWR_RESET_BB_COLD_RESET);
	अगर (err)
		वापस err;

	err = carl9170_ग_लिखो_reg(ar, AR9170_PWR_REG_RESET, 0x0);
	अगर (err)
		वापस err;

	err = carl9170_init_phy(ar, channel->band);
	अगर (err)
		वापस err;

	err = carl9170_init_rf_banks_0_7(ar,
					 channel->band == NL80211_BAND_5GHZ);
	अगर (err)
		वापस err;

	err = carl9170_exec_cmd(ar, CARL9170_CMD_FREQ_START, 0, शून्य, 0, शून्य);
	अगर (err)
		वापस err;

	err = carl9170_ग_लिखो_reg(ar, AR9170_PHY_REG_HEAVY_CLIP_ENABLE,
				 0x200);
	अगर (err)
		वापस err;

	err = carl9170_init_rf_bank4_pwr(ar,
					 channel->band == NL80211_BAND_5GHZ,
					 channel->center_freq, bw);
	अगर (err)
		वापस err;

	पंचांगp = AR9170_PHY_TURBO_FC_SINGLE_HT_LTF1 |
	      AR9170_PHY_TURBO_FC_HT_EN;

	चयन (bw) अणु
	हाल CARL9170_BW_20:
		अवरोध;
	हाल CARL9170_BW_40_BELOW:
		पंचांगp |= AR9170_PHY_TURBO_FC_DYN2040_EN |
		       AR9170_PHY_TURBO_FC_SHORT_GI_40;
		offs = 3;
		अवरोध;
	हाल CARL9170_BW_40_ABOVE:
		पंचांगp |= AR9170_PHY_TURBO_FC_DYN2040_EN |
		       AR9170_PHY_TURBO_FC_SHORT_GI_40 |
		       AR9170_PHY_TURBO_FC_DYN2040_PRI_CH;
		offs = 1;
		अवरोध;
	शेष:
		BUG();
		वापस -ENOSYS;
	पूर्ण

	अगर (ar->eeprom.tx_mask != 1)
		पंचांगp |= AR9170_PHY_TURBO_FC_WALSH;

	err = carl9170_ग_लिखो_reg(ar, AR9170_PHY_REG_TURBO, पंचांगp);
	अगर (err)
		वापस err;

	err = carl9170_set_freq_cal_data(ar, channel);
	अगर (err)
		वापस err;

	carl9170_set_घातer_cal(ar, channel->center_freq, bw);

	err = carl9170_set_mac_tpc(ar, channel);
	अगर (err)
		वापस err;

	freqpar = carl9170_get_hw_dyn_params(channel, bw);

	rf.ht_settings = new_ht;
	अगर (conf_is_ht40(&ar->hw->conf))
		SET_VAL(CARL9170FW_PHY_HT_EXT_CHAN_OFF, rf.ht_settings, offs);

	rf.freq = cpu_to_le32(channel->center_freq * 1000);
	rf.delta_slope_coeff_exp = cpu_to_le32(freqpar->coeff_exp);
	rf.delta_slope_coeff_man = cpu_to_le32(freqpar->coeff_man);
	rf.delta_slope_coeff_exp_shgi = cpu_to_le32(freqpar->coeff_exp_shgi);
	rf.delta_slope_coeff_man_shgi = cpu_to_le32(freqpar->coeff_man_shgi);
	rf.finiteLoopCount = cpu_to_le32(2000);
	err = carl9170_exec_cmd(ar, CARL9170_CMD_RF_INIT, माप(rf), &rf,
				माप(rf_res), &rf_res);
	अगर (err)
		वापस err;

	err = le32_to_cpu(rf_res.ret);
	अगर (err != 0) अणु
		ar->chan_fail++;
		ar->total_chan_fail++;

		wiphy_err(ar->hw->wiphy, "channel change: %d -> %d "
			  "failed (%d).\n", old_channel ?
			  old_channel->center_freq : -1, channel->center_freq,
			  err);

		अगर (ar->chan_fail > 3) अणु
			/* We have tried very hard to change to _another_
			 * channel and we've failed to करो so!
			 * Chances are that the PHY/RF is no दीर्घer
			 * operable (due to corruptions/fatal events/bugs?)
			 * and we need to reset at a higher level.
			 */
			carl9170_restart(ar, CARL9170_RR_TOO_MANY_PHY_ERRORS);
			वापस 0;
		पूर्ण

		err = carl9170_set_channel(ar, channel, _bw);
		अगर (err)
			वापस err;
	पूर्ण अन्यथा अणु
		ar->chan_fail = 0;
	पूर्ण

	अगर (ar->heavy_clip) अणु
		err = carl9170_ग_लिखो_reg(ar, AR9170_PHY_REG_HEAVY_CLIP_ENABLE,
					 0x200 | ar->heavy_clip);
		अगर (err) अणु
			अगर (net_ratelimit()) अणु
				wiphy_err(ar->hw->wiphy, "failed to set "
				       "heavy clip\n");
			पूर्ण

			वापस err;
		पूर्ण
	पूर्ण

	ar->channel = channel;
	ar->ht_settings = new_ht;
	वापस 0;
पूर्ण
