<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
/*
 * arch/um/include/sysdep-x86_64/archसमलाँघ.स
 */

#अगर_अघोषित _KLIBC_ARCHSETJMP_H
#घोषणा _KLIBC_ARCHSETJMP_H

काष्ठा __लाँघ_बफ अणु
	अचिन्हित दीर्घ __rbx;
	अचिन्हित दीर्घ __rsp;
	अचिन्हित दीर्घ __rbp;
	अचिन्हित दीर्घ __r12;
	अचिन्हित दीर्घ __r13;
	अचिन्हित दीर्घ __r14;
	अचिन्हित दीर्घ __r15;
	अचिन्हित दीर्घ __rip;
पूर्ण;

प्रकार काष्ठा __लाँघ_बफ लाँघ_बफ[1];

#घोषणा JB_IP __rip
#घोषणा JB_SP __rsp

#पूर्ण_अगर				/* _SETJMP_H */
