<शैली गुरु>
#समावेश <linux/init.h>
#समावेश <linux/kernel.h>
#समावेश <linux/module.h>

#घोषणा क्रम_each_test(i, test)	\
	क्रम (i = 0; i < ARRAY_SIZE(test); i++)

काष्ठा test_fail अणु
	स्थिर अक्षर *str;
	अचिन्हित पूर्णांक base;
पूर्ण;

#घोषणा DEFINE_TEST_FAIL(test)	\
	स्थिर काष्ठा test_fail test[] __initस्थिर

#घोषणा DECLARE_TEST_OK(type, test_type)	\
	test_type अणु				\
		स्थिर अक्षर *str;		\
		अचिन्हित पूर्णांक base;		\
		type expected_res;		\
	पूर्ण

#घोषणा DEFINE_TEST_OK(type, test)	\
	स्थिर type test[] __initस्थिर

#घोषणा TEST_FAIL(fn, type, fmt, test)					\
अणु									\
	अचिन्हित पूर्णांक i;							\
									\
	क्रम_each_test(i, test) अणु					\
		स्थिर काष्ठा test_fail *t = &test[i];			\
		type पंचांगp;						\
		पूर्णांक rv;							\
									\
		पंचांगp = 0;						\
		rv = fn(t->str, t->base, &पंचांगp);				\
		अगर (rv >= 0) अणु						\
			WARN(1, "str '%s', base %u, expected -E, got %d/" fmt "\n",	\
				t->str, t->base, rv, पंचांगp);		\
			जारी;					\
		पूर्ण							\
	पूर्ण								\
पूर्ण

#घोषणा TEST_OK(fn, type, fmt, test)					\
अणु									\
	अचिन्हित पूर्णांक i;							\
									\
	क्रम_each_test(i, test) अणु					\
		स्थिर typeof(test[0]) *t = &test[i];			\
		type res;						\
		पूर्णांक rv;							\
									\
		rv = fn(t->str, t->base, &res);				\
		अगर (rv != 0) अणु						\
			WARN(1, "str '%s', base %u, expected 0/" fmt ", got %d\n",	\
				t->str, t->base, t->expected_res, rv);	\
			जारी;					\
		पूर्ण							\
		अगर (res != t->expected_res) अणु				\
			WARN(1, "str '%s', base %u, expected " fmt ", got " fmt "\n",	\
				t->str, t->base, t->expected_res, res);	\
			जारी;					\
		पूर्ण							\
	पूर्ण								\
पूर्ण

अटल व्योम __init test_kम_से_अदीर्घl_ok(व्योम)
अणु
	DECLARE_TEST_OK(अचिन्हित दीर्घ दीर्घ, काष्ठा test_ull);
	अटल DEFINE_TEST_OK(काष्ठा test_ull, test_ull_ok) = अणु
		अणु"0",	10,	0ULLपूर्ण,
		अणु"1",	10,	1ULLपूर्ण,
		अणु"127",	10,	127ULLपूर्ण,
		अणु"128",	10,	128ULLपूर्ण,
		अणु"129",	10,	129ULLपूर्ण,
		अणु"255",	10,	255ULLपूर्ण,
		अणु"256",	10,	256ULLपूर्ण,
		अणु"257",	10,	257ULLपूर्ण,
		अणु"32767",	10,	32767ULLपूर्ण,
		अणु"32768",	10,	32768ULLपूर्ण,
		अणु"32769",	10,	32769ULLपूर्ण,
		अणु"65535",	10,	65535ULLपूर्ण,
		अणु"65536",	10,	65536ULLपूर्ण,
		अणु"65537",	10,	65537ULLपूर्ण,
		अणु"2147483647",	10,	2147483647ULLपूर्ण,
		अणु"2147483648",	10,	2147483648ULLपूर्ण,
		अणु"2147483649",	10,	2147483649ULLपूर्ण,
		अणु"4294967295",	10,	4294967295ULLपूर्ण,
		अणु"4294967296",	10,	4294967296ULLपूर्ण,
		अणु"4294967297",	10,	4294967297ULLपूर्ण,
		अणु"9223372036854775807",	10,	9223372036854775807ULLपूर्ण,
		अणु"9223372036854775808",	10,	9223372036854775808ULLपूर्ण,
		अणु"9223372036854775809",	10,	9223372036854775809ULLपूर्ण,
		अणु"18446744073709551614",	10,	18446744073709551614ULLपूर्ण,
		अणु"18446744073709551615",	10,	18446744073709551615ULLपूर्ण,

		अणु"00",		8,	00ULLपूर्ण,
		अणु"01",		8,	01ULLपूर्ण,
		अणु"0177",	8,	0177ULLपूर्ण,
		अणु"0200",	8,	0200ULLपूर्ण,
		अणु"0201",	8,	0201ULLपूर्ण,
		अणु"0377",	8,	0377ULLपूर्ण,
		अणु"0400",	8,	0400ULLपूर्ण,
		अणु"0401",	8,	0401ULLपूर्ण,
		अणु"077777",	8,	077777ULLपूर्ण,
		अणु"0100000",	8,	0100000ULLपूर्ण,
		अणु"0100001",	8,	0100001ULLपूर्ण,
		अणु"0177777",	8,	0177777ULLपूर्ण,
		अणु"0200000",	8,	0200000ULLपूर्ण,
		अणु"0200001",	8,	0200001ULLपूर्ण,
		अणु"017777777777",	8,	017777777777ULLपूर्ण,
		अणु"020000000000",	8,	020000000000ULLपूर्ण,
		अणु"020000000001",	8,	020000000001ULLपूर्ण,
		अणु"037777777777",	8,	037777777777ULLपूर्ण,
		अणु"040000000000",	8,	040000000000ULLपूर्ण,
		अणु"040000000001",	8,	040000000001ULLपूर्ण,
		अणु"0777777777777777777777",	8,	0777777777777777777777ULLपूर्ण,
		अणु"01000000000000000000000",	8,	01000000000000000000000ULLपूर्ण,
		अणु"01000000000000000000001",	8,	01000000000000000000001ULLपूर्ण,
		अणु"01777777777777777777776",	8,	01777777777777777777776ULLपूर्ण,
		अणु"01777777777777777777777",	8,	01777777777777777777777ULLपूर्ण,

		अणु"0x0",		16,	0x0ULLपूर्ण,
		अणु"0x1",		16,	0x1ULLपूर्ण,
		अणु"0x7f",	16,	0x7fULLपूर्ण,
		अणु"0x80",	16,	0x80ULLपूर्ण,
		अणु"0x81",	16,	0x81ULLपूर्ण,
		अणु"0xff",	16,	0xffULLपूर्ण,
		अणु"0x100",	16,	0x100ULLपूर्ण,
		अणु"0x101",	16,	0x101ULLपूर्ण,
		अणु"0x7fff",	16,	0x7fffULLपूर्ण,
		अणु"0x8000",	16,	0x8000ULLपूर्ण,
		अणु"0x8001",	16,	0x8001ULLपूर्ण,
		अणु"0xffff",	16,	0xffffULLपूर्ण,
		अणु"0x10000",	16,	0x10000ULLपूर्ण,
		अणु"0x10001",	16,	0x10001ULLपूर्ण,
		अणु"0x7fffffff",	16,	0x7fffffffULLपूर्ण,
		अणु"0x80000000",	16,	0x80000000ULLपूर्ण,
		अणु"0x80000001",	16,	0x80000001ULLपूर्ण,
		अणु"0xffffffff",	16,	0xffffffffULLपूर्ण,
		अणु"0x100000000",	16,	0x100000000ULLपूर्ण,
		अणु"0x100000001",	16,	0x100000001ULLपूर्ण,
		अणु"0x7fffffffffffffff",	16,	0x7fffffffffffffffULLपूर्ण,
		अणु"0x8000000000000000",	16,	0x8000000000000000ULLपूर्ण,
		अणु"0x8000000000000001",	16,	0x8000000000000001ULLपूर्ण,
		अणु"0xfffffffffffffffe",	16,	0xfffffffffffffffeULLपूर्ण,
		अणु"0xffffffffffffffff",	16,	0xffffffffffffffffULLपूर्ण,

		अणु"0\n",	0,	0ULLपूर्ण,
	पूर्ण;
	TEST_OK(kम_से_अदीर्घl, अचिन्हित दीर्घ दीर्घ, "%llu", test_ull_ok);
पूर्ण

अटल व्योम __init test_kम_से_अदीर्घl_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_ull_fail) = अणु
		अणु"",	0पूर्ण,
		अणु"",	8पूर्ण,
		अणु"",	10पूर्ण,
		अणु"",	16पूर्ण,
		अणु"\n",	0पूर्ण,
		अणु"\n",	8पूर्ण,
		अणु"\n",	10पूर्ण,
		अणु"\n",	16पूर्ण,
		अणु"\n0",	0पूर्ण,
		अणु"\n0",	8पूर्ण,
		अणु"\n0",	10पूर्ण,
		अणु"\n0",	16पूर्ण,
		अणु"+",	0पूर्ण,
		अणु"+",	8पूर्ण,
		अणु"+",	10पूर्ण,
		अणु"+",	16पूर्ण,
		अणु"-",	0पूर्ण,
		अणु"-",	8पूर्ण,
		अणु"-",	10पूर्ण,
		अणु"-",	16पूर्ण,
		अणु"0x",	0पूर्ण,
		अणु"0x",	16पूर्ण,
		अणु"0X",	0पूर्ण,
		अणु"0X",	16पूर्ण,
		अणु"0 ",	0पूर्ण,
		अणु"1+",	0पूर्ण,
		अणु"1-",	0पूर्ण,
		अणु" 2",	0पूर्ण,
		/* base स्वतःdetection */
		अणु"0x0z",	0पूर्ण,
		अणु"0z",		0पूर्ण,
		अणु"a",		0पूर्ण,
		/* digit >= base */
		अणु"2",	2पूर्ण,
		अणु"8",	8पूर्ण,
		अणु"a",	10पूर्ण,
		अणु"A",	10पूर्ण,
		अणु"g",	16पूर्ण,
		अणु"G",	16पूर्ण,
		/* overflow */
		अणु"10000000000000000000000000000000000000000000000000000000000000000",	2पूर्ण,
		अणु"2000000000000000000000",	8पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"10000000000000000",	16पूर्ण,
		/* negative */
		अणु"-0", 0पूर्ण,
		अणु"-0", 8पूर्ण,
		अणु"-0", 10पूर्ण,
		अणु"-0", 16पूर्ण,
		अणु"-1", 0पूर्ण,
		अणु"-1", 8पूर्ण,
		अणु"-1", 10पूर्ण,
		अणु"-1", 16पूर्ण,
		/* sign is first अक्षरacter अगर any */
		अणु"-+1", 0पूर्ण,
		अणु"-+1", 8पूर्ण,
		अणु"-+1", 10पूर्ण,
		अणु"-+1", 16पूर्ण,
		/* nothing after \न */
		अणु"0\n0", 0पूर्ण,
		अणु"0\n0", 8पूर्ण,
		अणु"0\n0", 10पूर्ण,
		अणु"0\n0", 16पूर्ण,
		अणु"0\n+", 0पूर्ण,
		अणु"0\n+", 8पूर्ण,
		अणु"0\n+", 10पूर्ण,
		अणु"0\n+", 16पूर्ण,
		अणु"0\n-", 0पूर्ण,
		अणु"0\n-", 8पूर्ण,
		अणु"0\n-", 10पूर्ण,
		अणु"0\n-", 16पूर्ण,
		अणु"0\n ", 0पूर्ण,
		अणु"0\n ", 8पूर्ण,
		अणु"0\n ", 10पूर्ण,
		अणु"0\n ", 16पूर्ण,
	पूर्ण;
	TEST_FAIL(kम_से_अदीर्घl, अचिन्हित दीर्घ दीर्घ, "%llu", test_ull_fail);
पूर्ण

अटल व्योम __init test_kम_से_दीर्घl_ok(व्योम)
अणु
	DECLARE_TEST_OK(दीर्घ दीर्घ, काष्ठा test_ll);
	अटल DEFINE_TEST_OK(काष्ठा test_ll, test_ll_ok) = अणु
		अणु"0",	10,	0LLपूर्ण,
		अणु"1",	10,	1LLपूर्ण,
		अणु"127",	10,	127LLपूर्ण,
		अणु"128",	10,	128LLपूर्ण,
		अणु"129",	10,	129LLपूर्ण,
		अणु"255",	10,	255LLपूर्ण,
		अणु"256",	10,	256LLपूर्ण,
		अणु"257",	10,	257LLपूर्ण,
		अणु"32767",	10,	32767LLपूर्ण,
		अणु"32768",	10,	32768LLपूर्ण,
		अणु"32769",	10,	32769LLपूर्ण,
		अणु"65535",	10,	65535LLपूर्ण,
		अणु"65536",	10,	65536LLपूर्ण,
		अणु"65537",	10,	65537LLपूर्ण,
		अणु"2147483647",	10,	2147483647LLपूर्ण,
		अणु"2147483648",	10,	2147483648LLपूर्ण,
		अणु"2147483649",	10,	2147483649LLपूर्ण,
		अणु"4294967295",	10,	4294967295LLपूर्ण,
		अणु"4294967296",	10,	4294967296LLपूर्ण,
		अणु"4294967297",	10,	4294967297LLपूर्ण,
		अणु"9223372036854775807",	10,	9223372036854775807LLपूर्ण,

		अणु"-0",	10,	0LLपूर्ण,
		अणु"-1",	10,	-1LLपूर्ण,
		अणु"-2",	10,	-2LLपूर्ण,
		अणु"-9223372036854775808",	10,	Lदीर्घ_न्यूनपूर्ण,
	पूर्ण;
	TEST_OK(kम_से_दीर्घl, दीर्घ दीर्घ, "%lld", test_ll_ok);
पूर्ण

अटल व्योम __init test_kम_से_दीर्घl_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_ll_fail) = अणु
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"-9223372036854775809",	10पूर्ण,
		अणु"-18446744073709551614",	10पूर्ण,
		अणु"-18446744073709551615",	10पूर्ण,
		/* sign is first अक्षरacter अगर any */
		अणु"-+1", 0पूर्ण,
		अणु"-+1", 8पूर्ण,
		अणु"-+1", 10पूर्ण,
		अणु"-+1", 16पूर्ण,
	पूर्ण;
	TEST_FAIL(kम_से_दीर्घl, दीर्घ दीर्घ, "%lld", test_ll_fail);
पूर्ण

अटल व्योम __init test_kstrtou64_ok(व्योम)
अणु
	DECLARE_TEST_OK(u64, काष्ठा test_u64);
	अटल DEFINE_TEST_OK(काष्ठा test_u64, test_u64_ok) = अणु
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
		अणु"128",	10,	128पूर्ण,
		अणु"129",	10,	129पूर्ण,
		अणु"254",	10,	254पूर्ण,
		अणु"255",	10,	255पूर्ण,
		अणु"256",	10,	256पूर्ण,
		अणु"257",	10,	257पूर्ण,
		अणु"32766",	10,	32766पूर्ण,
		अणु"32767",	10,	32767पूर्ण,
		अणु"32768",	10,	32768पूर्ण,
		अणु"32769",	10,	32769पूर्ण,
		अणु"65534",	10,	65534पूर्ण,
		अणु"65535",	10,	65535पूर्ण,
		अणु"65536",	10,	65536पूर्ण,
		अणु"65537",	10,	65537पूर्ण,
		अणु"2147483646",	10,	2147483646पूर्ण,
		अणु"2147483647",	10,	2147483647पूर्ण,
		अणु"2147483648",	10,	2147483648ULLपूर्ण,
		अणु"2147483649",	10,	2147483649ULLपूर्ण,
		अणु"4294967294",	10,	4294967294ULLपूर्ण,
		अणु"4294967295",	10,	4294967295ULLपूर्ण,
		अणु"4294967296",	10,	4294967296ULLपूर्ण,
		अणु"4294967297",	10,	4294967297ULLपूर्ण,
		अणु"9223372036854775806",	10,	9223372036854775806ULLपूर्ण,
		अणु"9223372036854775807",	10,	9223372036854775807ULLपूर्ण,
		अणु"9223372036854775808",	10,	9223372036854775808ULLपूर्ण,
		अणु"9223372036854775809",	10,	9223372036854775809ULLपूर्ण,
		अणु"18446744073709551614",	10,	18446744073709551614ULLपूर्ण,
		अणु"18446744073709551615",	10,	18446744073709551615ULLपूर्ण,
	पूर्ण;
	TEST_OK(kstrtou64, u64, "%llu", test_u64_ok);
पूर्ण

अटल व्योम __init test_kstrtou64_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_u64_fail) = अणु
		अणु"-2",	10पूर्ण,
		अणु"-1",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtou64, u64, "%llu", test_u64_fail);
पूर्ण

अटल व्योम __init test_kstrtos64_ok(व्योम)
अणु
	DECLARE_TEST_OK(s64, काष्ठा test_s64);
	अटल DEFINE_TEST_OK(काष्ठा test_s64, test_s64_ok) = अणु
		अणु"-128",	10,	-128पूर्ण,
		अणु"-127",	10,	-127पूर्ण,
		अणु"-1",	10,	-1पूर्ण,
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
		अणु"128",	10,	128पूर्ण,
		अणु"129",	10,	129पूर्ण,
		अणु"254",	10,	254पूर्ण,
		अणु"255",	10,	255पूर्ण,
		अणु"256",	10,	256पूर्ण,
		अणु"257",	10,	257पूर्ण,
		अणु"32766",	10,	32766पूर्ण,
		अणु"32767",	10,	32767पूर्ण,
		अणु"32768",	10,	32768पूर्ण,
		अणु"32769",	10,	32769पूर्ण,
		अणु"65534",	10,	65534पूर्ण,
		अणु"65535",	10,	65535पूर्ण,
		अणु"65536",	10,	65536पूर्ण,
		अणु"65537",	10,	65537पूर्ण,
		अणु"2147483646",	10,	2147483646पूर्ण,
		अणु"2147483647",	10,	2147483647पूर्ण,
		अणु"2147483648",	10,	2147483648LLपूर्ण,
		अणु"2147483649",	10,	2147483649LLपूर्ण,
		अणु"4294967294",	10,	4294967294LLपूर्ण,
		अणु"4294967295",	10,	4294967295LLपूर्ण,
		अणु"4294967296",	10,	4294967296LLपूर्ण,
		अणु"4294967297",	10,	4294967297LLपूर्ण,
		अणु"9223372036854775806",	10,	9223372036854775806LLपूर्ण,
		अणु"9223372036854775807",	10,	9223372036854775807LLपूर्ण,
	पूर्ण;
	TEST_OK(kstrtos64, s64, "%lld", test_s64_ok);
पूर्ण

अटल व्योम __init test_kstrtos64_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_s64_fail) = अणु
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtos64, s64, "%lld", test_s64_fail);
पूर्ण

अटल व्योम __init test_kstrtou32_ok(व्योम)
अणु
	DECLARE_TEST_OK(u32, काष्ठा test_u32);
	अटल DEFINE_TEST_OK(काष्ठा test_u32, test_u32_ok) = अणु
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
		अणु"128",	10,	128पूर्ण,
		अणु"129",	10,	129पूर्ण,
		अणु"254",	10,	254पूर्ण,
		अणु"255",	10,	255पूर्ण,
		अणु"256",	10,	256पूर्ण,
		अणु"257",	10,	257पूर्ण,
		अणु"32766",	10,	32766पूर्ण,
		अणु"32767",	10,	32767पूर्ण,
		अणु"32768",	10,	32768पूर्ण,
		अणु"32769",	10,	32769पूर्ण,
		अणु"65534",	10,	65534पूर्ण,
		अणु"65535",	10,	65535पूर्ण,
		अणु"65536",	10,	65536पूर्ण,
		अणु"65537",	10,	65537पूर्ण,
		अणु"2147483646",	10,	2147483646पूर्ण,
		अणु"2147483647",	10,	2147483647पूर्ण,
		अणु"2147483648",	10,	2147483648Uपूर्ण,
		अणु"2147483649",	10,	2147483649Uपूर्ण,
		अणु"4294967294",	10,	4294967294Uपूर्ण,
		अणु"4294967295",	10,	4294967295Uपूर्ण,
	पूर्ण;
	TEST_OK(kstrtou32, u32, "%u", test_u32_ok);
पूर्ण

अटल व्योम __init test_kstrtou32_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_u32_fail) = अणु
		अणु"-2",	10पूर्ण,
		अणु"-1",	10पूर्ण,
		अणु"4294967296",	10पूर्ण,
		अणु"4294967297",	10पूर्ण,
		अणु"9223372036854775806",	10पूर्ण,
		अणु"9223372036854775807",	10पूर्ण,
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtou32, u32, "%u", test_u32_fail);
पूर्ण

अटल व्योम __init test_kstrtos32_ok(व्योम)
अणु
	DECLARE_TEST_OK(s32, काष्ठा test_s32);
	अटल DEFINE_TEST_OK(काष्ठा test_s32, test_s32_ok) = अणु
		अणु"-128",	10,	-128पूर्ण,
		अणु"-127",	10,	-127पूर्ण,
		अणु"-1",	10,	-1पूर्ण,
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
		अणु"128",	10,	128पूर्ण,
		अणु"129",	10,	129पूर्ण,
		अणु"254",	10,	254पूर्ण,
		अणु"255",	10,	255पूर्ण,
		अणु"256",	10,	256पूर्ण,
		अणु"257",	10,	257पूर्ण,
		अणु"32766",	10,	32766पूर्ण,
		अणु"32767",	10,	32767पूर्ण,
		अणु"32768",	10,	32768पूर्ण,
		अणु"32769",	10,	32769पूर्ण,
		अणु"65534",	10,	65534पूर्ण,
		अणु"65535",	10,	65535पूर्ण,
		अणु"65536",	10,	65536पूर्ण,
		अणु"65537",	10,	65537पूर्ण,
		अणु"2147483646",	10,	2147483646पूर्ण,
		अणु"2147483647",	10,	2147483647पूर्ण,
	पूर्ण;
	TEST_OK(kstrtos32, s32, "%d", test_s32_ok);
पूर्ण

अटल व्योम __init test_kstrtos32_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_s32_fail) = अणु
		अणु"2147483648",	10पूर्ण,
		अणु"2147483649",	10पूर्ण,
		अणु"4294967294",	10पूर्ण,
		अणु"4294967295",	10पूर्ण,
		अणु"4294967296",	10पूर्ण,
		अणु"4294967297",	10पूर्ण,
		अणु"9223372036854775806",	10पूर्ण,
		अणु"9223372036854775807",	10पूर्ण,
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtos32, s32, "%d", test_s32_fail);
पूर्ण

अटल व्योम __init test_kstrtou16_ok(व्योम)
अणु
	DECLARE_TEST_OK(u16, काष्ठा test_u16);
	अटल DEFINE_TEST_OK(काष्ठा test_u16, test_u16_ok) = अणु
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
		अणु"128",	10,	128पूर्ण,
		अणु"129",	10,	129पूर्ण,
		अणु"254",	10,	254पूर्ण,
		अणु"255",	10,	255पूर्ण,
		अणु"256",	10,	256पूर्ण,
		अणु"257",	10,	257पूर्ण,
		अणु"32766",	10,	32766पूर्ण,
		अणु"32767",	10,	32767पूर्ण,
		अणु"32768",	10,	32768पूर्ण,
		अणु"32769",	10,	32769पूर्ण,
		अणु"65534",	10,	65534पूर्ण,
		अणु"65535",	10,	65535पूर्ण,
	पूर्ण;
	TEST_OK(kstrtou16, u16, "%hu", test_u16_ok);
पूर्ण

अटल व्योम __init test_kstrtou16_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_u16_fail) = अणु
		अणु"-2",	10पूर्ण,
		अणु"-1",	10पूर्ण,
		अणु"65536",	10पूर्ण,
		अणु"65537",	10पूर्ण,
		अणु"2147483646",	10पूर्ण,
		अणु"2147483647",	10पूर्ण,
		अणु"2147483648",	10पूर्ण,
		अणु"2147483649",	10पूर्ण,
		अणु"4294967294",	10पूर्ण,
		अणु"4294967295",	10पूर्ण,
		अणु"4294967296",	10पूर्ण,
		अणु"4294967297",	10पूर्ण,
		अणु"9223372036854775806",	10पूर्ण,
		अणु"9223372036854775807",	10पूर्ण,
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtou16, u16, "%hu", test_u16_fail);
पूर्ण

अटल व्योम __init test_kstrtos16_ok(व्योम)
अणु
	DECLARE_TEST_OK(s16, काष्ठा test_s16);
	अटल DEFINE_TEST_OK(काष्ठा test_s16, test_s16_ok) = अणु
		अणु"-130",	10,	-130पूर्ण,
		अणु"-129",	10,	-129पूर्ण,
		अणु"-128",	10,	-128पूर्ण,
		अणु"-127",	10,	-127पूर्ण,
		अणु"-1",	10,	-1पूर्ण,
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
		अणु"128",	10,	128पूर्ण,
		अणु"129",	10,	129पूर्ण,
		अणु"254",	10,	254पूर्ण,
		अणु"255",	10,	255पूर्ण,
		अणु"256",	10,	256पूर्ण,
		अणु"257",	10,	257पूर्ण,
		अणु"32766",	10,	32766पूर्ण,
		अणु"32767",	10,	32767पूर्ण,
	पूर्ण;
	TEST_OK(kstrtos16, s16, "%hd", test_s16_ok);
पूर्ण

अटल व्योम __init test_kstrtos16_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_s16_fail) = अणु
		अणु"32768",	10पूर्ण,
		अणु"32769",	10पूर्ण,
		अणु"65534",	10पूर्ण,
		अणु"65535",	10पूर्ण,
		अणु"65536",	10पूर्ण,
		अणु"65537",	10पूर्ण,
		अणु"2147483646",	10पूर्ण,
		अणु"2147483647",	10पूर्ण,
		अणु"2147483648",	10पूर्ण,
		अणु"2147483649",	10पूर्ण,
		अणु"4294967294",	10पूर्ण,
		अणु"4294967295",	10पूर्ण,
		अणु"4294967296",	10पूर्ण,
		अणु"4294967297",	10पूर्ण,
		अणु"9223372036854775806",	10पूर्ण,
		अणु"9223372036854775807",	10पूर्ण,
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtos16, s16, "%hd", test_s16_fail);
पूर्ण

अटल व्योम __init test_kstrtou8_ok(व्योम)
अणु
	DECLARE_TEST_OK(u8, काष्ठा test_u8);
	अटल DEFINE_TEST_OK(काष्ठा test_u8, test_u8_ok) = अणु
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
		अणु"128",	10,	128पूर्ण,
		अणु"129",	10,	129पूर्ण,
		अणु"254",	10,	254पूर्ण,
		अणु"255",	10,	255पूर्ण,
	पूर्ण;
	TEST_OK(kstrtou8, u8, "%hhu", test_u8_ok);
पूर्ण

अटल व्योम __init test_kstrtou8_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_u8_fail) = अणु
		अणु"-2",	10पूर्ण,
		अणु"-1",	10पूर्ण,
		अणु"256",	10पूर्ण,
		अणु"257",	10पूर्ण,
		अणु"32766",	10पूर्ण,
		अणु"32767",	10पूर्ण,
		अणु"32768",	10पूर्ण,
		अणु"32769",	10पूर्ण,
		अणु"65534",	10पूर्ण,
		अणु"65535",	10पूर्ण,
		अणु"65536",	10पूर्ण,
		अणु"65537",	10पूर्ण,
		अणु"2147483646",	10पूर्ण,
		अणु"2147483647",	10पूर्ण,
		अणु"2147483648",	10पूर्ण,
		अणु"2147483649",	10पूर्ण,
		अणु"4294967294",	10पूर्ण,
		अणु"4294967295",	10पूर्ण,
		अणु"4294967296",	10पूर्ण,
		अणु"4294967297",	10पूर्ण,
		अणु"9223372036854775806",	10पूर्ण,
		अणु"9223372036854775807",	10पूर्ण,
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtou8, u8, "%hhu", test_u8_fail);
पूर्ण

अटल व्योम __init test_kstrtos8_ok(व्योम)
अणु
	DECLARE_TEST_OK(s8, काष्ठा test_s8);
	अटल DEFINE_TEST_OK(काष्ठा test_s8, test_s8_ok) = अणु
		अणु"-128",	10,	-128पूर्ण,
		अणु"-127",	10,	-127पूर्ण,
		अणु"-1",	10,	-1पूर्ण,
		अणु"0",	10,	0पूर्ण,
		अणु"1",	10,	1पूर्ण,
		अणु"126",	10,	126पूर्ण,
		अणु"127",	10,	127पूर्ण,
	पूर्ण;
	TEST_OK(kstrtos8, s8, "%hhd", test_s8_ok);
पूर्ण

अटल व्योम __init test_kstrtos8_fail(व्योम)
अणु
	अटल DEFINE_TEST_FAIL(test_s8_fail) = अणु
		अणु"-130",	10पूर्ण,
		अणु"-129",	10पूर्ण,
		अणु"128",	10पूर्ण,
		अणु"129",	10पूर्ण,
		अणु"254",	10पूर्ण,
		अणु"255",	10पूर्ण,
		अणु"256",	10पूर्ण,
		अणु"257",	10पूर्ण,
		अणु"32766",	10पूर्ण,
		अणु"32767",	10पूर्ण,
		अणु"32768",	10पूर्ण,
		अणु"32769",	10पूर्ण,
		अणु"65534",	10पूर्ण,
		अणु"65535",	10पूर्ण,
		अणु"65536",	10पूर्ण,
		अणु"65537",	10पूर्ण,
		अणु"2147483646",	10पूर्ण,
		अणु"2147483647",	10पूर्ण,
		अणु"2147483648",	10पूर्ण,
		अणु"2147483649",	10पूर्ण,
		अणु"4294967294",	10पूर्ण,
		अणु"4294967295",	10पूर्ण,
		अणु"4294967296",	10पूर्ण,
		अणु"4294967297",	10पूर्ण,
		अणु"9223372036854775806",	10पूर्ण,
		अणु"9223372036854775807",	10पूर्ण,
		अणु"9223372036854775808",	10पूर्ण,
		अणु"9223372036854775809",	10पूर्ण,
		अणु"18446744073709551614",	10पूर्ण,
		अणु"18446744073709551615",	10पूर्ण,
		अणु"18446744073709551616",	10पूर्ण,
		अणु"18446744073709551617",	10पूर्ण,
	पूर्ण;
	TEST_FAIL(kstrtos8, s8, "%hhd", test_s8_fail);
पूर्ण

अटल पूर्णांक __init test_kstrtox_init(व्योम)
अणु
	test_kम_से_अदीर्घl_ok();
	test_kम_से_अदीर्घl_fail();
	test_kम_से_दीर्घl_ok();
	test_kम_से_दीर्घl_fail();

	test_kstrtou64_ok();
	test_kstrtou64_fail();
	test_kstrtos64_ok();
	test_kstrtos64_fail();

	test_kstrtou32_ok();
	test_kstrtou32_fail();
	test_kstrtos32_ok();
	test_kstrtos32_fail();

	test_kstrtou16_ok();
	test_kstrtou16_fail();
	test_kstrtos16_ok();
	test_kstrtos16_fail();

	test_kstrtou8_ok();
	test_kstrtou8_fail();
	test_kstrtos8_ok();
	test_kstrtos8_fail();
	वापस -EINVAL;
पूर्ण
module_init(test_kstrtox_init);
MODULE_LICENSE("Dual BSD/GPL");
