<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0-or-later
/*
 */

#समावेश <linux/module.h>
#समावेश <linux/libgcc.h>

word_type notrace __ucmpdi2(अचिन्हित दीर्घ दीर्घ a, अचिन्हित दीर्घ दीर्घ b)
अणु
	स्थिर DWजोड़ au = अणु.ll = aपूर्ण;
	स्थिर DWजोड़ bu = अणु.ll = bपूर्ण;

	अगर ((अचिन्हित पूर्णांक) au.s.high < (अचिन्हित पूर्णांक) bu.s.high)
		वापस 0;
	अन्यथा अगर ((अचिन्हित पूर्णांक) au.s.high > (अचिन्हित पूर्णांक) bu.s.high)
		वापस 2;
	अगर ((अचिन्हित पूर्णांक) au.s.low < (अचिन्हित पूर्णांक) bu.s.low)
		वापस 0;
	अन्यथा अगर ((अचिन्हित पूर्णांक) au.s.low > (अचिन्हित पूर्णांक) bu.s.low)
		वापस 2;
	वापस 1;
पूर्ण
EXPORT_SYMBOL(__ucmpdi2);
