<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
/******************************************************************************
*
* Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
*
******************************************************************************/

#अगर_अघोषित __INC_MP_RF_HW_IMG_8723B_H
#घोषणा __INC_MP_RF_HW_IMG_8723B_H


/******************************************************************************
*                           RadioA.TXT
******************************************************************************/

व्योम
ODM_ReadAndConfig_MP_8723B_RadioA(/*  TC: Test Chip, MP: MP Chip */
	काष्ठा dm_odm_t *pDM_Odm
);

/******************************************************************************
*                           TxPowerTrack_SDIO.TXT
******************************************************************************/

व्योम
ODM_ReadAndConfig_MP_8723B_TxPowerTrack_SDIO(/*  TC: Test Chip, MP: MP Chip */
	काष्ठा dm_odm_t *pDM_Odm
);
u32 ODM_GetVersion_MP_8723B_TxPowerTrack_SDIO(व्योम);

/******************************************************************************
*                           TXPWR_LMT.TXT
******************************************************************************/

व्योम
ODM_ReadAndConfig_MP_8723B_TXPWR_LMT(/*  TC: Test Chip, MP: MP Chip */
	काष्ठा dm_odm_t *pDM_Odm
);
u32 ODM_GetVersion_MP_8723B_TXPWR_LMT(व्योम);

#पूर्ण_अगर
