<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
/******************************************************************************
*
* Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
*
******************************************************************************/

#अगर_अघोषित __INC_MP_BB_HW_IMG_8723B_H
#घोषणा __INC_MP_BB_HW_IMG_8723B_H


/******************************************************************************
*                           AGC_TAB.TXT
******************************************************************************/

व्योम
ODM_ReadAndConfig_MP_8723B_AGC_TAB(/*  TC: Test Chip, MP: MP Chip */
	काष्ठा dm_odm_t *pDM_Odm
);

/******************************************************************************
*                           PHY_REG.TXT
******************************************************************************/

व्योम
ODM_ReadAndConfig_MP_8723B_PHY_REG(/*  TC: Test Chip, MP: MP Chip */
	काष्ठा dm_odm_t *pDM_Odm
);

/******************************************************************************
*                           PHY_REG_PG.TXT
******************************************************************************/

व्योम
ODM_ReadAndConfig_MP_8723B_PHY_REG_PG(/*  TC: Test Chip, MP: MP Chip */
	काष्ठा dm_odm_t *pDM_Odm
);
u32 ODM_GetVersion_MP_8723B_PHY_REG_PG(व्योम);

#पूर्ण_अगर
