<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _ASM_IA64_ASM_PROTOTYPES_H
#घोषणा _ASM_IA64_ASM_PROTOTYPES_H

#समावेश <यंत्र/cacheflush.h>
#समावेश <यंत्र/checksum.h>
#समावेश <यंत्र/esi.h>
#समावेश <यंत्र/ftrace.h>
#समावेश <यंत्र/page.h>
#समावेश <यंत्र/pal.h>
#समावेश <यंत्र/माला.स>
#समावेश <linux/uaccess.h>
#समावेश <यंत्र/unwind.h>
#समावेश <यंत्र/xor.h>

बाह्य स्थिर अक्षर ia64_ivt[];

चिन्हित पूर्णांक __भागsi3(चिन्हित पूर्णांक, अचिन्हित पूर्णांक);
चिन्हित पूर्णांक __modsi3(चिन्हित पूर्णांक, अचिन्हित पूर्णांक);

चिन्हित दीर्घ दीर्घ __भागdi3(चिन्हित दीर्घ दीर्घ, अचिन्हित दीर्घ दीर्घ);
चिन्हित दीर्घ दीर्घ __moddi3(चिन्हित दीर्घ दीर्घ, अचिन्हित दीर्घ दीर्घ);

अचिन्हित पूर्णांक __uभागsi3(अचिन्हित पूर्णांक, अचिन्हित पूर्णांक);
अचिन्हित पूर्णांक __umodsi3(अचिन्हित पूर्णांक, अचिन्हित पूर्णांक);

अचिन्हित दीर्घ दीर्घ __uभागdi3(अचिन्हित दीर्घ दीर्घ, अचिन्हित दीर्घ दीर्घ);
अचिन्हित दीर्घ दीर्घ __umoddi3(अचिन्हित दीर्घ दीर्घ, अचिन्हित दीर्घ दीर्घ);

#पूर्ण_अगर /* _ASM_IA64_ASM_PROTOTYPES_H */
