<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
/*
 * definition क्रम paraभव devices on s390
 *
 * Copyright IBM Corp. 2008
 *
 *    Author(s): Christian Borntraeger <borntraeger@de.ibm.com>
 */
/*
 * Hypercalls क्रम KVM on s390. The calling convention is similar to the
 * s390 ABI, so we use R2-R6 क्रम parameters 1-5. In addition we use R1
 * as hypercall number and R7 as parameter 6. The वापस value is
 * written to R2. We use the diagnose inकाष्ठाion as hypercall. To aव्योम
 * conflicts with existing diagnoses क्रम LPAR and z/VM, we करो not use
 * the inकाष्ठाion encoded number, but specअगरy the number in R1 and
 * use 0x500 as KVM hypercall
 *
 * Copyright IBM Corp. 2007,2008
 * Author(s): Christian Borntraeger <borntraeger@de.ibm.com>
 */
#अगर_अघोषित __S390_KVM_PARA_H
#घोषणा __S390_KVM_PARA_H

#समावेश <uapi/यंत्र/kvm_para.h>
#समावेश <यंत्र/diag.h>

अटल अंतरभूत दीर्घ __kvm_hypercall0(अचिन्हित दीर्घ nr)
अणु
	रेजिस्टर अचिन्हित दीर्घ __nr यंत्र("1") = nr;
	रेजिस्टर दीर्घ __rc यंत्र("2");

	यंत्र अस्थिर ("diag 2,4,0x500\n"
		      : "=d" (__rc) : "d" (__nr): "memory", "cc");
	वापस __rc;
पूर्ण

अटल अंतरभूत दीर्घ kvm_hypercall0(अचिन्हित दीर्घ nr)
अणु
	diag_stat_inc(DIAG_STAT_X500);
	वापस __kvm_hypercall0(nr);
पूर्ण

अटल अंतरभूत दीर्घ __kvm_hypercall1(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1)
अणु
	रेजिस्टर अचिन्हित दीर्घ __nr यंत्र("1") = nr;
	रेजिस्टर अचिन्हित दीर्घ __p1 यंत्र("2") = p1;
	रेजिस्टर दीर्घ __rc यंत्र("2");

	यंत्र अस्थिर ("diag 2,4,0x500\n"
		      : "=d" (__rc) : "d" (__nr), "0" (__p1) : "memory", "cc");
	वापस __rc;
पूर्ण

अटल अंतरभूत दीर्घ kvm_hypercall1(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1)
अणु
	diag_stat_inc(DIAG_STAT_X500);
	वापस __kvm_hypercall1(nr, p1);
पूर्ण

अटल अंतरभूत दीर्घ __kvm_hypercall2(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2)
अणु
	रेजिस्टर अचिन्हित दीर्घ __nr यंत्र("1") = nr;
	रेजिस्टर अचिन्हित दीर्घ __p1 यंत्र("2") = p1;
	रेजिस्टर अचिन्हित दीर्घ __p2 यंत्र("3") = p2;
	रेजिस्टर दीर्घ __rc यंत्र("2");

	यंत्र अस्थिर ("diag 2,4,0x500\n"
		      : "=d" (__rc) : "d" (__nr), "0" (__p1), "d" (__p2)
		      : "memory", "cc");
	वापस __rc;
पूर्ण

अटल अंतरभूत दीर्घ kvm_hypercall2(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2)
अणु
	diag_stat_inc(DIAG_STAT_X500);
	वापस __kvm_hypercall2(nr, p1, p2);
पूर्ण

अटल अंतरभूत दीर्घ __kvm_hypercall3(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3)
अणु
	रेजिस्टर अचिन्हित दीर्घ __nr यंत्र("1") = nr;
	रेजिस्टर अचिन्हित दीर्घ __p1 यंत्र("2") = p1;
	रेजिस्टर अचिन्हित दीर्घ __p2 यंत्र("3") = p2;
	रेजिस्टर अचिन्हित दीर्घ __p3 यंत्र("4") = p3;
	रेजिस्टर दीर्घ __rc यंत्र("2");

	यंत्र अस्थिर ("diag 2,4,0x500\n"
		      : "=d" (__rc) : "d" (__nr), "0" (__p1), "d" (__p2),
			"d" (__p3) : "memory", "cc");
	वापस __rc;
पूर्ण

अटल अंतरभूत दीर्घ kvm_hypercall3(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3)
अणु
	diag_stat_inc(DIAG_STAT_X500);
	वापस __kvm_hypercall3(nr, p1, p2, p3);
पूर्ण

अटल अंतरभूत दीर्घ __kvm_hypercall4(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3,
			       अचिन्हित दीर्घ p4)
अणु
	रेजिस्टर अचिन्हित दीर्घ __nr यंत्र("1") = nr;
	रेजिस्टर अचिन्हित दीर्घ __p1 यंत्र("2") = p1;
	रेजिस्टर अचिन्हित दीर्घ __p2 यंत्र("3") = p2;
	रेजिस्टर अचिन्हित दीर्घ __p3 यंत्र("4") = p3;
	रेजिस्टर अचिन्हित दीर्घ __p4 यंत्र("5") = p4;
	रेजिस्टर दीर्घ __rc यंत्र("2");

	यंत्र अस्थिर ("diag 2,4,0x500\n"
		      : "=d" (__rc) : "d" (__nr), "0" (__p1), "d" (__p2),
			"d" (__p3), "d" (__p4) : "memory", "cc");
	वापस __rc;
पूर्ण

अटल अंतरभूत दीर्घ kvm_hypercall4(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3,
			       अचिन्हित दीर्घ p4)
अणु
	diag_stat_inc(DIAG_STAT_X500);
	वापस __kvm_hypercall4(nr, p1, p2, p3, p4);
पूर्ण

अटल अंतरभूत दीर्घ __kvm_hypercall5(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3,
			       अचिन्हित दीर्घ p4, अचिन्हित दीर्घ p5)
अणु
	रेजिस्टर अचिन्हित दीर्घ __nr यंत्र("1") = nr;
	रेजिस्टर अचिन्हित दीर्घ __p1 यंत्र("2") = p1;
	रेजिस्टर अचिन्हित दीर्घ __p2 यंत्र("3") = p2;
	रेजिस्टर अचिन्हित दीर्घ __p3 यंत्र("4") = p3;
	रेजिस्टर अचिन्हित दीर्घ __p4 यंत्र("5") = p4;
	रेजिस्टर अचिन्हित दीर्घ __p5 यंत्र("6") = p5;
	रेजिस्टर दीर्घ __rc यंत्र("2");

	यंत्र अस्थिर ("diag 2,4,0x500\n"
		      : "=d" (__rc) : "d" (__nr), "0" (__p1), "d" (__p2),
			"d" (__p3), "d" (__p4), "d" (__p5)  : "memory", "cc");
	वापस __rc;
पूर्ण

अटल अंतरभूत दीर्घ kvm_hypercall5(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3,
			       अचिन्हित दीर्घ p4, अचिन्हित दीर्घ p5)
अणु
	diag_stat_inc(DIAG_STAT_X500);
	वापस __kvm_hypercall5(nr, p1, p2, p3, p4, p5);
पूर्ण

अटल अंतरभूत दीर्घ __kvm_hypercall6(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3,
			       अचिन्हित दीर्घ p4, अचिन्हित दीर्घ p5,
			       अचिन्हित दीर्घ p6)
अणु
	रेजिस्टर अचिन्हित दीर्घ __nr यंत्र("1") = nr;
	रेजिस्टर अचिन्हित दीर्घ __p1 यंत्र("2") = p1;
	रेजिस्टर अचिन्हित दीर्घ __p2 यंत्र("3") = p2;
	रेजिस्टर अचिन्हित दीर्घ __p3 यंत्र("4") = p3;
	रेजिस्टर अचिन्हित दीर्घ __p4 यंत्र("5") = p4;
	रेजिस्टर अचिन्हित दीर्घ __p5 यंत्र("6") = p5;
	रेजिस्टर अचिन्हित दीर्घ __p6 यंत्र("7") = p6;
	रेजिस्टर दीर्घ __rc यंत्र("2");

	यंत्र अस्थिर ("diag 2,4,0x500\n"
		      : "=d" (__rc) : "d" (__nr), "0" (__p1), "d" (__p2),
			"d" (__p3), "d" (__p4), "d" (__p5), "d" (__p6)
		      : "memory", "cc");
	वापस __rc;
पूर्ण

अटल अंतरभूत दीर्घ kvm_hypercall6(अचिन्हित दीर्घ nr, अचिन्हित दीर्घ p1,
			       अचिन्हित दीर्घ p2, अचिन्हित दीर्घ p3,
			       अचिन्हित दीर्घ p4, अचिन्हित दीर्घ p5,
			       अचिन्हित दीर्घ p6)
अणु
	diag_stat_inc(DIAG_STAT_X500);
	वापस __kvm_hypercall6(nr, p1, p2, p3, p4, p5, p6);
पूर्ण

/* kvm on s390 is always paraभवization enabled */
अटल अंतरभूत पूर्णांक kvm_para_available(व्योम)
अणु
	वापस 1;
पूर्ण

/* No feature bits are currently asचिन्हित क्रम kvm on s390 */
अटल अंतरभूत अचिन्हित पूर्णांक kvm_arch_para_features(व्योम)
अणु
	वापस 0;
पूर्ण

अटल अंतरभूत अचिन्हित पूर्णांक kvm_arch_para_hपूर्णांकs(व्योम)
अणु
	वापस 0;
पूर्ण

अटल अंतरभूत bool kvm_check_and_clear_guest_छोड़ोd(व्योम)
अणु
	वापस false;
पूर्ण

#पूर्ण_अगर /* __S390_KVM_PARA_H */
