<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0
// Copyright (c) 2017 Intel Corporation.

#समावेश <linux/acpi.h>
#समावेश <linux/i2c.h>
#समावेश <linux/module.h>
#समावेश <linux/pm_runसमय.स>
#समावेश <media/v4l2-ctrls.h>
#समावेश <media/v4l2-device.h>
#समावेश <media/v4l2-fwnode.h>

#घोषणा OV5670_REG_CHIP_ID		0x300a
#घोषणा OV5670_CHIP_ID			0x005670

#घोषणा OV5670_REG_MODE_SELECT		0x0100
#घोषणा OV5670_MODE_STANDBY		0x00
#घोषणा OV5670_MODE_STREAMING		0x01

#घोषणा OV5670_REG_SOFTWARE_RST		0x0103
#घोषणा OV5670_SOFTWARE_RST		0x01

/* vertical-timings from sensor */
#घोषणा OV5670_REG_VTS			0x380e
#घोषणा OV5670_VTS_30FPS		0x0808 /* शेष क्रम 30 fps */
#घोषणा OV5670_VTS_MAX			0xffff

/* horizontal-timings from sensor */
#घोषणा OV5670_REG_HTS			0x380c

/*
 * Pixels-per-line(PPL) = Time-per-line * pixel-rate
 * In OV5670, Time-per-line = HTS/SCLK.
 * HTS is fixed क्रम all resolutions, not recommended to change.
 */
#घोषणा OV5670_FIXED_PPL		2724	/* Pixels per line */

/* Exposure controls from sensor */
#घोषणा OV5670_REG_EXPOSURE		0x3500
#घोषणा	OV5670_EXPOSURE_MIN		4
#घोषणा	OV5670_EXPOSURE_STEP		1

/* Analog gain controls from sensor */
#घोषणा OV5670_REG_ANALOG_GAIN		0x3508
#घोषणा	ANALOG_GAIN_MIN			0
#घोषणा	ANALOG_GAIN_MAX			8191
#घोषणा	ANALOG_GAIN_STEP		1
#घोषणा	ANALOG_GAIN_DEFAULT		128

/* Digital gain controls from sensor */
#घोषणा OV5670_REG_R_DGTL_GAIN		0x5032
#घोषणा OV5670_REG_G_DGTL_GAIN		0x5034
#घोषणा OV5670_REG_B_DGTL_GAIN		0x5036
#घोषणा OV5670_DGTL_GAIN_MIN		0
#घोषणा OV5670_DGTL_GAIN_MAX		4095
#घोषणा OV5670_DGTL_GAIN_STEP		1
#घोषणा OV5670_DGTL_GAIN_DEFAULT	1024

/* Test Pattern Control */
#घोषणा OV5670_REG_TEST_PATTERN		0x4303
#घोषणा OV5670_TEST_PATTERN_ENABLE	BIT(3)
#घोषणा OV5670_REG_TEST_PATTERN_CTRL	0x4320

#घोषणा OV5670_REG_VALUE_08BIT		1
#घोषणा OV5670_REG_VALUE_16BIT		2
#घोषणा OV5670_REG_VALUE_24BIT		3

/* Initial number of frames to skip to aव्योम possible garbage */
#घोषणा OV5670_NUM_OF_SKIP_FRAMES	2

काष्ठा ov5670_reg अणु
	u16 address;
	u8 val;
पूर्ण;

काष्ठा ov5670_reg_list अणु
	u32 num_of_regs;
	स्थिर काष्ठा ov5670_reg *regs;
पूर्ण;

काष्ठा ov5670_link_freq_config अणु
	u32 pixel_rate;
	स्थिर काष्ठा ov5670_reg_list reg_list;
पूर्ण;

काष्ठा ov5670_mode अणु
	/* Frame width in pixels */
	u32 width;

	/* Frame height in pixels */
	u32 height;

	/* Default vertical timining size */
	u32 vts_def;

	/* Min vertical timining size */
	u32 vts_min;

	/* Link frequency needed क्रम this resolution */
	u32 link_freq_index;

	/* Sensor रेजिस्टर settings क्रम this resolution */
	स्थिर काष्ठा ov5670_reg_list reg_list;
पूर्ण;

अटल स्थिर काष्ठा ov5670_reg mipi_data_rate_840mbps[] = अणु
	अणु0x0300, 0x04पूर्ण,
	अणु0x0301, 0x00पूर्ण,
	अणु0x0302, 0x84पूर्ण,
	अणु0x0303, 0x00पूर्ण,
	अणु0x0304, 0x03पूर्ण,
	अणु0x0305, 0x01पूर्ण,
	अणु0x0306, 0x01पूर्ण,
	अणु0x030a, 0x00पूर्ण,
	अणु0x030b, 0x00पूर्ण,
	अणु0x030c, 0x00पूर्ण,
	अणु0x030d, 0x26पूर्ण,
	अणु0x030e, 0x00पूर्ण,
	अणु0x030f, 0x06पूर्ण,
	अणु0x0312, 0x01पूर्ण,
	अणु0x3031, 0x0aपूर्ण,
पूर्ण;

अटल स्थिर काष्ठा ov5670_reg mode_2592x1944_regs[] = अणु
	अणु0x3000, 0x00पूर्ण,
	अणु0x3002, 0x21पूर्ण,
	अणु0x3005, 0xf0पूर्ण,
	अणु0x3007, 0x00पूर्ण,
	अणु0x3015, 0x0fपूर्ण,
	अणु0x3018, 0x32पूर्ण,
	अणु0x301a, 0xf0पूर्ण,
	अणु0x301b, 0xf0पूर्ण,
	अणु0x301c, 0xf0पूर्ण,
	अणु0x301d, 0xf0पूर्ण,
	अणु0x301e, 0xf0पूर्ण,
	अणु0x3030, 0x00पूर्ण,
	अणु0x3031, 0x0aपूर्ण,
	अणु0x303c, 0xffपूर्ण,
	अणु0x303e, 0xffपूर्ण,
	अणु0x3040, 0xf0पूर्ण,
	अणु0x3041, 0x00पूर्ण,
	अणु0x3042, 0xf0पूर्ण,
	अणु0x3106, 0x11पूर्ण,
	अणु0x3500, 0x00पूर्ण,
	अणु0x3501, 0x80पूर्ण,
	अणु0x3502, 0x00पूर्ण,
	अणु0x3503, 0x04पूर्ण,
	अणु0x3504, 0x03पूर्ण,
	अणु0x3505, 0x83पूर्ण,
	अणु0x3508, 0x04पूर्ण,
	अणु0x3509, 0x00पूर्ण,
	अणु0x350e, 0x04पूर्ण,
	अणु0x350f, 0x00पूर्ण,
	अणु0x3510, 0x00पूर्ण,
	अणु0x3511, 0x02पूर्ण,
	अणु0x3512, 0x00पूर्ण,
	अणु0x3601, 0xc8पूर्ण,
	अणु0x3610, 0x88पूर्ण,
	अणु0x3612, 0x48पूर्ण,
	अणु0x3614, 0x5bपूर्ण,
	अणु0x3615, 0x96पूर्ण,
	अणु0x3621, 0xd0पूर्ण,
	अणु0x3622, 0x00पूर्ण,
	अणु0x3623, 0x00पूर्ण,
	अणु0x3633, 0x13पूर्ण,
	अणु0x3634, 0x13पूर्ण,
	अणु0x3635, 0x13पूर्ण,
	अणु0x3636, 0x13पूर्ण,
	अणु0x3645, 0x13पूर्ण,
	अणु0x3646, 0x82पूर्ण,
	अणु0x3650, 0x00पूर्ण,
	अणु0x3652, 0xffपूर्ण,
	अणु0x3655, 0x20पूर्ण,
	अणु0x3656, 0xffपूर्ण,
	अणु0x365a, 0xffपूर्ण,
	अणु0x365e, 0xffपूर्ण,
	अणु0x3668, 0x00पूर्ण,
	अणु0x366a, 0x07पूर्ण,
	अणु0x366e, 0x10पूर्ण,
	अणु0x366d, 0x00पूर्ण,
	अणु0x366f, 0x80पूर्ण,
	अणु0x3700, 0x28पूर्ण,
	अणु0x3701, 0x10पूर्ण,
	अणु0x3702, 0x3aपूर्ण,
	अणु0x3703, 0x19पूर्ण,
	अणु0x3704, 0x10पूर्ण,
	अणु0x3705, 0x00पूर्ण,
	अणु0x3706, 0x66पूर्ण,
	अणु0x3707, 0x08पूर्ण,
	अणु0x3708, 0x34पूर्ण,
	अणु0x3709, 0x40पूर्ण,
	अणु0x370a, 0x01पूर्ण,
	अणु0x370b, 0x1bपूर्ण,
	अणु0x3714, 0x24पूर्ण,
	अणु0x371a, 0x3eपूर्ण,
	अणु0x3733, 0x00पूर्ण,
	अणु0x3734, 0x00पूर्ण,
	अणु0x373a, 0x05पूर्ण,
	अणु0x373b, 0x06पूर्ण,
	अणु0x373c, 0x0aपूर्ण,
	अणु0x373f, 0xa0पूर्ण,
	अणु0x3755, 0x00पूर्ण,
	अणु0x3758, 0x00पूर्ण,
	अणु0x375b, 0x0eपूर्ण,
	अणु0x3766, 0x5fपूर्ण,
	अणु0x3768, 0x00पूर्ण,
	अणु0x3769, 0x22पूर्ण,
	अणु0x3773, 0x08पूर्ण,
	अणु0x3774, 0x1fपूर्ण,
	अणु0x3776, 0x06पूर्ण,
	अणु0x37a0, 0x88पूर्ण,
	अणु0x37a1, 0x5cपूर्ण,
	अणु0x37a7, 0x88पूर्ण,
	अणु0x37a8, 0x70पूर्ण,
	अणु0x37aa, 0x88पूर्ण,
	अणु0x37ab, 0x48पूर्ण,
	अणु0x37b3, 0x66पूर्ण,
	अणु0x37c2, 0x04पूर्ण,
	अणु0x37c5, 0x00पूर्ण,
	अणु0x37c8, 0x00पूर्ण,
	अणु0x3800, 0x00पूर्ण,
	अणु0x3801, 0x0cपूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x04पूर्ण,
	अणु0x3804, 0x0aपूर्ण,
	अणु0x3805, 0x33पूर्ण,
	अणु0x3806, 0x07पूर्ण,
	अणु0x3807, 0xa3पूर्ण,
	अणु0x3808, 0x0aपूर्ण,
	अणु0x3809, 0x20पूर्ण,
	अणु0x380a, 0x07पूर्ण,
	अणु0x380b, 0x98पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0x90पूर्ण,
	अणु0x380e, 0x08पूर्ण,
	अणु0x380f, 0x08पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3813, 0x02पूर्ण,
	अणु0x3814, 0x01पूर्ण,
	अणु0x3815, 0x01पूर्ण,
	अणु0x3816, 0x00पूर्ण,
	अणु0x3817, 0x00पूर्ण,
	अणु0x3818, 0x00पूर्ण,
	अणु0x3819, 0x00पूर्ण,
	अणु0x3820, 0x84पूर्ण,
	अणु0x3821, 0x46पूर्ण,
	अणु0x3822, 0x48पूर्ण,
	अणु0x3826, 0x00पूर्ण,
	अणु0x3827, 0x08पूर्ण,
	अणु0x382a, 0x01पूर्ण,
	अणु0x382b, 0x01पूर्ण,
	अणु0x3830, 0x08पूर्ण,
	अणु0x3836, 0x02पूर्ण,
	अणु0x3837, 0x00पूर्ण,
	अणु0x3838, 0x10पूर्ण,
	अणु0x3841, 0xffपूर्ण,
	अणु0x3846, 0x48पूर्ण,
	अणु0x3861, 0x00पूर्ण,
	अणु0x3862, 0x04पूर्ण,
	अणु0x3863, 0x06पूर्ण,
	अणु0x3a11, 0x01पूर्ण,
	अणु0x3a12, 0x78पूर्ण,
	अणु0x3b00, 0x00पूर्ण,
	अणु0x3b02, 0x00पूर्ण,
	अणु0x3b03, 0x00पूर्ण,
	अणु0x3b04, 0x00पूर्ण,
	अणु0x3b05, 0x00पूर्ण,
	अणु0x3c00, 0x89पूर्ण,
	अणु0x3c01, 0xabपूर्ण,
	अणु0x3c02, 0x01पूर्ण,
	अणु0x3c03, 0x00पूर्ण,
	अणु0x3c04, 0x00पूर्ण,
	अणु0x3c05, 0x03पूर्ण,
	अणु0x3c06, 0x00पूर्ण,
	अणु0x3c07, 0x05पूर्ण,
	अणु0x3c0c, 0x00पूर्ण,
	अणु0x3c0d, 0x00पूर्ण,
	अणु0x3c0e, 0x00पूर्ण,
	अणु0x3c0f, 0x00पूर्ण,
	अणु0x3c40, 0x00पूर्ण,
	अणु0x3c41, 0xa3पूर्ण,
	अणु0x3c43, 0x7dपूर्ण,
	अणु0x3c45, 0xd7पूर्ण,
	अणु0x3c47, 0xfcपूर्ण,
	अणु0x3c50, 0x05पूर्ण,
	अणु0x3c52, 0xaaपूर्ण,
	अणु0x3c54, 0x71पूर्ण,
	अणु0x3c56, 0x80पूर्ण,
	अणु0x3d85, 0x17पूर्ण,
	अणु0x3f03, 0x00पूर्ण,
	अणु0x3f0a, 0x00पूर्ण,
	अणु0x3f0b, 0x00पूर्ण,
	अणु0x4001, 0x60पूर्ण,
	अणु0x4009, 0x0dपूर्ण,
	अणु0x4020, 0x00पूर्ण,
	अणु0x4021, 0x00पूर्ण,
	अणु0x4022, 0x00पूर्ण,
	अणु0x4023, 0x00पूर्ण,
	अणु0x4024, 0x00पूर्ण,
	अणु0x4025, 0x00पूर्ण,
	अणु0x4026, 0x00पूर्ण,
	अणु0x4027, 0x00पूर्ण,
	अणु0x4028, 0x00पूर्ण,
	अणु0x4029, 0x00पूर्ण,
	अणु0x402a, 0x00पूर्ण,
	अणु0x402b, 0x00पूर्ण,
	अणु0x402c, 0x00पूर्ण,
	अणु0x402d, 0x00पूर्ण,
	अणु0x402e, 0x00पूर्ण,
	अणु0x402f, 0x00पूर्ण,
	अणु0x4040, 0x00पूर्ण,
	अणु0x4041, 0x03पूर्ण,
	अणु0x4042, 0x00पूर्ण,
	अणु0x4043, 0x7Aपूर्ण,
	अणु0x4044, 0x00पूर्ण,
	अणु0x4045, 0x7Aपूर्ण,
	अणु0x4046, 0x00पूर्ण,
	अणु0x4047, 0x7Aपूर्ण,
	अणु0x4048, 0x00पूर्ण,
	अणु0x4049, 0x7Aपूर्ण,
	अणु0x4307, 0x30पूर्ण,
	अणु0x4500, 0x58पूर्ण,
	अणु0x4501, 0x04पूर्ण,
	अणु0x4502, 0x40पूर्ण,
	अणु0x4503, 0x10पूर्ण,
	अणु0x4508, 0xaaपूर्ण,
	अणु0x4509, 0xaaपूर्ण,
	अणु0x450a, 0x00पूर्ण,
	अणु0x450b, 0x00पूर्ण,
	अणु0x4600, 0x01पूर्ण,
	अणु0x4601, 0x03पूर्ण,
	अणु0x4700, 0xa4पूर्ण,
	अणु0x4800, 0x4cपूर्ण,
	अणु0x4816, 0x53पूर्ण,
	अणु0x481f, 0x40पूर्ण,
	अणु0x4837, 0x13पूर्ण,
	अणु0x5000, 0x56पूर्ण,
	अणु0x5001, 0x01पूर्ण,
	अणु0x5002, 0x28पूर्ण,
	अणु0x5004, 0x0cपूर्ण,
	अणु0x5006, 0x0cपूर्ण,
	अणु0x5007, 0xe0पूर्ण,
	अणु0x5008, 0x01पूर्ण,
	अणु0x5009, 0xb0पूर्ण,
	अणु0x5901, 0x00पूर्ण,
	अणु0x5a01, 0x00पूर्ण,
	अणु0x5a03, 0x00पूर्ण,
	अणु0x5a04, 0x0cपूर्ण,
	अणु0x5a05, 0xe0पूर्ण,
	अणु0x5a06, 0x09पूर्ण,
	अणु0x5a07, 0xb0पूर्ण,
	अणु0x5a08, 0x06पूर्ण,
	अणु0x5e00, 0x00पूर्ण,
	अणु0x3734, 0x40पूर्ण,
	अणु0x5b00, 0x01पूर्ण,
	अणु0x5b01, 0x10पूर्ण,
	अणु0x5b02, 0x01पूर्ण,
	अणु0x5b03, 0xdbपूर्ण,
	अणु0x3d8c, 0x71पूर्ण,
	अणु0x3d8d, 0xeaपूर्ण,
	अणु0x4017, 0x08पूर्ण,
	अणु0x3618, 0x2aपूर्ण,
	अणु0x5780, 0x3eपूर्ण,
	अणु0x5781, 0x0fपूर्ण,
	अणु0x5782, 0x44पूर्ण,
	अणु0x5783, 0x02पूर्ण,
	अणु0x5784, 0x01पूर्ण,
	अणु0x5785, 0x01पूर्ण,
	अणु0x5786, 0x00पूर्ण,
	अणु0x5787, 0x04पूर्ण,
	अणु0x5788, 0x02पूर्ण,
	अणु0x5789, 0x0fपूर्ण,
	अणु0x578a, 0xfdपूर्ण,
	अणु0x578b, 0xf5पूर्ण,
	अणु0x578c, 0xf5पूर्ण,
	अणु0x578d, 0x03पूर्ण,
	अणु0x578e, 0x08पूर्ण,
	अणु0x578f, 0x0cपूर्ण,
	अणु0x5790, 0x08पूर्ण,
	अणु0x5791, 0x06पूर्ण,
	अणु0x5792, 0x00पूर्ण,
	अणु0x5793, 0x52पूर्ण,
	अणु0x5794, 0xa3पूर्ण,
	अणु0x3503, 0x00पूर्ण,
	अणु0x5045, 0x05पूर्ण,
	अणु0x4003, 0x40पूर्ण,
	अणु0x5048, 0x40पूर्ण
पूर्ण;

अटल स्थिर काष्ठा ov5670_reg mode_1296x972_regs[] = अणु
	अणु0x3000, 0x00पूर्ण,
	अणु0x3002, 0x21पूर्ण,
	अणु0x3005, 0xf0पूर्ण,
	अणु0x3007, 0x00पूर्ण,
	अणु0x3015, 0x0fपूर्ण,
	अणु0x3018, 0x32पूर्ण,
	अणु0x301a, 0xf0पूर्ण,
	अणु0x301b, 0xf0पूर्ण,
	अणु0x301c, 0xf0पूर्ण,
	अणु0x301d, 0xf0पूर्ण,
	अणु0x301e, 0xf0पूर्ण,
	अणु0x3030, 0x00पूर्ण,
	अणु0x3031, 0x0aपूर्ण,
	अणु0x303c, 0xffपूर्ण,
	अणु0x303e, 0xffपूर्ण,
	अणु0x3040, 0xf0पूर्ण,
	अणु0x3041, 0x00पूर्ण,
	अणु0x3042, 0xf0पूर्ण,
	अणु0x3106, 0x11पूर्ण,
	अणु0x3500, 0x00पूर्ण,
	अणु0x3501, 0x80पूर्ण,
	अणु0x3502, 0x00पूर्ण,
	अणु0x3503, 0x04पूर्ण,
	अणु0x3504, 0x03पूर्ण,
	अणु0x3505, 0x83पूर्ण,
	अणु0x3508, 0x07पूर्ण,
	अणु0x3509, 0x80पूर्ण,
	अणु0x350e, 0x04पूर्ण,
	अणु0x350f, 0x00पूर्ण,
	अणु0x3510, 0x00पूर्ण,
	अणु0x3511, 0x02पूर्ण,
	अणु0x3512, 0x00पूर्ण,
	अणु0x3601, 0xc8पूर्ण,
	अणु0x3610, 0x88पूर्ण,
	अणु0x3612, 0x48पूर्ण,
	अणु0x3614, 0x5bपूर्ण,
	अणु0x3615, 0x96पूर्ण,
	अणु0x3621, 0xd0पूर्ण,
	अणु0x3622, 0x00पूर्ण,
	अणु0x3623, 0x00पूर्ण,
	अणु0x3633, 0x13पूर्ण,
	अणु0x3634, 0x13पूर्ण,
	अणु0x3635, 0x13पूर्ण,
	अणु0x3636, 0x13पूर्ण,
	अणु0x3645, 0x13पूर्ण,
	अणु0x3646, 0x82पूर्ण,
	अणु0x3650, 0x00पूर्ण,
	अणु0x3652, 0xffपूर्ण,
	अणु0x3655, 0x20पूर्ण,
	अणु0x3656, 0xffपूर्ण,
	अणु0x365a, 0xffपूर्ण,
	अणु0x365e, 0xffपूर्ण,
	अणु0x3668, 0x00पूर्ण,
	अणु0x366a, 0x07पूर्ण,
	अणु0x366e, 0x08पूर्ण,
	अणु0x366d, 0x00पूर्ण,
	अणु0x366f, 0x80पूर्ण,
	अणु0x3700, 0x28पूर्ण,
	अणु0x3701, 0x10पूर्ण,
	अणु0x3702, 0x3aपूर्ण,
	अणु0x3703, 0x19पूर्ण,
	अणु0x3704, 0x10पूर्ण,
	अणु0x3705, 0x00पूर्ण,
	अणु0x3706, 0x66पूर्ण,
	अणु0x3707, 0x08पूर्ण,
	अणु0x3708, 0x34पूर्ण,
	अणु0x3709, 0x40पूर्ण,
	अणु0x370a, 0x01पूर्ण,
	अणु0x370b, 0x1bपूर्ण,
	अणु0x3714, 0x24पूर्ण,
	अणु0x371a, 0x3eपूर्ण,
	अणु0x3733, 0x00पूर्ण,
	अणु0x3734, 0x00पूर्ण,
	अणु0x373a, 0x05पूर्ण,
	अणु0x373b, 0x06पूर्ण,
	अणु0x373c, 0x0aपूर्ण,
	अणु0x373f, 0xa0पूर्ण,
	अणु0x3755, 0x00पूर्ण,
	अणु0x3758, 0x00पूर्ण,
	अणु0x375b, 0x0eपूर्ण,
	अणु0x3766, 0x5fपूर्ण,
	अणु0x3768, 0x00पूर्ण,
	अणु0x3769, 0x22पूर्ण,
	अणु0x3773, 0x08पूर्ण,
	अणु0x3774, 0x1fपूर्ण,
	अणु0x3776, 0x06पूर्ण,
	अणु0x37a0, 0x88पूर्ण,
	अणु0x37a1, 0x5cपूर्ण,
	अणु0x37a7, 0x88पूर्ण,
	अणु0x37a8, 0x70पूर्ण,
	अणु0x37aa, 0x88पूर्ण,
	अणु0x37ab, 0x48पूर्ण,
	अणु0x37b3, 0x66पूर्ण,
	अणु0x37c2, 0x04पूर्ण,
	अणु0x37c5, 0x00पूर्ण,
	अणु0x37c8, 0x00पूर्ण,
	अणु0x3800, 0x00पूर्ण,
	अणु0x3801, 0x0cपूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x04पूर्ण,
	अणु0x3804, 0x0aपूर्ण,
	अणु0x3805, 0x33पूर्ण,
	अणु0x3806, 0x07पूर्ण,
	अणु0x3807, 0xa3पूर्ण,
	अणु0x3808, 0x05पूर्ण,
	अणु0x3809, 0x10पूर्ण,
	अणु0x380a, 0x03पूर्ण,
	अणु0x380b, 0xccपूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0x90पूर्ण,
	अणु0x380e, 0x08पूर्ण,
	अणु0x380f, 0x08पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3813, 0x04पूर्ण,
	अणु0x3814, 0x03पूर्ण,
	अणु0x3815, 0x01पूर्ण,
	अणु0x3816, 0x00पूर्ण,
	अणु0x3817, 0x00पूर्ण,
	अणु0x3818, 0x00पूर्ण,
	अणु0x3819, 0x00पूर्ण,
	अणु0x3820, 0x94पूर्ण,
	अणु0x3821, 0x47पूर्ण,
	अणु0x3822, 0x48पूर्ण,
	अणु0x3826, 0x00पूर्ण,
	अणु0x3827, 0x08पूर्ण,
	अणु0x382a, 0x03पूर्ण,
	अणु0x382b, 0x01पूर्ण,
	अणु0x3830, 0x08पूर्ण,
	अणु0x3836, 0x02पूर्ण,
	अणु0x3837, 0x00पूर्ण,
	अणु0x3838, 0x10पूर्ण,
	अणु0x3841, 0xffपूर्ण,
	अणु0x3846, 0x48पूर्ण,
	अणु0x3861, 0x00पूर्ण,
	अणु0x3862, 0x04पूर्ण,
	अणु0x3863, 0x06पूर्ण,
	अणु0x3a11, 0x01पूर्ण,
	अणु0x3a12, 0x78पूर्ण,
	अणु0x3b00, 0x00पूर्ण,
	अणु0x3b02, 0x00पूर्ण,
	अणु0x3b03, 0x00पूर्ण,
	अणु0x3b04, 0x00पूर्ण,
	अणु0x3b05, 0x00पूर्ण,
	अणु0x3c00, 0x89पूर्ण,
	अणु0x3c01, 0xabपूर्ण,
	अणु0x3c02, 0x01पूर्ण,
	अणु0x3c03, 0x00पूर्ण,
	अणु0x3c04, 0x00पूर्ण,
	अणु0x3c05, 0x03पूर्ण,
	अणु0x3c06, 0x00पूर्ण,
	अणु0x3c07, 0x05पूर्ण,
	अणु0x3c0c, 0x00पूर्ण,
	अणु0x3c0d, 0x00पूर्ण,
	अणु0x3c0e, 0x00पूर्ण,
	अणु0x3c0f, 0x00पूर्ण,
	अणु0x3c40, 0x00पूर्ण,
	अणु0x3c41, 0xa3पूर्ण,
	अणु0x3c43, 0x7dपूर्ण,
	अणु0x3c45, 0xd7पूर्ण,
	अणु0x3c47, 0xfcपूर्ण,
	अणु0x3c50, 0x05पूर्ण,
	अणु0x3c52, 0xaaपूर्ण,
	अणु0x3c54, 0x71पूर्ण,
	अणु0x3c56, 0x80पूर्ण,
	अणु0x3d85, 0x17पूर्ण,
	अणु0x3f03, 0x00पूर्ण,
	अणु0x3f0a, 0x00पूर्ण,
	अणु0x3f0b, 0x00पूर्ण,
	अणु0x4001, 0x60पूर्ण,
	अणु0x4009, 0x05पूर्ण,
	अणु0x4020, 0x00पूर्ण,
	अणु0x4021, 0x00पूर्ण,
	अणु0x4022, 0x00पूर्ण,
	अणु0x4023, 0x00पूर्ण,
	अणु0x4024, 0x00पूर्ण,
	अणु0x4025, 0x00पूर्ण,
	अणु0x4026, 0x00पूर्ण,
	अणु0x4027, 0x00पूर्ण,
	अणु0x4028, 0x00पूर्ण,
	अणु0x4029, 0x00पूर्ण,
	अणु0x402a, 0x00पूर्ण,
	अणु0x402b, 0x00पूर्ण,
	अणु0x402c, 0x00पूर्ण,
	अणु0x402d, 0x00पूर्ण,
	अणु0x402e, 0x00पूर्ण,
	अणु0x402f, 0x00पूर्ण,
	अणु0x4040, 0x00पूर्ण,
	अणु0x4041, 0x03पूर्ण,
	अणु0x4042, 0x00पूर्ण,
	अणु0x4043, 0x7Aपूर्ण,
	अणु0x4044, 0x00पूर्ण,
	अणु0x4045, 0x7Aपूर्ण,
	अणु0x4046, 0x00पूर्ण,
	अणु0x4047, 0x7Aपूर्ण,
	अणु0x4048, 0x00पूर्ण,
	अणु0x4049, 0x7Aपूर्ण,
	अणु0x4307, 0x30पूर्ण,
	अणु0x4500, 0x58पूर्ण,
	अणु0x4501, 0x04पूर्ण,
	अणु0x4502, 0x48पूर्ण,
	अणु0x4503, 0x10पूर्ण,
	अणु0x4508, 0x55पूर्ण,
	अणु0x4509, 0x55पूर्ण,
	अणु0x450a, 0x00पूर्ण,
	अणु0x450b, 0x00पूर्ण,
	अणु0x4600, 0x00पूर्ण,
	अणु0x4601, 0x81पूर्ण,
	अणु0x4700, 0xa4पूर्ण,
	अणु0x4800, 0x4cपूर्ण,
	अणु0x4816, 0x53पूर्ण,
	अणु0x481f, 0x40पूर्ण,
	अणु0x4837, 0x13पूर्ण,
	अणु0x5000, 0x56पूर्ण,
	अणु0x5001, 0x01पूर्ण,
	अणु0x5002, 0x28पूर्ण,
	अणु0x5004, 0x0cपूर्ण,
	अणु0x5006, 0x0cपूर्ण,
	अणु0x5007, 0xe0पूर्ण,
	अणु0x5008, 0x01पूर्ण,
	अणु0x5009, 0xb0पूर्ण,
	अणु0x5901, 0x00पूर्ण,
	अणु0x5a01, 0x00पूर्ण,
	अणु0x5a03, 0x00पूर्ण,
	अणु0x5a04, 0x0cपूर्ण,
	अणु0x5a05, 0xe0पूर्ण,
	अणु0x5a06, 0x09पूर्ण,
	अणु0x5a07, 0xb0पूर्ण,
	अणु0x5a08, 0x06पूर्ण,
	अणु0x5e00, 0x00पूर्ण,
	अणु0x3734, 0x40पूर्ण,
	अणु0x5b00, 0x01पूर्ण,
	अणु0x5b01, 0x10पूर्ण,
	अणु0x5b02, 0x01पूर्ण,
	अणु0x5b03, 0xdbपूर्ण,
	अणु0x3d8c, 0x71पूर्ण,
	अणु0x3d8d, 0xeaपूर्ण,
	अणु0x4017, 0x10पूर्ण,
	अणु0x3618, 0x2aपूर्ण,
	अणु0x5780, 0x3eपूर्ण,
	अणु0x5781, 0x0fपूर्ण,
	अणु0x5782, 0x44पूर्ण,
	अणु0x5783, 0x02पूर्ण,
	अणु0x5784, 0x01पूर्ण,
	अणु0x5785, 0x01पूर्ण,
	अणु0x5786, 0x00पूर्ण,
	अणु0x5787, 0x04पूर्ण,
	अणु0x5788, 0x02पूर्ण,
	अणु0x5789, 0x0fपूर्ण,
	अणु0x578a, 0xfdपूर्ण,
	अणु0x578b, 0xf5पूर्ण,
	अणु0x578c, 0xf5पूर्ण,
	अणु0x578d, 0x03पूर्ण,
	अणु0x578e, 0x08पूर्ण,
	अणु0x578f, 0x0cपूर्ण,
	अणु0x5790, 0x08पूर्ण,
	अणु0x5791, 0x04पूर्ण,
	अणु0x5792, 0x00पूर्ण,
	अणु0x5793, 0x52पूर्ण,
	अणु0x5794, 0xa3पूर्ण,
	अणु0x3503, 0x00पूर्ण,
	अणु0x5045, 0x05पूर्ण,
	अणु0x4003, 0x40पूर्ण,
	अणु0x5048, 0x40पूर्ण
पूर्ण;

अटल स्थिर काष्ठा ov5670_reg mode_648x486_regs[] = अणु
	अणु0x3000, 0x00पूर्ण,
	अणु0x3002, 0x21पूर्ण,
	अणु0x3005, 0xf0पूर्ण,
	अणु0x3007, 0x00पूर्ण,
	अणु0x3015, 0x0fपूर्ण,
	अणु0x3018, 0x32पूर्ण,
	अणु0x301a, 0xf0पूर्ण,
	अणु0x301b, 0xf0पूर्ण,
	अणु0x301c, 0xf0पूर्ण,
	अणु0x301d, 0xf0पूर्ण,
	अणु0x301e, 0xf0पूर्ण,
	अणु0x3030, 0x00पूर्ण,
	अणु0x3031, 0x0aपूर्ण,
	अणु0x303c, 0xffपूर्ण,
	अणु0x303e, 0xffपूर्ण,
	अणु0x3040, 0xf0पूर्ण,
	अणु0x3041, 0x00पूर्ण,
	अणु0x3042, 0xf0पूर्ण,
	अणु0x3106, 0x11पूर्ण,
	अणु0x3500, 0x00पूर्ण,
	अणु0x3501, 0x80पूर्ण,
	अणु0x3502, 0x00पूर्ण,
	अणु0x3503, 0x04पूर्ण,
	अणु0x3504, 0x03पूर्ण,
	अणु0x3505, 0x83पूर्ण,
	अणु0x3508, 0x04पूर्ण,
	अणु0x3509, 0x00पूर्ण,
	अणु0x350e, 0x04पूर्ण,
	अणु0x350f, 0x00पूर्ण,
	अणु0x3510, 0x00पूर्ण,
	अणु0x3511, 0x02पूर्ण,
	अणु0x3512, 0x00पूर्ण,
	अणु0x3601, 0xc8पूर्ण,
	अणु0x3610, 0x88पूर्ण,
	अणु0x3612, 0x48पूर्ण,
	अणु0x3614, 0x5bपूर्ण,
	अणु0x3615, 0x96पूर्ण,
	अणु0x3621, 0xd0पूर्ण,
	अणु0x3622, 0x00पूर्ण,
	अणु0x3623, 0x04पूर्ण,
	अणु0x3633, 0x13पूर्ण,
	अणु0x3634, 0x13पूर्ण,
	अणु0x3635, 0x13पूर्ण,
	अणु0x3636, 0x13पूर्ण,
	अणु0x3645, 0x13पूर्ण,
	अणु0x3646, 0x82पूर्ण,
	अणु0x3650, 0x00पूर्ण,
	अणु0x3652, 0xffपूर्ण,
	अणु0x3655, 0x20पूर्ण,
	अणु0x3656, 0xffपूर्ण,
	अणु0x365a, 0xffपूर्ण,
	अणु0x365e, 0xffपूर्ण,
	अणु0x3668, 0x00पूर्ण,
	अणु0x366a, 0x07पूर्ण,
	अणु0x366e, 0x08पूर्ण,
	अणु0x366d, 0x00पूर्ण,
	अणु0x366f, 0x80पूर्ण,
	अणु0x3700, 0x28पूर्ण,
	अणु0x3701, 0x10पूर्ण,
	अणु0x3702, 0x3aपूर्ण,
	अणु0x3703, 0x19पूर्ण,
	अणु0x3704, 0x10पूर्ण,
	अणु0x3705, 0x00पूर्ण,
	अणु0x3706, 0x66पूर्ण,
	अणु0x3707, 0x08पूर्ण,
	अणु0x3708, 0x34पूर्ण,
	अणु0x3709, 0x40पूर्ण,
	अणु0x370a, 0x01पूर्ण,
	अणु0x370b, 0x1bपूर्ण,
	अणु0x3714, 0x24पूर्ण,
	अणु0x371a, 0x3eपूर्ण,
	अणु0x3733, 0x00पूर्ण,
	अणु0x3734, 0x00पूर्ण,
	अणु0x373a, 0x05पूर्ण,
	अणु0x373b, 0x06पूर्ण,
	अणु0x373c, 0x0aपूर्ण,
	अणु0x373f, 0xa0पूर्ण,
	अणु0x3755, 0x00पूर्ण,
	अणु0x3758, 0x00पूर्ण,
	अणु0x375b, 0x0eपूर्ण,
	अणु0x3766, 0x5fपूर्ण,
	अणु0x3768, 0x00पूर्ण,
	अणु0x3769, 0x22पूर्ण,
	अणु0x3773, 0x08पूर्ण,
	अणु0x3774, 0x1fपूर्ण,
	अणु0x3776, 0x06पूर्ण,
	अणु0x37a0, 0x88पूर्ण,
	अणु0x37a1, 0x5cपूर्ण,
	अणु0x37a7, 0x88पूर्ण,
	अणु0x37a8, 0x70पूर्ण,
	अणु0x37aa, 0x88पूर्ण,
	अणु0x37ab, 0x48पूर्ण,
	अणु0x37b3, 0x66पूर्ण,
	अणु0x37c2, 0x04पूर्ण,
	अणु0x37c5, 0x00पूर्ण,
	अणु0x37c8, 0x00पूर्ण,
	अणु0x3800, 0x00पूर्ण,
	अणु0x3801, 0x0cपूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x04पूर्ण,
	अणु0x3804, 0x0aपूर्ण,
	अणु0x3805, 0x33पूर्ण,
	अणु0x3806, 0x07पूर्ण,
	अणु0x3807, 0xa3पूर्ण,
	अणु0x3808, 0x02पूर्ण,
	अणु0x3809, 0x88पूर्ण,
	अणु0x380a, 0x01पूर्ण,
	अणु0x380b, 0xe6पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0x90पूर्ण,
	अणु0x380e, 0x08पूर्ण,
	अणु0x380f, 0x08पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3813, 0x02पूर्ण,
	अणु0x3814, 0x07पूर्ण,
	अणु0x3815, 0x01पूर्ण,
	अणु0x3816, 0x00पूर्ण,
	अणु0x3817, 0x00पूर्ण,
	अणु0x3818, 0x00पूर्ण,
	अणु0x3819, 0x00पूर्ण,
	अणु0x3820, 0x94पूर्ण,
	अणु0x3821, 0xc6पूर्ण,
	अणु0x3822, 0x48पूर्ण,
	अणु0x3826, 0x00पूर्ण,
	अणु0x3827, 0x08पूर्ण,
	अणु0x382a, 0x07पूर्ण,
	अणु0x382b, 0x01पूर्ण,
	अणु0x3830, 0x08पूर्ण,
	अणु0x3836, 0x02पूर्ण,
	अणु0x3837, 0x00पूर्ण,
	अणु0x3838, 0x10पूर्ण,
	अणु0x3841, 0xffपूर्ण,
	अणु0x3846, 0x48पूर्ण,
	अणु0x3861, 0x00पूर्ण,
	अणु0x3862, 0x04पूर्ण,
	अणु0x3863, 0x06पूर्ण,
	अणु0x3a11, 0x01पूर्ण,
	अणु0x3a12, 0x78पूर्ण,
	अणु0x3b00, 0x00पूर्ण,
	अणु0x3b02, 0x00पूर्ण,
	अणु0x3b03, 0x00पूर्ण,
	अणु0x3b04, 0x00पूर्ण,
	अणु0x3b05, 0x00पूर्ण,
	अणु0x3c00, 0x89पूर्ण,
	अणु0x3c01, 0xabपूर्ण,
	अणु0x3c02, 0x01पूर्ण,
	अणु0x3c03, 0x00पूर्ण,
	अणु0x3c04, 0x00पूर्ण,
	अणु0x3c05, 0x03पूर्ण,
	अणु0x3c06, 0x00पूर्ण,
	अणु0x3c07, 0x05पूर्ण,
	अणु0x3c0c, 0x00पूर्ण,
	अणु0x3c0d, 0x00पूर्ण,
	अणु0x3c0e, 0x00पूर्ण,
	अणु0x3c0f, 0x00पूर्ण,
	अणु0x3c40, 0x00पूर्ण,
	अणु0x3c41, 0xa3पूर्ण,
	अणु0x3c43, 0x7dपूर्ण,
	अणु0x3c45, 0xd7पूर्ण,
	अणु0x3c47, 0xfcपूर्ण,
	अणु0x3c50, 0x05पूर्ण,
	अणु0x3c52, 0xaaपूर्ण,
	अणु0x3c54, 0x71पूर्ण,
	अणु0x3c56, 0x80पूर्ण,
	अणु0x3d85, 0x17पूर्ण,
	अणु0x3f03, 0x00पूर्ण,
	अणु0x3f0a, 0x00पूर्ण,
	अणु0x3f0b, 0x00पूर्ण,
	अणु0x4001, 0x60पूर्ण,
	अणु0x4009, 0x05पूर्ण,
	अणु0x4020, 0x00पूर्ण,
	अणु0x4021, 0x00पूर्ण,
	अणु0x4022, 0x00पूर्ण,
	अणु0x4023, 0x00पूर्ण,
	अणु0x4024, 0x00पूर्ण,
	अणु0x4025, 0x00पूर्ण,
	अणु0x4026, 0x00पूर्ण,
	अणु0x4027, 0x00पूर्ण,
	अणु0x4028, 0x00पूर्ण,
	अणु0x4029, 0x00पूर्ण,
	अणु0x402a, 0x00पूर्ण,
	अणु0x402b, 0x00पूर्ण,
	अणु0x402c, 0x00पूर्ण,
	अणु0x402d, 0x00पूर्ण,
	अणु0x402e, 0x00पूर्ण,
	अणु0x402f, 0x00पूर्ण,
	अणु0x4040, 0x00पूर्ण,
	अणु0x4041, 0x03पूर्ण,
	अणु0x4042, 0x00पूर्ण,
	अणु0x4043, 0x7Aपूर्ण,
	अणु0x4044, 0x00पूर्ण,
	अणु0x4045, 0x7Aपूर्ण,
	अणु0x4046, 0x00पूर्ण,
	अणु0x4047, 0x7Aपूर्ण,
	अणु0x4048, 0x00पूर्ण,
	अणु0x4049, 0x7Aपूर्ण,
	अणु0x4307, 0x30पूर्ण,
	अणु0x4500, 0x58पूर्ण,
	अणु0x4501, 0x04पूर्ण,
	अणु0x4502, 0x40पूर्ण,
	अणु0x4503, 0x10पूर्ण,
	अणु0x4508, 0x55पूर्ण,
	अणु0x4509, 0x55पूर्ण,
	अणु0x450a, 0x02पूर्ण,
	अणु0x450b, 0x00पूर्ण,
	अणु0x4600, 0x00पूर्ण,
	अणु0x4601, 0x40पूर्ण,
	अणु0x4700, 0xa4पूर्ण,
	अणु0x4800, 0x4cपूर्ण,
	अणु0x4816, 0x53पूर्ण,
	अणु0x481f, 0x40पूर्ण,
	अणु0x4837, 0x13पूर्ण,
	अणु0x5000, 0x56पूर्ण,
	अणु0x5001, 0x01पूर्ण,
	अणु0x5002, 0x28पूर्ण,
	अणु0x5004, 0x0cपूर्ण,
	अणु0x5006, 0x0cपूर्ण,
	अणु0x5007, 0xe0पूर्ण,
	अणु0x5008, 0x01पूर्ण,
	अणु0x5009, 0xb0पूर्ण,
	अणु0x5901, 0x00पूर्ण,
	अणु0x5a01, 0x00पूर्ण,
	अणु0x5a03, 0x00पूर्ण,
	अणु0x5a04, 0x0cपूर्ण,
	अणु0x5a05, 0xe0पूर्ण,
	अणु0x5a06, 0x09पूर्ण,
	अणु0x5a07, 0xb0पूर्ण,
	अणु0x5a08, 0x06पूर्ण,
	अणु0x5e00, 0x00पूर्ण,
	अणु0x3734, 0x40पूर्ण,
	अणु0x5b00, 0x01पूर्ण,
	अणु0x5b01, 0x10पूर्ण,
	अणु0x5b02, 0x01पूर्ण,
	अणु0x5b03, 0xdbपूर्ण,
	अणु0x3d8c, 0x71पूर्ण,
	अणु0x3d8d, 0xeaपूर्ण,
	अणु0x4017, 0x10पूर्ण,
	अणु0x3618, 0x2aपूर्ण,
	अणु0x5780, 0x3eपूर्ण,
	अणु0x5781, 0x0fपूर्ण,
	अणु0x5782, 0x44पूर्ण,
	अणु0x5783, 0x02पूर्ण,
	अणु0x5784, 0x01पूर्ण,
	अणु0x5785, 0x01पूर्ण,
	अणु0x5786, 0x00पूर्ण,
	अणु0x5787, 0x04पूर्ण,
	अणु0x5788, 0x02पूर्ण,
	अणु0x5789, 0x0fपूर्ण,
	अणु0x578a, 0xfdपूर्ण,
	अणु0x578b, 0xf5पूर्ण,
	अणु0x578c, 0xf5पूर्ण,
	अणु0x578d, 0x03पूर्ण,
	अणु0x578e, 0x08पूर्ण,
	अणु0x578f, 0x0cपूर्ण,
	अणु0x5790, 0x08पूर्ण,
	अणु0x5791, 0x06पूर्ण,
	अणु0x5792, 0x00पूर्ण,
	अणु0x5793, 0x52पूर्ण,
	अणु0x5794, 0xa3पूर्ण,
	अणु0x3503, 0x00पूर्ण,
	अणु0x5045, 0x05पूर्ण,
	अणु0x4003, 0x40पूर्ण,
	अणु0x5048, 0x40पूर्ण
पूर्ण;

अटल स्थिर काष्ठा ov5670_reg mode_2560x1440_regs[] = अणु
	अणु0x3000, 0x00पूर्ण,
	अणु0x3002, 0x21पूर्ण,
	अणु0x3005, 0xf0पूर्ण,
	अणु0x3007, 0x00पूर्ण,
	अणु0x3015, 0x0fपूर्ण,
	अणु0x3018, 0x32पूर्ण,
	अणु0x301a, 0xf0पूर्ण,
	अणु0x301b, 0xf0पूर्ण,
	अणु0x301c, 0xf0पूर्ण,
	अणु0x301d, 0xf0पूर्ण,
	अणु0x301e, 0xf0पूर्ण,
	अणु0x3030, 0x00पूर्ण,
	अणु0x3031, 0x0aपूर्ण,
	अणु0x303c, 0xffपूर्ण,
	अणु0x303e, 0xffपूर्ण,
	अणु0x3040, 0xf0पूर्ण,
	अणु0x3041, 0x00पूर्ण,
	अणु0x3042, 0xf0पूर्ण,
	अणु0x3106, 0x11पूर्ण,
	अणु0x3500, 0x00पूर्ण,
	अणु0x3501, 0x80पूर्ण,
	अणु0x3502, 0x00पूर्ण,
	अणु0x3503, 0x04पूर्ण,
	अणु0x3504, 0x03पूर्ण,
	अणु0x3505, 0x83पूर्ण,
	अणु0x3508, 0x04पूर्ण,
	अणु0x3509, 0x00पूर्ण,
	अणु0x350e, 0x04पूर्ण,
	अणु0x350f, 0x00पूर्ण,
	अणु0x3510, 0x00पूर्ण,
	अणु0x3511, 0x02पूर्ण,
	अणु0x3512, 0x00पूर्ण,
	अणु0x3601, 0xc8पूर्ण,
	अणु0x3610, 0x88पूर्ण,
	अणु0x3612, 0x48पूर्ण,
	अणु0x3614, 0x5bपूर्ण,
	अणु0x3615, 0x96पूर्ण,
	अणु0x3621, 0xd0पूर्ण,
	अणु0x3622, 0x00पूर्ण,
	अणु0x3623, 0x00पूर्ण,
	अणु0x3633, 0x13पूर्ण,
	अणु0x3634, 0x13पूर्ण,
	अणु0x3635, 0x13पूर्ण,
	अणु0x3636, 0x13पूर्ण,
	अणु0x3645, 0x13पूर्ण,
	अणु0x3646, 0x82पूर्ण,
	अणु0x3650, 0x00पूर्ण,
	अणु0x3652, 0xffपूर्ण,
	अणु0x3655, 0x20पूर्ण,
	अणु0x3656, 0xffपूर्ण,
	अणु0x365a, 0xffपूर्ण,
	अणु0x365e, 0xffपूर्ण,
	अणु0x3668, 0x00पूर्ण,
	अणु0x366a, 0x07पूर्ण,
	अणु0x366e, 0x10पूर्ण,
	अणु0x366d, 0x00पूर्ण,
	अणु0x366f, 0x80पूर्ण,
	अणु0x3700, 0x28पूर्ण,
	अणु0x3701, 0x10पूर्ण,
	अणु0x3702, 0x3aपूर्ण,
	अणु0x3703, 0x19पूर्ण,
	अणु0x3704, 0x10पूर्ण,
	अणु0x3705, 0x00पूर्ण,
	अणु0x3706, 0x66पूर्ण,
	अणु0x3707, 0x08पूर्ण,
	अणु0x3708, 0x34पूर्ण,
	अणु0x3709, 0x40पूर्ण,
	अणु0x370a, 0x01पूर्ण,
	अणु0x370b, 0x1bपूर्ण,
	अणु0x3714, 0x24पूर्ण,
	अणु0x371a, 0x3eपूर्ण,
	अणु0x3733, 0x00पूर्ण,
	अणु0x3734, 0x00पूर्ण,
	अणु0x373a, 0x05पूर्ण,
	अणु0x373b, 0x06पूर्ण,
	अणु0x373c, 0x0aपूर्ण,
	अणु0x373f, 0xa0पूर्ण,
	अणु0x3755, 0x00पूर्ण,
	अणु0x3758, 0x00पूर्ण,
	अणु0x375b, 0x0eपूर्ण,
	अणु0x3766, 0x5fपूर्ण,
	अणु0x3768, 0x00पूर्ण,
	अणु0x3769, 0x22पूर्ण,
	अणु0x3773, 0x08पूर्ण,
	अणु0x3774, 0x1fपूर्ण,
	अणु0x3776, 0x06पूर्ण,
	अणु0x37a0, 0x88पूर्ण,
	अणु0x37a1, 0x5cपूर्ण,
	अणु0x37a7, 0x88पूर्ण,
	अणु0x37a8, 0x70पूर्ण,
	अणु0x37aa, 0x88पूर्ण,
	अणु0x37ab, 0x48पूर्ण,
	अणु0x37b3, 0x66पूर्ण,
	अणु0x37c2, 0x04पूर्ण,
	अणु0x37c5, 0x00पूर्ण,
	अणु0x37c8, 0x00पूर्ण,
	अणु0x3800, 0x00पूर्ण,
	अणु0x3801, 0x0cपूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x04पूर्ण,
	अणु0x3804, 0x0aपूर्ण,
	अणु0x3805, 0x33पूर्ण,
	अणु0x3806, 0x07पूर्ण,
	अणु0x3807, 0xa3पूर्ण,
	अणु0x3808, 0x0aपूर्ण,
	अणु0x3809, 0x00पूर्ण,
	अणु0x380a, 0x05पूर्ण,
	अणु0x380b, 0xa0पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0x90पूर्ण,
	अणु0x380e, 0x08पूर्ण,
	अणु0x380f, 0x08पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3813, 0x02पूर्ण,
	अणु0x3814, 0x01पूर्ण,
	अणु0x3815, 0x01पूर्ण,
	अणु0x3816, 0x00पूर्ण,
	अणु0x3817, 0x00पूर्ण,
	अणु0x3818, 0x00पूर्ण,
	अणु0x3819, 0x00पूर्ण,
	अणु0x3820, 0x84पूर्ण,
	अणु0x3821, 0x46पूर्ण,
	अणु0x3822, 0x48पूर्ण,
	अणु0x3826, 0x00पूर्ण,
	अणु0x3827, 0x08पूर्ण,
	अणु0x382a, 0x01पूर्ण,
	अणु0x382b, 0x01पूर्ण,
	अणु0x3830, 0x08पूर्ण,
	अणु0x3836, 0x02पूर्ण,
	अणु0x3837, 0x00पूर्ण,
	अणु0x3838, 0x10पूर्ण,
	अणु0x3841, 0xffपूर्ण,
	अणु0x3846, 0x48पूर्ण,
	अणु0x3861, 0x00पूर्ण,
	अणु0x3862, 0x04पूर्ण,
	अणु0x3863, 0x06पूर्ण,
	अणु0x3a11, 0x01पूर्ण,
	अणु0x3a12, 0x78पूर्ण,
	अणु0x3b00, 0x00पूर्ण,
	अणु0x3b02, 0x00पूर्ण,
	अणु0x3b03, 0x00पूर्ण,
	अणु0x3b04, 0x00पूर्ण,
	अणु0x3b05, 0x00पूर्ण,
	अणु0x3c00, 0x89पूर्ण,
	अणु0x3c01, 0xabपूर्ण,
	अणु0x3c02, 0x01पूर्ण,
	अणु0x3c03, 0x00पूर्ण,
	अणु0x3c04, 0x00पूर्ण,
	अणु0x3c05, 0x03पूर्ण,
	अणु0x3c06, 0x00पूर्ण,
	अणु0x3c07, 0x05पूर्ण,
	अणु0x3c0c, 0x00पूर्ण,
	अणु0x3c0d, 0x00पूर्ण,
	अणु0x3c0e, 0x00पूर्ण,
	अणु0x3c0f, 0x00पूर्ण,
	अणु0x3c40, 0x00पूर्ण,
	अणु0x3c41, 0xa3पूर्ण,
	अणु0x3c43, 0x7dपूर्ण,
	अणु0x3c45, 0xd7पूर्ण,
	अणु0x3c47, 0xfcपूर्ण,
	अणु0x3c50, 0x05पूर्ण,
	अणु0x3c52, 0xaaपूर्ण,
	अणु0x3c54, 0x71पूर्ण,
	अणु0x3c56, 0x80पूर्ण,
	अणु0x3d85, 0x17पूर्ण,
	अणु0x3f03, 0x00पूर्ण,
	अणु0x3f0a, 0x00पूर्ण,
	अणु0x3f0b, 0x00पूर्ण,
	अणु0x4001, 0x60पूर्ण,
	अणु0x4009, 0x0dपूर्ण,
	अणु0x4020, 0x00पूर्ण,
	अणु0x4021, 0x00पूर्ण,
	अणु0x4022, 0x00पूर्ण,
	अणु0x4023, 0x00पूर्ण,
	अणु0x4024, 0x00पूर्ण,
	अणु0x4025, 0x00पूर्ण,
	अणु0x4026, 0x00पूर्ण,
	अणु0x4027, 0x00पूर्ण,
	अणु0x4028, 0x00पूर्ण,
	अणु0x4029, 0x00पूर्ण,
	अणु0x402a, 0x00पूर्ण,
	अणु0x402b, 0x00पूर्ण,
	अणु0x402c, 0x00पूर्ण,
	अणु0x402d, 0x00पूर्ण,
	अणु0x402e, 0x00पूर्ण,
	अणु0x402f, 0x00पूर्ण,
	अणु0x4040, 0x00पूर्ण,
	अणु0x4041, 0x03पूर्ण,
	अणु0x4042, 0x00पूर्ण,
	अणु0x4043, 0x7Aपूर्ण,
	अणु0x4044, 0x00पूर्ण,
	अणु0x4045, 0x7Aपूर्ण,
	अणु0x4046, 0x00पूर्ण,
	अणु0x4047, 0x7Aपूर्ण,
	अणु0x4048, 0x00पूर्ण,
	अणु0x4049, 0x7Aपूर्ण,
	अणु0x4307, 0x30पूर्ण,
	अणु0x4500, 0x58पूर्ण,
	अणु0x4501, 0x04पूर्ण,
	अणु0x4502, 0x40पूर्ण,
	अणु0x4503, 0x10पूर्ण,
	अणु0x4508, 0xaaपूर्ण,
	अणु0x4509, 0xaaपूर्ण,
	अणु0x450a, 0x00पूर्ण,
	अणु0x450b, 0x00पूर्ण,
	अणु0x4600, 0x01पूर्ण,
	अणु0x4601, 0x00पूर्ण,
	अणु0x4700, 0xa4पूर्ण,
	अणु0x4800, 0x4cपूर्ण,
	अणु0x4816, 0x53पूर्ण,
	अणु0x481f, 0x40पूर्ण,
	अणु0x4837, 0x13पूर्ण,
	अणु0x5000, 0x56पूर्ण,
	अणु0x5001, 0x01पूर्ण,
	अणु0x5002, 0x28पूर्ण,
	अणु0x5004, 0x0cपूर्ण,
	अणु0x5006, 0x0cपूर्ण,
	अणु0x5007, 0xe0पूर्ण,
	अणु0x5008, 0x01पूर्ण,
	अणु0x5009, 0xb0पूर्ण,
	अणु0x5901, 0x00पूर्ण,
	अणु0x5a01, 0x00पूर्ण,
	अणु0x5a03, 0x00पूर्ण,
	अणु0x5a04, 0x0cपूर्ण,
	अणु0x5a05, 0xe0पूर्ण,
	अणु0x5a06, 0x09पूर्ण,
	अणु0x5a07, 0xb0पूर्ण,
	अणु0x5a08, 0x06पूर्ण,
	अणु0x5e00, 0x00पूर्ण,
	अणु0x3734, 0x40पूर्ण,
	अणु0x5b00, 0x01पूर्ण,
	अणु0x5b01, 0x10पूर्ण,
	अणु0x5b02, 0x01पूर्ण,
	अणु0x5b03, 0xdbपूर्ण,
	अणु0x3d8c, 0x71पूर्ण,
	अणु0x3d8d, 0xeaपूर्ण,
	अणु0x4017, 0x08पूर्ण,
	अणु0x3618, 0x2aपूर्ण,
	अणु0x5780, 0x3eपूर्ण,
	अणु0x5781, 0x0fपूर्ण,
	अणु0x5782, 0x44पूर्ण,
	अणु0x5783, 0x02पूर्ण,
	अणु0x5784, 0x01पूर्ण,
	अणु0x5785, 0x01पूर्ण,
	अणु0x5786, 0x00पूर्ण,
	अणु0x5787, 0x04पूर्ण,
	अणु0x5788, 0x02पूर्ण,
	अणु0x5789, 0x0fपूर्ण,
	अणु0x578a, 0xfdपूर्ण,
	अणु0x578b, 0xf5पूर्ण,
	अणु0x578c, 0xf5पूर्ण,
	अणु0x578d, 0x03पूर्ण,
	अणु0x578e, 0x08पूर्ण,
	अणु0x578f, 0x0cपूर्ण,
	अणु0x5790, 0x08पूर्ण,
	अणु0x5791, 0x06पूर्ण,
	अणु0x5792, 0x00पूर्ण,
	अणु0x5793, 0x52पूर्ण,
	अणु0x5794, 0xa3पूर्ण,
	अणु0x5045, 0x05पूर्ण,
	अणु0x4003, 0x40पूर्ण,
	अणु0x5048, 0x40पूर्ण
पूर्ण;

अटल स्थिर काष्ठा ov5670_reg mode_1280x720_regs[] = अणु
	अणु0x3000, 0x00पूर्ण,
	अणु0x3002, 0x21पूर्ण,
	अणु0x3005, 0xf0पूर्ण,
	अणु0x3007, 0x00पूर्ण,
	अणु0x3015, 0x0fपूर्ण,
	अणु0x3018, 0x32पूर्ण,
	अणु0x301a, 0xf0पूर्ण,
	अणु0x301b, 0xf0पूर्ण,
	अणु0x301c, 0xf0पूर्ण,
	अणु0x301d, 0xf0पूर्ण,
	अणु0x301e, 0xf0पूर्ण,
	अणु0x3030, 0x00पूर्ण,
	अणु0x3031, 0x0aपूर्ण,
	अणु0x303c, 0xffपूर्ण,
	अणु0x303e, 0xffपूर्ण,
	अणु0x3040, 0xf0पूर्ण,
	अणु0x3041, 0x00पूर्ण,
	अणु0x3042, 0xf0पूर्ण,
	अणु0x3106, 0x11पूर्ण,
	अणु0x3500, 0x00पूर्ण,
	अणु0x3501, 0x80पूर्ण,
	अणु0x3502, 0x00पूर्ण,
	अणु0x3503, 0x04पूर्ण,
	अणु0x3504, 0x03पूर्ण,
	अणु0x3505, 0x83पूर्ण,
	अणु0x3508, 0x04पूर्ण,
	अणु0x3509, 0x00पूर्ण,
	अणु0x350e, 0x04पूर्ण,
	अणु0x350f, 0x00पूर्ण,
	अणु0x3510, 0x00पूर्ण,
	अणु0x3511, 0x02पूर्ण,
	अणु0x3512, 0x00पूर्ण,
	अणु0x3601, 0xc8पूर्ण,
	अणु0x3610, 0x88पूर्ण,
	अणु0x3612, 0x48पूर्ण,
	अणु0x3614, 0x5bपूर्ण,
	अणु0x3615, 0x96पूर्ण,
	अणु0x3621, 0xd0पूर्ण,
	अणु0x3622, 0x00पूर्ण,
	अणु0x3623, 0x00पूर्ण,
	अणु0x3633, 0x13पूर्ण,
	अणु0x3634, 0x13पूर्ण,
	अणु0x3635, 0x13पूर्ण,
	अणु0x3636, 0x13पूर्ण,
	अणु0x3645, 0x13पूर्ण,
	अणु0x3646, 0x82पूर्ण,
	अणु0x3650, 0x00पूर्ण,
	अणु0x3652, 0xffपूर्ण,
	अणु0x3655, 0x20पूर्ण,
	अणु0x3656, 0xffपूर्ण,
	अणु0x365a, 0xffपूर्ण,
	अणु0x365e, 0xffपूर्ण,
	अणु0x3668, 0x00पूर्ण,
	अणु0x366a, 0x07पूर्ण,
	अणु0x366e, 0x08पूर्ण,
	अणु0x366d, 0x00पूर्ण,
	अणु0x366f, 0x80पूर्ण,
	अणु0x3700, 0x28पूर्ण,
	अणु0x3701, 0x10पूर्ण,
	अणु0x3702, 0x3aपूर्ण,
	अणु0x3703, 0x19पूर्ण,
	अणु0x3704, 0x10पूर्ण,
	अणु0x3705, 0x00पूर्ण,
	अणु0x3706, 0x66पूर्ण,
	अणु0x3707, 0x08पूर्ण,
	अणु0x3708, 0x34पूर्ण,
	अणु0x3709, 0x40पूर्ण,
	अणु0x370a, 0x01पूर्ण,
	अणु0x370b, 0x1bपूर्ण,
	अणु0x3714, 0x24पूर्ण,
	अणु0x371a, 0x3eपूर्ण,
	अणु0x3733, 0x00पूर्ण,
	अणु0x3734, 0x00पूर्ण,
	अणु0x373a, 0x05पूर्ण,
	अणु0x373b, 0x06पूर्ण,
	अणु0x373c, 0x0aपूर्ण,
	अणु0x373f, 0xa0पूर्ण,
	अणु0x3755, 0x00पूर्ण,
	अणु0x3758, 0x00पूर्ण,
	अणु0x375b, 0x0eपूर्ण,
	अणु0x3766, 0x5fपूर्ण,
	अणु0x3768, 0x00पूर्ण,
	अणु0x3769, 0x22पूर्ण,
	अणु0x3773, 0x08पूर्ण,
	अणु0x3774, 0x1fपूर्ण,
	अणु0x3776, 0x06पूर्ण,
	अणु0x37a0, 0x88पूर्ण,
	अणु0x37a1, 0x5cपूर्ण,
	अणु0x37a7, 0x88पूर्ण,
	अणु0x37a8, 0x70पूर्ण,
	अणु0x37aa, 0x88पूर्ण,
	अणु0x37ab, 0x48पूर्ण,
	अणु0x37b3, 0x66पूर्ण,
	अणु0x37c2, 0x04पूर्ण,
	अणु0x37c5, 0x00पूर्ण,
	अणु0x37c8, 0x00पूर्ण,
	अणु0x3800, 0x00पूर्ण,
	अणु0x3801, 0x0cपूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x04पूर्ण,
	अणु0x3804, 0x0aपूर्ण,
	अणु0x3805, 0x33पूर्ण,
	अणु0x3806, 0x07पूर्ण,
	अणु0x3807, 0xa3पूर्ण,
	अणु0x3808, 0x05पूर्ण,
	अणु0x3809, 0x00पूर्ण,
	अणु0x380a, 0x02पूर्ण,
	अणु0x380b, 0xd0पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0x90पूर्ण,
	अणु0x380e, 0x08पूर्ण,
	अणु0x380f, 0x08पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3813, 0x02पूर्ण,
	अणु0x3814, 0x03पूर्ण,
	अणु0x3815, 0x01पूर्ण,
	अणु0x3816, 0x00पूर्ण,
	अणु0x3817, 0x00पूर्ण,
	अणु0x3818, 0x00पूर्ण,
	अणु0x3819, 0x00पूर्ण,
	अणु0x3820, 0x94पूर्ण,
	अणु0x3821, 0x47पूर्ण,
	अणु0x3822, 0x48पूर्ण,
	अणु0x3826, 0x00पूर्ण,
	अणु0x3827, 0x08पूर्ण,
	अणु0x382a, 0x03पूर्ण,
	अणु0x382b, 0x01पूर्ण,
	अणु0x3830, 0x08पूर्ण,
	अणु0x3836, 0x02पूर्ण,
	अणु0x3837, 0x00पूर्ण,
	अणु0x3838, 0x10पूर्ण,
	अणु0x3841, 0xffपूर्ण,
	अणु0x3846, 0x48पूर्ण,
	अणु0x3861, 0x00पूर्ण,
	अणु0x3862, 0x04पूर्ण,
	अणु0x3863, 0x06पूर्ण,
	अणु0x3a11, 0x01पूर्ण,
	अणु0x3a12, 0x78पूर्ण,
	अणु0x3b00, 0x00पूर्ण,
	अणु0x3b02, 0x00पूर्ण,
	अणु0x3b03, 0x00पूर्ण,
	अणु0x3b04, 0x00पूर्ण,
	अणु0x3b05, 0x00पूर्ण,
	अणु0x3c00, 0x89पूर्ण,
	अणु0x3c01, 0xabपूर्ण,
	अणु0x3c02, 0x01पूर्ण,
	अणु0x3c03, 0x00पूर्ण,
	अणु0x3c04, 0x00पूर्ण,
	अणु0x3c05, 0x03पूर्ण,
	अणु0x3c06, 0x00पूर्ण,
	अणु0x3c07, 0x05पूर्ण,
	अणु0x3c0c, 0x00पूर्ण,
	अणु0x3c0d, 0x00पूर्ण,
	अणु0x3c0e, 0x00पूर्ण,
	अणु0x3c0f, 0x00पूर्ण,
	अणु0x3c40, 0x00पूर्ण,
	अणु0x3c41, 0xa3पूर्ण,
	अणु0x3c43, 0x7dपूर्ण,
	अणु0x3c45, 0xd7पूर्ण,
	अणु0x3c47, 0xfcपूर्ण,
	अणु0x3c50, 0x05पूर्ण,
	अणु0x3c52, 0xaaपूर्ण,
	अणु0x3c54, 0x71पूर्ण,
	अणु0x3c56, 0x80पूर्ण,
	अणु0x3d85, 0x17पूर्ण,
	अणु0x3f03, 0x00पूर्ण,
	अणु0x3f0a, 0x00पूर्ण,
	अणु0x3f0b, 0x00पूर्ण,
	अणु0x4001, 0x60पूर्ण,
	अणु0x4009, 0x05पूर्ण,
	अणु0x4020, 0x00पूर्ण,
	अणु0x4021, 0x00पूर्ण,
	अणु0x4022, 0x00पूर्ण,
	अणु0x4023, 0x00पूर्ण,
	अणु0x4024, 0x00पूर्ण,
	अणु0x4025, 0x00पूर्ण,
	अणु0x4026, 0x00पूर्ण,
	अणु0x4027, 0x00पूर्ण,
	अणु0x4028, 0x00पूर्ण,
	अणु0x4029, 0x00पूर्ण,
	अणु0x402a, 0x00पूर्ण,
	अणु0x402b, 0x00पूर्ण,
	अणु0x402c, 0x00पूर्ण,
	अणु0x402d, 0x00पूर्ण,
	अणु0x402e, 0x00पूर्ण,
	अणु0x402f, 0x00पूर्ण,
	अणु0x4040, 0x00पूर्ण,
	अणु0x4041, 0x03पूर्ण,
	अणु0x4042, 0x00पूर्ण,
	अणु0x4043, 0x7Aपूर्ण,
	अणु0x4044, 0x00पूर्ण,
	अणु0x4045, 0x7Aपूर्ण,
	अणु0x4046, 0x00पूर्ण,
	अणु0x4047, 0x7Aपूर्ण,
	अणु0x4048, 0x00पूर्ण,
	अणु0x4049, 0x7Aपूर्ण,
	अणु0x4307, 0x30पूर्ण,
	अणु0x4500, 0x58पूर्ण,
	अणु0x4501, 0x04पूर्ण,
	अणु0x4502, 0x48पूर्ण,
	अणु0x4503, 0x10पूर्ण,
	अणु0x4508, 0x55पूर्ण,
	अणु0x4509, 0x55पूर्ण,
	अणु0x450a, 0x00पूर्ण,
	अणु0x450b, 0x00पूर्ण,
	अणु0x4600, 0x00पूर्ण,
	अणु0x4601, 0x80पूर्ण,
	अणु0x4700, 0xa4पूर्ण,
	अणु0x4800, 0x4cपूर्ण,
	अणु0x4816, 0x53पूर्ण,
	अणु0x481f, 0x40पूर्ण,
	अणु0x4837, 0x13पूर्ण,
	अणु0x5000, 0x56पूर्ण,
	अणु0x5001, 0x01पूर्ण,
	अणु0x5002, 0x28पूर्ण,
	अणु0x5004, 0x0cपूर्ण,
	अणु0x5006, 0x0cपूर्ण,
	अणु0x5007, 0xe0पूर्ण,
	अणु0x5008, 0x01पूर्ण,
	अणु0x5009, 0xb0पूर्ण,
	अणु0x5901, 0x00पूर्ण,
	अणु0x5a01, 0x00पूर्ण,
	अणु0x5a03, 0x00पूर्ण,
	अणु0x5a04, 0x0cपूर्ण,
	अणु0x5a05, 0xe0पूर्ण,
	अणु0x5a06, 0x09पूर्ण,
	अणु0x5a07, 0xb0पूर्ण,
	अणु0x5a08, 0x06पूर्ण,
	अणु0x5e00, 0x00पूर्ण,
	अणु0x3734, 0x40पूर्ण,
	अणु0x5b00, 0x01पूर्ण,
	अणु0x5b01, 0x10पूर्ण,
	अणु0x5b02, 0x01पूर्ण,
	अणु0x5b03, 0xdbपूर्ण,
	अणु0x3d8c, 0x71पूर्ण,
	अणु0x3d8d, 0xeaपूर्ण,
	अणु0x4017, 0x10पूर्ण,
	अणु0x3618, 0x2aपूर्ण,
	अणु0x5780, 0x3eपूर्ण,
	अणु0x5781, 0x0fपूर्ण,
	अणु0x5782, 0x44पूर्ण,
	अणु0x5783, 0x02पूर्ण,
	अणु0x5784, 0x01पूर्ण,
	अणु0x5785, 0x01पूर्ण,
	अणु0x5786, 0x00पूर्ण,
	अणु0x5787, 0x04पूर्ण,
	अणु0x5788, 0x02पूर्ण,
	अणु0x5789, 0x0fपूर्ण,
	अणु0x578a, 0xfdपूर्ण,
	अणु0x578b, 0xf5पूर्ण,
	अणु0x578c, 0xf5पूर्ण,
	अणु0x578d, 0x03पूर्ण,
	अणु0x578e, 0x08पूर्ण,
	अणु0x578f, 0x0cपूर्ण,
	अणु0x5790, 0x08पूर्ण,
	अणु0x5791, 0x06पूर्ण,
	अणु0x5792, 0x00पूर्ण,
	अणु0x5793, 0x52पूर्ण,
	अणु0x5794, 0xa3पूर्ण,
	अणु0x3503, 0x00पूर्ण,
	अणु0x5045, 0x05पूर्ण,
	अणु0x4003, 0x40पूर्ण,
	अणु0x5048, 0x40पूर्ण
पूर्ण;

अटल स्थिर काष्ठा ov5670_reg mode_640x360_regs[] = अणु
	अणु0x3000, 0x00पूर्ण,
	अणु0x3002, 0x21पूर्ण,
	अणु0x3005, 0xf0पूर्ण,
	अणु0x3007, 0x00पूर्ण,
	अणु0x3015, 0x0fपूर्ण,
	अणु0x3018, 0x32पूर्ण,
	अणु0x301a, 0xf0पूर्ण,
	अणु0x301b, 0xf0पूर्ण,
	अणु0x301c, 0xf0पूर्ण,
	अणु0x301d, 0xf0पूर्ण,
	अणु0x301e, 0xf0पूर्ण,
	अणु0x3030, 0x00पूर्ण,
	अणु0x3031, 0x0aपूर्ण,
	अणु0x303c, 0xffपूर्ण,
	अणु0x303e, 0xffपूर्ण,
	अणु0x3040, 0xf0पूर्ण,
	अणु0x3041, 0x00पूर्ण,
	अणु0x3042, 0xf0पूर्ण,
	अणु0x3106, 0x11पूर्ण,
	अणु0x3500, 0x00पूर्ण,
	अणु0x3501, 0x80पूर्ण,
	अणु0x3502, 0x00पूर्ण,
	अणु0x3503, 0x04पूर्ण,
	अणु0x3504, 0x03पूर्ण,
	अणु0x3505, 0x83पूर्ण,
	अणु0x3508, 0x04पूर्ण,
	अणु0x3509, 0x00पूर्ण,
	अणु0x350e, 0x04पूर्ण,
	अणु0x350f, 0x00पूर्ण,
	अणु0x3510, 0x00पूर्ण,
	अणु0x3511, 0x02पूर्ण,
	अणु0x3512, 0x00पूर्ण,
	अणु0x3601, 0xc8पूर्ण,
	अणु0x3610, 0x88पूर्ण,
	अणु0x3612, 0x48पूर्ण,
	अणु0x3614, 0x5bपूर्ण,
	अणु0x3615, 0x96पूर्ण,
	अणु0x3621, 0xd0पूर्ण,
	अणु0x3622, 0x00पूर्ण,
	अणु0x3623, 0x04पूर्ण,
	अणु0x3633, 0x13पूर्ण,
	अणु0x3634, 0x13पूर्ण,
	अणु0x3635, 0x13पूर्ण,
	अणु0x3636, 0x13पूर्ण,
	अणु0x3645, 0x13पूर्ण,
	अणु0x3646, 0x82पूर्ण,
	अणु0x3650, 0x00पूर्ण,
	अणु0x3652, 0xffपूर्ण,
	अणु0x3655, 0x20पूर्ण,
	अणु0x3656, 0xffपूर्ण,
	अणु0x365a, 0xffपूर्ण,
	अणु0x365e, 0xffपूर्ण,
	अणु0x3668, 0x00पूर्ण,
	अणु0x366a, 0x07पूर्ण,
	अणु0x366e, 0x08पूर्ण,
	अणु0x366d, 0x00पूर्ण,
	अणु0x366f, 0x80पूर्ण,
	अणु0x3700, 0x28पूर्ण,
	अणु0x3701, 0x10पूर्ण,
	अणु0x3702, 0x3aपूर्ण,
	अणु0x3703, 0x19पूर्ण,
	अणु0x3704, 0x10पूर्ण,
	अणु0x3705, 0x00पूर्ण,
	अणु0x3706, 0x66पूर्ण,
	अणु0x3707, 0x08पूर्ण,
	अणु0x3708, 0x34पूर्ण,
	अणु0x3709, 0x40पूर्ण,
	अणु0x370a, 0x01पूर्ण,
	अणु0x370b, 0x1bपूर्ण,
	अणु0x3714, 0x24पूर्ण,
	अणु0x371a, 0x3eपूर्ण,
	अणु0x3733, 0x00पूर्ण,
	अणु0x3734, 0x00पूर्ण,
	अणु0x373a, 0x05पूर्ण,
	अणु0x373b, 0x06पूर्ण,
	अणु0x373c, 0x0aपूर्ण,
	अणु0x373f, 0xa0पूर्ण,
	अणु0x3755, 0x00पूर्ण,
	अणु0x3758, 0x00पूर्ण,
	अणु0x375b, 0x0eपूर्ण,
	अणु0x3766, 0x5fपूर्ण,
	अणु0x3768, 0x00पूर्ण,
	अणु0x3769, 0x22पूर्ण,
	अणु0x3773, 0x08पूर्ण,
	अणु0x3774, 0x1fपूर्ण,
	अणु0x3776, 0x06पूर्ण,
	अणु0x37a0, 0x88पूर्ण,
	अणु0x37a1, 0x5cपूर्ण,
	अणु0x37a7, 0x88पूर्ण,
	अणु0x37a8, 0x70पूर्ण,
	अणु0x37aa, 0x88पूर्ण,
	अणु0x37ab, 0x48पूर्ण,
	अणु0x37b3, 0x66पूर्ण,
	अणु0x37c2, 0x04पूर्ण,
	अणु0x37c5, 0x00पूर्ण,
	अणु0x37c8, 0x00पूर्ण,
	अणु0x3800, 0x00पूर्ण,
	अणु0x3801, 0x0cपूर्ण,
	अणु0x3802, 0x00पूर्ण,
	अणु0x3803, 0x04पूर्ण,
	अणु0x3804, 0x0aपूर्ण,
	अणु0x3805, 0x33पूर्ण,
	अणु0x3806, 0x07पूर्ण,
	अणु0x3807, 0xa3पूर्ण,
	अणु0x3808, 0x02पूर्ण,
	अणु0x3809, 0x80पूर्ण,
	अणु0x380a, 0x01पूर्ण,
	अणु0x380b, 0x68पूर्ण,
	अणु0x380c, 0x06पूर्ण,
	अणु0x380d, 0x90पूर्ण,
	अणु0x380e, 0x08पूर्ण,
	अणु0x380f, 0x08पूर्ण,
	अणु0x3811, 0x04पूर्ण,
	अणु0x3813, 0x02पूर्ण,
	अणु0x3814, 0x07पूर्ण,
	अणु0x3815, 0x01पूर्ण,
	अणु0x3816, 0x00पूर्ण,
	अणु0x3817, 0x00पूर्ण,
	अणु0x3818, 0x00पूर्ण,
	अणु0x3819, 0x00पूर्ण,
	अणु0x3820, 0x94पूर्ण,
	अणु0x3821, 0xc6पूर्ण,
	अणु0x3822, 0x48पूर्ण,
	अणु0x3826, 0x00पूर्ण,
	अणु0x3827, 0x08पूर्ण,
	अणु0x382a, 0x07पूर्ण,
	अणु0x382b, 0x01पूर्ण,
	अणु0x3830, 0x08पूर्ण,
	अणु0x3836, 0x02पूर्ण,
	अणु0x3837, 0x00पूर्ण,
	अणु0x3838, 0x10पूर्ण,
	अणु0x3841, 0xffपूर्ण,
	अणु0x3846, 0x48पूर्ण,
	अणु0x3861, 0x00पूर्ण,
	अणु0x3862, 0x04पूर्ण,
	अणु0x3863, 0x06पूर्ण,
	अणु0x3a11, 0x01पूर्ण,
	अणु0x3a12, 0x78पूर्ण,
	अणु0x3b00, 0x00पूर्ण,
	अणु0x3b02, 0x00पूर्ण,
	अणु0x3b03, 0x00पूर्ण,
	अणु0x3b04, 0x00पूर्ण,
	अणु0x3b05, 0x00पूर्ण,
	अणु0x3c00, 0x89पूर्ण,
	अणु0x3c01, 0xabपूर्ण,
	अणु0x3c02, 0x01पूर्ण,
	अणु0x3c03, 0x00पूर्ण,
	अणु0x3c04, 0x00पूर्ण,
	अणु0x3c05, 0x03पूर्ण,
	अणु0x3c06, 0x00पूर्ण,
	अणु0x3c07, 0x05पूर्ण,
	अणु0x3c0c, 0x00पूर्ण,
	अणु0x3c0d, 0x00पूर्ण,
	अणु0x3c0e, 0x00पूर्ण,
	अणु0x3c0f, 0x00पूर्ण,
	अणु0x3c40, 0x00पूर्ण,
	अणु0x3c41, 0xa3पूर्ण,
	अणु0x3c43, 0x7dपूर्ण,
	अणु0x3c45, 0xd7पूर्ण,
	अणु0x3c47, 0xfcपूर्ण,
	अणु0x3c50, 0x05पूर्ण,
	अणु0x3c52, 0xaaपूर्ण,
	अणु0x3c54, 0x71पूर्ण,
	अणु0x3c56, 0x80पूर्ण,
	अणु0x3d85, 0x17पूर्ण,
	अणु0x3f03, 0x00पूर्ण,
	अणु0x3f0a, 0x00पूर्ण,
	अणु0x3f0b, 0x00पूर्ण,
	अणु0x4001, 0x60पूर्ण,
	अणु0x4009, 0x05पूर्ण,
	अणु0x4020, 0x00पूर्ण,
	अणु0x4021, 0x00पूर्ण,
	अणु0x4022, 0x00पूर्ण,
	अणु0x4023, 0x00पूर्ण,
	अणु0x4024, 0x00पूर्ण,
	अणु0x4025, 0x00पूर्ण,
	अणु0x4026, 0x00पूर्ण,
	अणु0x4027, 0x00पूर्ण,
	अणु0x4028, 0x00पूर्ण,
	अणु0x4029, 0x00पूर्ण,
	अणु0x402a, 0x00पूर्ण,
	अणु0x402b, 0x00पूर्ण,
	अणु0x402c, 0x00पूर्ण,
	अणु0x402d, 0x00पूर्ण,
	अणु0x402e, 0x00पूर्ण,
	अणु0x402f, 0x00पूर्ण,
	अणु0x4040, 0x00पूर्ण,
	अणु0x4041, 0x03पूर्ण,
	अणु0x4042, 0x00पूर्ण,
	अणु0x4043, 0x7Aपूर्ण,
	अणु0x4044, 0x00पूर्ण,
	अणु0x4045, 0x7Aपूर्ण,
	अणु0x4046, 0x00पूर्ण,
	अणु0x4047, 0x7Aपूर्ण,
	अणु0x4048, 0x00पूर्ण,
	अणु0x4049, 0x7Aपूर्ण,
	अणु0x4307, 0x30पूर्ण,
	अणु0x4500, 0x58पूर्ण,
	अणु0x4501, 0x04पूर्ण,
	अणु0x4502, 0x40पूर्ण,
	अणु0x4503, 0x10पूर्ण,
	अणु0x4508, 0x55पूर्ण,
	अणु0x4509, 0x55पूर्ण,
	अणु0x450a, 0x02पूर्ण,
	अणु0x450b, 0x00पूर्ण,
	अणु0x4600, 0x00पूर्ण,
	अणु0x4601, 0x40पूर्ण,
	अणु0x4700, 0xa4पूर्ण,
	अणु0x4800, 0x4cपूर्ण,
	अणु0x4816, 0x53पूर्ण,
	अणु0x481f, 0x40पूर्ण,
	अणु0x4837, 0x13पूर्ण,
	अणु0x5000, 0x56पूर्ण,
	अणु0x5001, 0x01पूर्ण,
	अणु0x5002, 0x28पूर्ण,
	अणु0x5004, 0x0cपूर्ण,
	अणु0x5006, 0x0cपूर्ण,
	अणु0x5007, 0xe0पूर्ण,
	अणु0x5008, 0x01पूर्ण,
	अणु0x5009, 0xb0पूर्ण,
	अणु0x5901, 0x00पूर्ण,
	अणु0x5a01, 0x00पूर्ण,
	अणु0x5a03, 0x00पूर्ण,
	अणु0x5a04, 0x0cपूर्ण,
	अणु0x5a05, 0xe0पूर्ण,
	अणु0x5a06, 0x09पूर्ण,
	अणु0x5a07, 0xb0पूर्ण,
	अणु0x5a08, 0x06पूर्ण,
	अणु0x5e00, 0x00पूर्ण,
	अणु0x3734, 0x40पूर्ण,
	अणु0x5b00, 0x01पूर्ण,
	अणु0x5b01, 0x10पूर्ण,
	अणु0x5b02, 0x01पूर्ण,
	अणु0x5b03, 0xdbपूर्ण,
	अणु0x3d8c, 0x71पूर्ण,
	अणु0x3d8d, 0xeaपूर्ण,
	अणु0x4017, 0x10पूर्ण,
	अणु0x3618, 0x2aपूर्ण,
	अणु0x5780, 0x3eपूर्ण,
	अणु0x5781, 0x0fपूर्ण,
	अणु0x5782, 0x44पूर्ण,
	अणु0x5783, 0x02पूर्ण,
	अणु0x5784, 0x01पूर्ण,
	अणु0x5785, 0x01पूर्ण,
	अणु0x5786, 0x00पूर्ण,
	अणु0x5787, 0x04पूर्ण,
	अणु0x5788, 0x02पूर्ण,
	अणु0x5789, 0x0fपूर्ण,
	अणु0x578a, 0xfdपूर्ण,
	अणु0x578b, 0xf5पूर्ण,
	अणु0x578c, 0xf5पूर्ण,
	अणु0x578d, 0x03पूर्ण,
	अणु0x578e, 0x08पूर्ण,
	अणु0x578f, 0x0cपूर्ण,
	अणु0x5790, 0x08पूर्ण,
	अणु0x5791, 0x06पूर्ण,
	अणु0x5792, 0x00पूर्ण,
	अणु0x5793, 0x52पूर्ण,
	अणु0x5794, 0xa3पूर्ण,
	अणु0x3503, 0x00पूर्ण,
	अणु0x5045, 0x05पूर्ण,
	अणु0x4003, 0x40पूर्ण,
	अणु0x5048, 0x40पूर्ण
पूर्ण;

अटल स्थिर अक्षर * स्थिर ov5670_test_pattern_menu[] = अणु
	"Disabled",
	"Vertical Color Bar Type 1",
पूर्ण;

/* Supported link frequencies */
#घोषणा OV5670_LINK_FREQ_422MHZ		422400000
#घोषणा OV5670_LINK_FREQ_422MHZ_INDEX	0
अटल स्थिर काष्ठा ov5670_link_freq_config link_freq_configs[] = अणु
	अणु
		/* pixel_rate = link_freq * 2 * nr_of_lanes / bits_per_sample */
		.pixel_rate = (OV5670_LINK_FREQ_422MHZ * 2 * 2) / 10,
		.reg_list = अणु
			.num_of_regs = ARRAY_SIZE(mipi_data_rate_840mbps),
			.regs = mipi_data_rate_840mbps,
		पूर्ण
	पूर्ण
पूर्ण;

अटल स्थिर s64 link_freq_menu_items[] = अणु
	OV5670_LINK_FREQ_422MHZ
पूर्ण;

/*
 * OV5670 sensor supports following resolutions with full FOV:
 * 4:3  ==> अणु2592x1944, 1296x972, 648x486पूर्ण
 * 16:9 ==> अणु2560x1440, 1280x720, 640x360पूर्ण
 */
अटल स्थिर काष्ठा ov5670_mode supported_modes[] = अणु
	अणु
		.width = 2592,
		.height = 1944,
		.vts_def = OV5670_VTS_30FPS,
		.vts_min = OV5670_VTS_30FPS,
		.reg_list = अणु
			.num_of_regs = ARRAY_SIZE(mode_2592x1944_regs),
			.regs = mode_2592x1944_regs,
		पूर्ण,
		.link_freq_index = OV5670_LINK_FREQ_422MHZ_INDEX,
	पूर्ण,
	अणु
		.width = 1296,
		.height = 972,
		.vts_def = OV5670_VTS_30FPS,
		.vts_min = 996,
		.reg_list = अणु
			.num_of_regs = ARRAY_SIZE(mode_1296x972_regs),
			.regs = mode_1296x972_regs,
		पूर्ण,
		.link_freq_index = OV5670_LINK_FREQ_422MHZ_INDEX,
	पूर्ण,
	अणु
		.width = 648,
		.height = 486,
		.vts_def = OV5670_VTS_30FPS,
		.vts_min = 516,
		.reg_list = अणु
			.num_of_regs = ARRAY_SIZE(mode_648x486_regs),
			.regs = mode_648x486_regs,
		पूर्ण,
		.link_freq_index = OV5670_LINK_FREQ_422MHZ_INDEX,
	पूर्ण,
	अणु
		.width = 2560,
		.height = 1440,
		.vts_def = OV5670_VTS_30FPS,
		.vts_min = OV5670_VTS_30FPS,
		.reg_list = अणु
			.num_of_regs = ARRAY_SIZE(mode_2560x1440_regs),
			.regs = mode_2560x1440_regs,
		पूर्ण,
		.link_freq_index = OV5670_LINK_FREQ_422MHZ_INDEX,
	पूर्ण,
	अणु
		.width = 1280,
		.height = 720,
		.vts_def = OV5670_VTS_30FPS,
		.vts_min = 1020,
		.reg_list = अणु
			.num_of_regs = ARRAY_SIZE(mode_1280x720_regs),
			.regs = mode_1280x720_regs,
		पूर्ण,
		.link_freq_index = OV5670_LINK_FREQ_422MHZ_INDEX,
	पूर्ण,
	अणु
		.width = 640,
		.height = 360,
		.vts_def = OV5670_VTS_30FPS,
		.vts_min = 510,
		.reg_list = अणु
			.num_of_regs = ARRAY_SIZE(mode_640x360_regs),
			.regs = mode_640x360_regs,
		पूर्ण,
		.link_freq_index = OV5670_LINK_FREQ_422MHZ_INDEX,
	पूर्ण
पूर्ण;

काष्ठा ov5670 अणु
	काष्ठा v4l2_subdev sd;
	काष्ठा media_pad pad;

	काष्ठा v4l2_ctrl_handler ctrl_handler;
	/* V4L2 Controls */
	काष्ठा v4l2_ctrl *link_freq;
	काष्ठा v4l2_ctrl *pixel_rate;
	काष्ठा v4l2_ctrl *vblank;
	काष्ठा v4l2_ctrl *hblank;
	काष्ठा v4l2_ctrl *exposure;

	/* Current mode */
	स्थिर काष्ठा ov5670_mode *cur_mode;

	/* To serialize asynchronus callbacks */
	काष्ठा mutex mutex;

	/* Streaming on/off */
	bool streaming;
पूर्ण;

#घोषणा to_ov5670(_sd)	container_of(_sd, काष्ठा ov5670, sd)

/* Read रेजिस्टरs up to 4 at a समय */
अटल पूर्णांक ov5670_पढ़ो_reg(काष्ठा ov5670 *ov5670, u16 reg, अचिन्हित पूर्णांक len,
			   u32 *val)
अणु
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	काष्ठा i2c_msg msgs[2];
	u8 *data_be_p;
	__be32 data_be = 0;
	__be16 reg_addr_be = cpu_to_be16(reg);
	पूर्णांक ret;

	अगर (len > 4)
		वापस -EINVAL;

	data_be_p = (u8 *)&data_be;
	/* Write रेजिस्टर address */
	msgs[0].addr = client->addr;
	msgs[0].flags = 0;
	msgs[0].len = 2;
	msgs[0].buf = (u8 *)&reg_addr_be;

	/* Read data from रेजिस्टर */
	msgs[1].addr = client->addr;
	msgs[1].flags = I2C_M_RD;
	msgs[1].len = len;
	msgs[1].buf = &data_be_p[4 - len];

	ret = i2c_transfer(client->adapter, msgs, ARRAY_SIZE(msgs));
	अगर (ret != ARRAY_SIZE(msgs))
		वापस -EIO;

	*val = be32_to_cpu(data_be);

	वापस 0;
पूर्ण

/* Write रेजिस्टरs up to 4 at a समय */
अटल पूर्णांक ov5670_ग_लिखो_reg(काष्ठा ov5670 *ov5670, u16 reg, अचिन्हित पूर्णांक len,
			    u32 val)
अणु
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	पूर्णांक buf_i;
	पूर्णांक val_i;
	u8 buf[6];
	u8 *val_p;
	__be32 पंचांगp;

	अगर (len > 4)
		वापस -EINVAL;

	buf[0] = reg >> 8;
	buf[1] = reg & 0xff;

	पंचांगp = cpu_to_be32(val);
	val_p = (u8 *)&पंचांगp;
	buf_i = 2;
	val_i = 4 - len;

	जबतक (val_i < 4)
		buf[buf_i++] = val_p[val_i++];

	अगर (i2c_master_send(client, buf, len + 2) != len + 2)
		वापस -EIO;

	वापस 0;
पूर्ण

/* Write a list of रेजिस्टरs */
अटल पूर्णांक ov5670_ग_लिखो_regs(काष्ठा ov5670 *ov5670,
			     स्थिर काष्ठा ov5670_reg *regs, अचिन्हित पूर्णांक len)
अणु
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	अचिन्हित पूर्णांक i;
	पूर्णांक ret;

	क्रम (i = 0; i < len; i++) अणु
		ret = ov5670_ग_लिखो_reg(ov5670, regs[i].address, 1, regs[i].val);
		अगर (ret) अणु
			dev_err_ratelimited(
				&client->dev,
				"Failed to write reg 0x%4.4x. error = %d\n",
				regs[i].address, ret);

			वापस ret;
		पूर्ण
	पूर्ण

	वापस 0;
पूर्ण

अटल पूर्णांक ov5670_ग_लिखो_reg_list(काष्ठा ov5670 *ov5670,
				 स्थिर काष्ठा ov5670_reg_list *r_list)
अणु
	वापस ov5670_ग_लिखो_regs(ov5670, r_list->regs, r_list->num_of_regs);
पूर्ण

/* Open sub-device */
अटल पूर्णांक ov5670_खोलो(काष्ठा v4l2_subdev *sd, काष्ठा v4l2_subdev_fh *fh)
अणु
	काष्ठा ov5670 *ov5670 = to_ov5670(sd);
	काष्ठा v4l2_mbus_framefmt *try_fmt =
				v4l2_subdev_get_try_क्रमmat(sd, fh->pad, 0);

	mutex_lock(&ov5670->mutex);

	/* Initialize try_fmt */
	try_fmt->width = ov5670->cur_mode->width;
	try_fmt->height = ov5670->cur_mode->height;
	try_fmt->code = MEDIA_BUS_FMT_SGRBG10_1X10;
	try_fmt->field = V4L2_FIELD_NONE;

	/* No crop or compose */
	mutex_unlock(&ov5670->mutex);

	वापस 0;
पूर्ण

अटल पूर्णांक ov5670_update_digital_gain(काष्ठा ov5670 *ov5670, u32 d_gain)
अणु
	पूर्णांक ret;

	ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_R_DGTL_GAIN,
			       OV5670_REG_VALUE_16BIT, d_gain);
	अगर (ret)
		वापस ret;

	ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_G_DGTL_GAIN,
			       OV5670_REG_VALUE_16BIT, d_gain);
	अगर (ret)
		वापस ret;

	वापस ov5670_ग_लिखो_reg(ov5670, OV5670_REG_B_DGTL_GAIN,
				OV5670_REG_VALUE_16BIT, d_gain);
पूर्ण

अटल पूर्णांक ov5670_enable_test_pattern(काष्ठा ov5670 *ov5670, u32 pattern)
अणु
	u32 val;
	पूर्णांक ret;

	/* Set the bayer order that we support */
	ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_TEST_PATTERN_CTRL,
			       OV5670_REG_VALUE_08BIT, 0);
	अगर (ret)
		वापस ret;

	ret = ov5670_पढ़ो_reg(ov5670, OV5670_REG_TEST_PATTERN,
			      OV5670_REG_VALUE_08BIT, &val);
	अगर (ret)
		वापस ret;

	अगर (pattern)
		val |= OV5670_TEST_PATTERN_ENABLE;
	अन्यथा
		val &= ~OV5670_TEST_PATTERN_ENABLE;

	वापस ov5670_ग_लिखो_reg(ov5670, OV5670_REG_TEST_PATTERN,
				OV5670_REG_VALUE_08BIT, val);
पूर्ण

/* Initialize control handlers */
अटल पूर्णांक ov5670_set_ctrl(काष्ठा v4l2_ctrl *ctrl)
अणु
	काष्ठा ov5670 *ov5670 = container_of(ctrl->handler,
					     काष्ठा ov5670, ctrl_handler);
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	s64 max;
	पूर्णांक ret = 0;

	/* Propagate change of current control to all related controls */
	चयन (ctrl->id) अणु
	हाल V4L2_CID_VBLANK:
		/* Update max exposure जबतक meeting expected vblanking */
		max = ov5670->cur_mode->height + ctrl->val - 8;
		__v4l2_ctrl_modअगरy_range(ov5670->exposure,
					 ov5670->exposure->minimum, max,
					 ov5670->exposure->step, max);
		अवरोध;
	पूर्ण

	/* V4L2 controls values will be applied only when घातer is alपढ़ोy up */
	अगर (!pm_runसमय_get_अगर_in_use(&client->dev))
		वापस 0;

	चयन (ctrl->id) अणु
	हाल V4L2_CID_ANALOGUE_GAIN:
		ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_ANALOG_GAIN,
				       OV5670_REG_VALUE_16BIT, ctrl->val);
		अवरोध;
	हाल V4L2_CID_DIGITAL_GAIN:
		ret = ov5670_update_digital_gain(ov5670, ctrl->val);
		अवरोध;
	हाल V4L2_CID_EXPOSURE:
		/* 4 least signअगरicant bits of expsoure are fractional part */
		ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_EXPOSURE,
				       OV5670_REG_VALUE_24BIT, ctrl->val << 4);
		अवरोध;
	हाल V4L2_CID_VBLANK:
		/* Update VTS that meets expected vertical blanking */
		ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_VTS,
				       OV5670_REG_VALUE_16BIT,
				       ov5670->cur_mode->height + ctrl->val);
		अवरोध;
	हाल V4L2_CID_TEST_PATTERN:
		ret = ov5670_enable_test_pattern(ov5670, ctrl->val);
		अवरोध;
	शेष:
		dev_info(&client->dev, "%s Unhandled id:0x%x, val:0x%x\n",
			 __func__, ctrl->id, ctrl->val);
		अवरोध;
	पूर्ण

	pm_runसमय_put(&client->dev);

	वापस ret;
पूर्ण

अटल स्थिर काष्ठा v4l2_ctrl_ops ov5670_ctrl_ops = अणु
	.s_ctrl = ov5670_set_ctrl,
पूर्ण;

/* Initialize control handlers */
अटल पूर्णांक ov5670_init_controls(काष्ठा ov5670 *ov5670)
अणु
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	काष्ठा v4l2_fwnode_device_properties props;
	काष्ठा v4l2_ctrl_handler *ctrl_hdlr;
	s64 vblank_max;
	s64 vblank_def;
	s64 vblank_min;
	s64 exposure_max;
	पूर्णांक ret;

	ctrl_hdlr = &ov5670->ctrl_handler;
	ret = v4l2_ctrl_handler_init(ctrl_hdlr, 10);
	अगर (ret)
		वापस ret;

	ctrl_hdlr->lock = &ov5670->mutex;
	ov5670->link_freq = v4l2_ctrl_new_पूर्णांक_menu(ctrl_hdlr,
						   &ov5670_ctrl_ops,
						   V4L2_CID_LINK_FREQ,
						   0, 0, link_freq_menu_items);
	अगर (ov5670->link_freq)
		ov5670->link_freq->flags |= V4L2_CTRL_FLAG_READ_ONLY;

	/* By शेष, V4L2_CID_PIXEL_RATE is पढ़ो only */
	ov5670->pixel_rate = v4l2_ctrl_new_std(ctrl_hdlr, &ov5670_ctrl_ops,
					       V4L2_CID_PIXEL_RATE,
					       link_freq_configs[0].pixel_rate,
					       link_freq_configs[0].pixel_rate,
					       1,
					       link_freq_configs[0].pixel_rate);

	vblank_max = OV5670_VTS_MAX - ov5670->cur_mode->height;
	vblank_def = ov5670->cur_mode->vts_def - ov5670->cur_mode->height;
	vblank_min = ov5670->cur_mode->vts_min - ov5670->cur_mode->height;
	ov5670->vblank = v4l2_ctrl_new_std(ctrl_hdlr, &ov5670_ctrl_ops,
					   V4L2_CID_VBLANK, vblank_min,
					   vblank_max, 1, vblank_def);

	ov5670->hblank = v4l2_ctrl_new_std(
				ctrl_hdlr, &ov5670_ctrl_ops, V4L2_CID_HBLANK,
				OV5670_FIXED_PPL - ov5670->cur_mode->width,
				OV5670_FIXED_PPL - ov5670->cur_mode->width, 1,
				OV5670_FIXED_PPL - ov5670->cur_mode->width);
	अगर (ov5670->hblank)
		ov5670->hblank->flags |= V4L2_CTRL_FLAG_READ_ONLY;

	/* Get min, max, step, शेष from sensor */
	v4l2_ctrl_new_std(ctrl_hdlr, &ov5670_ctrl_ops, V4L2_CID_ANALOGUE_GAIN,
			  ANALOG_GAIN_MIN, ANALOG_GAIN_MAX, ANALOG_GAIN_STEP,
			  ANALOG_GAIN_DEFAULT);

	/* Digital gain */
	v4l2_ctrl_new_std(ctrl_hdlr, &ov5670_ctrl_ops, V4L2_CID_DIGITAL_GAIN,
			  OV5670_DGTL_GAIN_MIN, OV5670_DGTL_GAIN_MAX,
			  OV5670_DGTL_GAIN_STEP, OV5670_DGTL_GAIN_DEFAULT);

	/* Get min, max, step, शेष from sensor */
	exposure_max = ov5670->cur_mode->vts_def - 8;
	ov5670->exposure = v4l2_ctrl_new_std(ctrl_hdlr, &ov5670_ctrl_ops,
					     V4L2_CID_EXPOSURE,
					     OV5670_EXPOSURE_MIN,
					     exposure_max, OV5670_EXPOSURE_STEP,
					     exposure_max);

	v4l2_ctrl_new_std_menu_items(ctrl_hdlr, &ov5670_ctrl_ops,
				     V4L2_CID_TEST_PATTERN,
				     ARRAY_SIZE(ov5670_test_pattern_menu) - 1,
				     0, 0, ov5670_test_pattern_menu);

	अगर (ctrl_hdlr->error) अणु
		ret = ctrl_hdlr->error;
		जाओ error;
	पूर्ण

	ret = v4l2_fwnode_device_parse(&client->dev, &props);
	अगर (ret)
		जाओ error;

	ret = v4l2_ctrl_new_fwnode_properties(ctrl_hdlr, &ov5670_ctrl_ops,
					      &props);
	अगर (ret)
		जाओ error;

	ov5670->sd.ctrl_handler = ctrl_hdlr;

	वापस 0;

error:
	v4l2_ctrl_handler_मुक्त(ctrl_hdlr);

	वापस ret;
पूर्ण

अटल पूर्णांक ov5670_क्रमागत_mbus_code(काष्ठा v4l2_subdev *sd,
				 काष्ठा v4l2_subdev_pad_config *cfg,
				 काष्ठा v4l2_subdev_mbus_code_क्रमागत *code)
अणु
	/* Only one bayer order GRBG is supported */
	अगर (code->index > 0)
		वापस -EINVAL;

	code->code = MEDIA_BUS_FMT_SGRBG10_1X10;

	वापस 0;
पूर्ण

अटल पूर्णांक ov5670_क्रमागत_frame_size(काष्ठा v4l2_subdev *sd,
				  काष्ठा v4l2_subdev_pad_config *cfg,
				  काष्ठा v4l2_subdev_frame_size_क्रमागत *fse)
अणु
	अगर (fse->index >= ARRAY_SIZE(supported_modes))
		वापस -EINVAL;

	अगर (fse->code != MEDIA_BUS_FMT_SGRBG10_1X10)
		वापस -EINVAL;

	fse->min_width = supported_modes[fse->index].width;
	fse->max_width = fse->min_width;
	fse->min_height = supported_modes[fse->index].height;
	fse->max_height = fse->min_height;

	वापस 0;
पूर्ण

अटल व्योम ov5670_update_pad_क्रमmat(स्थिर काष्ठा ov5670_mode *mode,
				     काष्ठा v4l2_subdev_क्रमmat *fmt)
अणु
	fmt->क्रमmat.width = mode->width;
	fmt->क्रमmat.height = mode->height;
	fmt->क्रमmat.code = MEDIA_BUS_FMT_SGRBG10_1X10;
	fmt->क्रमmat.field = V4L2_FIELD_NONE;
पूर्ण

अटल पूर्णांक ov5670_करो_get_pad_क्रमmat(काष्ठा ov5670 *ov5670,
				    काष्ठा v4l2_subdev_pad_config *cfg,
				    काष्ठा v4l2_subdev_क्रमmat *fmt)
अणु
	अगर (fmt->which == V4L2_SUBDEV_FORMAT_TRY)
		fmt->क्रमmat = *v4l2_subdev_get_try_क्रमmat(&ov5670->sd, cfg,
							  fmt->pad);
	अन्यथा
		ov5670_update_pad_क्रमmat(ov5670->cur_mode, fmt);

	वापस 0;
पूर्ण

अटल पूर्णांक ov5670_get_pad_क्रमmat(काष्ठा v4l2_subdev *sd,
				 काष्ठा v4l2_subdev_pad_config *cfg,
				 काष्ठा v4l2_subdev_क्रमmat *fmt)
अणु
	काष्ठा ov5670 *ov5670 = to_ov5670(sd);
	पूर्णांक ret;

	mutex_lock(&ov5670->mutex);
	ret = ov5670_करो_get_pad_क्रमmat(ov5670, cfg, fmt);
	mutex_unlock(&ov5670->mutex);

	वापस ret;
पूर्ण

अटल पूर्णांक ov5670_set_pad_क्रमmat(काष्ठा v4l2_subdev *sd,
				 काष्ठा v4l2_subdev_pad_config *cfg,
				 काष्ठा v4l2_subdev_क्रमmat *fmt)
अणु
	काष्ठा ov5670 *ov5670 = to_ov5670(sd);
	स्थिर काष्ठा ov5670_mode *mode;
	s32 vblank_def;
	s32 h_blank;

	mutex_lock(&ov5670->mutex);

	fmt->क्रमmat.code = MEDIA_BUS_FMT_SGRBG10_1X10;

	mode = v4l2_find_nearest_size(supported_modes,
				      ARRAY_SIZE(supported_modes),
				      width, height,
				      fmt->क्रमmat.width, fmt->क्रमmat.height);
	ov5670_update_pad_क्रमmat(mode, fmt);
	अगर (fmt->which == V4L2_SUBDEV_FORMAT_TRY) अणु
		*v4l2_subdev_get_try_क्रमmat(sd, cfg, fmt->pad) = fmt->क्रमmat;
	पूर्ण अन्यथा अणु
		ov5670->cur_mode = mode;
		__v4l2_ctrl_s_ctrl(ov5670->link_freq, mode->link_freq_index);
		__v4l2_ctrl_s_ctrl_पूर्णांक64(
			ov5670->pixel_rate,
			link_freq_configs[mode->link_freq_index].pixel_rate);
		/* Update limits and set FPS to शेष */
		vblank_def = ov5670->cur_mode->vts_def -
			     ov5670->cur_mode->height;
		__v4l2_ctrl_modअगरy_range(
			ov5670->vblank,
			ov5670->cur_mode->vts_min - ov5670->cur_mode->height,
			OV5670_VTS_MAX - ov5670->cur_mode->height, 1,
			vblank_def);
		__v4l2_ctrl_s_ctrl(ov5670->vblank, vblank_def);
		h_blank = OV5670_FIXED_PPL - ov5670->cur_mode->width;
		__v4l2_ctrl_modअगरy_range(ov5670->hblank, h_blank, h_blank, 1,
					 h_blank);
	पूर्ण

	mutex_unlock(&ov5670->mutex);

	वापस 0;
पूर्ण

अटल पूर्णांक ov5670_get_skip_frames(काष्ठा v4l2_subdev *sd, u32 *frames)
अणु
	*frames = OV5670_NUM_OF_SKIP_FRAMES;

	वापस 0;
पूर्ण

/* Prepare streaming by writing शेष values and customized values */
अटल पूर्णांक ov5670_start_streaming(काष्ठा ov5670 *ov5670)
अणु
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	स्थिर काष्ठा ov5670_reg_list *reg_list;
	पूर्णांक link_freq_index;
	पूर्णांक ret;

	/* Get out of from software reset */
	ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_SOFTWARE_RST,
			       OV5670_REG_VALUE_08BIT, OV5670_SOFTWARE_RST);
	अगर (ret) अणु
		dev_err(&client->dev, "%s failed to set powerup registers\n",
			__func__);
		वापस ret;
	पूर्ण

	/* Setup PLL */
	link_freq_index = ov5670->cur_mode->link_freq_index;
	reg_list = &link_freq_configs[link_freq_index].reg_list;
	ret = ov5670_ग_लिखो_reg_list(ov5670, reg_list);
	अगर (ret) अणु
		dev_err(&client->dev, "%s failed to set plls\n", __func__);
		वापस ret;
	पूर्ण

	/* Apply शेष values of current mode */
	reg_list = &ov5670->cur_mode->reg_list;
	ret = ov5670_ग_लिखो_reg_list(ov5670, reg_list);
	अगर (ret) अणु
		dev_err(&client->dev, "%s failed to set mode\n", __func__);
		वापस ret;
	पूर्ण

	ret = __v4l2_ctrl_handler_setup(ov5670->sd.ctrl_handler);
	अगर (ret)
		वापस ret;

	/* Write stream on list */
	ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_MODE_SELECT,
			       OV5670_REG_VALUE_08BIT, OV5670_MODE_STREAMING);
	अगर (ret) अणु
		dev_err(&client->dev, "%s failed to set stream\n", __func__);
		वापस ret;
	पूर्ण

	वापस 0;
पूर्ण

अटल पूर्णांक ov5670_stop_streaming(काष्ठा ov5670 *ov5670)
अणु
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	पूर्णांक ret;

	ret = ov5670_ग_लिखो_reg(ov5670, OV5670_REG_MODE_SELECT,
			       OV5670_REG_VALUE_08BIT, OV5670_MODE_STANDBY);
	अगर (ret)
		dev_err(&client->dev, "%s failed to set stream\n", __func__);

	/* Return success even अगर it was an error, as there is nothing the
	 * caller can करो about it.
	 */
	वापस 0;
पूर्ण

अटल पूर्णांक ov5670_set_stream(काष्ठा v4l2_subdev *sd, पूर्णांक enable)
अणु
	काष्ठा ov5670 *ov5670 = to_ov5670(sd);
	काष्ठा i2c_client *client = v4l2_get_subdevdata(sd);
	पूर्णांक ret = 0;

	mutex_lock(&ov5670->mutex);
	अगर (ov5670->streaming == enable)
		जाओ unlock_and_वापस;

	अगर (enable) अणु
		ret = pm_runसमय_get_sync(&client->dev);
		अगर (ret < 0) अणु
			pm_runसमय_put_noidle(&client->dev);
			जाओ unlock_and_वापस;
		पूर्ण

		ret = ov5670_start_streaming(ov5670);
		अगर (ret)
			जाओ error;
	पूर्ण अन्यथा अणु
		ret = ov5670_stop_streaming(ov5670);
		pm_runसमय_put(&client->dev);
	पूर्ण
	ov5670->streaming = enable;
	जाओ unlock_and_वापस;

error:
	pm_runसमय_put(&client->dev);

unlock_and_वापस:
	mutex_unlock(&ov5670->mutex);

	वापस ret;
पूर्ण

अटल पूर्णांक __maybe_unused ov5670_suspend(काष्ठा device *dev)
अणु
	काष्ठा v4l2_subdev *sd = dev_get_drvdata(dev);
	काष्ठा ov5670 *ov5670 = to_ov5670(sd);

	अगर (ov5670->streaming)
		ov5670_stop_streaming(ov5670);

	वापस 0;
पूर्ण

अटल पूर्णांक __maybe_unused ov5670_resume(काष्ठा device *dev)
अणु
	काष्ठा v4l2_subdev *sd = dev_get_drvdata(dev);
	काष्ठा ov5670 *ov5670 = to_ov5670(sd);
	पूर्णांक ret;

	अगर (ov5670->streaming) अणु
		ret = ov5670_start_streaming(ov5670);
		अगर (ret) अणु
			ov5670_stop_streaming(ov5670);
			वापस ret;
		पूर्ण
	पूर्ण

	वापस 0;
पूर्ण

/* Verअगरy chip ID */
अटल पूर्णांक ov5670_identअगरy_module(काष्ठा ov5670 *ov5670)
अणु
	काष्ठा i2c_client *client = v4l2_get_subdevdata(&ov5670->sd);
	पूर्णांक ret;
	u32 val;

	ret = ov5670_पढ़ो_reg(ov5670, OV5670_REG_CHIP_ID,
			      OV5670_REG_VALUE_24BIT, &val);
	अगर (ret)
		वापस ret;

	अगर (val != OV5670_CHIP_ID) अणु
		dev_err(&client->dev, "chip id mismatch: %x!=%x\n",
			OV5670_CHIP_ID, val);
		वापस -ENXIO;
	पूर्ण

	वापस 0;
पूर्ण

अटल स्थिर काष्ठा v4l2_subdev_video_ops ov5670_video_ops = अणु
	.s_stream = ov5670_set_stream,
पूर्ण;

अटल स्थिर काष्ठा v4l2_subdev_pad_ops ov5670_pad_ops = अणु
	.क्रमागत_mbus_code = ov5670_क्रमागत_mbus_code,
	.get_fmt = ov5670_get_pad_क्रमmat,
	.set_fmt = ov5670_set_pad_क्रमmat,
	.क्रमागत_frame_size = ov5670_क्रमागत_frame_size,
पूर्ण;

अटल स्थिर काष्ठा v4l2_subdev_sensor_ops ov5670_sensor_ops = अणु
	.g_skip_frames = ov5670_get_skip_frames,
पूर्ण;

अटल स्थिर काष्ठा v4l2_subdev_ops ov5670_subdev_ops = अणु
	.video = &ov5670_video_ops,
	.pad = &ov5670_pad_ops,
	.sensor = &ov5670_sensor_ops,
पूर्ण;

अटल स्थिर काष्ठा media_entity_operations ov5670_subdev_entity_ops = अणु
	.link_validate = v4l2_subdev_link_validate,
पूर्ण;

अटल स्थिर काष्ठा v4l2_subdev_पूर्णांकernal_ops ov5670_पूर्णांकernal_ops = अणु
	.खोलो = ov5670_खोलो,
पूर्ण;

अटल पूर्णांक ov5670_probe(काष्ठा i2c_client *client)
अणु
	काष्ठा ov5670 *ov5670;
	स्थिर अक्षर *err_msg;
	u32 input_clk = 0;
	पूर्णांक ret;

	device_property_पढ़ो_u32(&client->dev, "clock-frequency", &input_clk);
	अगर (input_clk != 19200000)
		वापस -EINVAL;

	ov5670 = devm_kzalloc(&client->dev, माप(*ov5670), GFP_KERNEL);
	अगर (!ov5670) अणु
		ret = -ENOMEM;
		err_msg = "devm_kzalloc() error";
		जाओ error_prपूर्णांक;
	पूर्ण

	/* Initialize subdev */
	v4l2_i2c_subdev_init(&ov5670->sd, client, &ov5670_subdev_ops);

	/* Check module identity */
	ret = ov5670_identअगरy_module(ov5670);
	अगर (ret) अणु
		err_msg = "ov5670_identify_module() error";
		जाओ error_prपूर्णांक;
	पूर्ण

	mutex_init(&ov5670->mutex);

	/* Set शेष mode to max resolution */
	ov5670->cur_mode = &supported_modes[0];

	ret = ov5670_init_controls(ov5670);
	अगर (ret) अणु
		err_msg = "ov5670_init_controls() error";
		जाओ error_mutex_destroy;
	पूर्ण

	ov5670->sd.पूर्णांकernal_ops = &ov5670_पूर्णांकernal_ops;
	ov5670->sd.flags |= V4L2_SUBDEV_FL_HAS_DEVNODE;
	ov5670->sd.entity.ops = &ov5670_subdev_entity_ops;
	ov5670->sd.entity.function = MEDIA_ENT_F_CAM_SENSOR;

	/* Source pad initialization */
	ov5670->pad.flags = MEDIA_PAD_FL_SOURCE;
	ret = media_entity_pads_init(&ov5670->sd.entity, 1, &ov5670->pad);
	अगर (ret) अणु
		err_msg = "media_entity_pads_init() error";
		जाओ error_handler_मुक्त;
	पूर्ण

	/* Async रेजिस्टर क्रम subdev */
	ret = v4l2_async_रेजिस्टर_subdev_sensor(&ov5670->sd);
	अगर (ret < 0) अणु
		err_msg = "v4l2_async_register_subdev() error";
		जाओ error_entity_cleanup;
	पूर्ण

	ov5670->streaming = false;

	/*
	 * Device is alपढ़ोy turned on by i2c-core with ACPI करोमुख्य PM.
	 * Enable runसमय PM and turn off the device.
	 */
	pm_runसमय_set_active(&client->dev);
	pm_runसमय_enable(&client->dev);
	pm_runसमय_idle(&client->dev);

	वापस 0;

error_entity_cleanup:
	media_entity_cleanup(&ov5670->sd.entity);

error_handler_मुक्त:
	v4l2_ctrl_handler_मुक्त(ov5670->sd.ctrl_handler);

error_mutex_destroy:
	mutex_destroy(&ov5670->mutex);

error_prपूर्णांक:
	dev_err(&client->dev, "%s: %s %d\n", __func__, err_msg, ret);

	वापस ret;
पूर्ण

अटल पूर्णांक ov5670_हटाओ(काष्ठा i2c_client *client)
अणु
	काष्ठा v4l2_subdev *sd = i2c_get_clientdata(client);
	काष्ठा ov5670 *ov5670 = to_ov5670(sd);

	v4l2_async_unरेजिस्टर_subdev(sd);
	media_entity_cleanup(&sd->entity);
	v4l2_ctrl_handler_मुक्त(sd->ctrl_handler);
	mutex_destroy(&ov5670->mutex);

	pm_runसमय_disable(&client->dev);

	वापस 0;
पूर्ण

अटल स्थिर काष्ठा dev_pm_ops ov5670_pm_ops = अणु
	SET_SYSTEM_SLEEP_PM_OPS(ov5670_suspend, ov5670_resume)
पूर्ण;

#अगर_घोषित CONFIG_ACPI
अटल स्थिर काष्ठा acpi_device_id ov5670_acpi_ids[] = अणु
	अणु"INT3479"पूर्ण,
	अणु /* sentinel */ पूर्ण
पूर्ण;

MODULE_DEVICE_TABLE(acpi, ov5670_acpi_ids);
#पूर्ण_अगर

अटल काष्ठा i2c_driver ov5670_i2c_driver = अणु
	.driver = अणु
		.name = "ov5670",
		.pm = &ov5670_pm_ops,
		.acpi_match_table = ACPI_PTR(ov5670_acpi_ids),
	पूर्ण,
	.probe_new = ov5670_probe,
	.हटाओ = ov5670_हटाओ,
पूर्ण;

module_i2c_driver(ov5670_i2c_driver);

MODULE_AUTHOR("Rapolu, Chiranjeevi <chiranjeevi.rapolu@intel.com>");
MODULE_AUTHOR("Yang, Hyungwoo <hyungwoo.yang@intel.com>");
MODULE_DESCRIPTION("Omnivision ov5670 sensor driver");
MODULE_LICENSE("GPL v2");
