<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-or-later */
/*
 * SiS 300/305/540/630(S)/730(S),
 * SiS 315[E|PRO]/550/[M]65x/[M]66x[F|M|G]X/[M]74x[GX]/330/[M]76x[GX],
 * XGI V3XT/V5/V8, Z7
 * frame buffer driver क्रम Linux kernels >=2.4.14 and >=2.6.3
 *
 * Copyright (C) 2001-2005 Thomas Winischhofer, Vienna, Austria.
 */

#अगर_अघोषित _SISFB_MAIN
#घोषणा _SISFB_MAIN

#समावेश "vstruct.h"
#समावेश "sis.h"

/* Fbcon stuff */
अटल काष्ठा fb_var_screeninfo my_शेष_var = अणु
	.xres            = 0,
	.yres            = 0,
	.xres_भव    = 0,
	.yres_भव    = 0,
	.xoffset         = 0,
	.yoffset         = 0,
	.bits_per_pixel  = 0,
	.grayscale       = 0,
	.red             = अणु0, 8, 0पूर्ण,
	.green           = अणु0, 8, 0पूर्ण,
	.blue            = अणु0, 8, 0पूर्ण,
	.transp          = अणु0, 0, 0पूर्ण,
	.nonstd          = 0,
	.activate        = FB_ACTIVATE_NOW,
	.height          = -1,
	.width           = -1,
	.accel_flags     = 0,
	.pixघड़ी        = 0,
	.left_margin     = 0,
	.right_margin    = 0,
	.upper_margin    = 0,
	.lower_margin    = 0,
	.hsync_len       = 0,
	.vsync_len       = 0,
	.sync            = 0,
	.vmode           = FB_VMODE_NONINTERLACED,
पूर्ण;

#घोषणा MODE_INDEX_NONE           0  /* index क्रम mode=none */

/* Boot-समय parameters */
अटल पूर्णांक sisfb_off = 0;
अटल पूर्णांक sisfb_parm_mem = 0;
अटल पूर्णांक sisfb_accel = -1;
अटल पूर्णांक sisfb_ypan = -1;
अटल पूर्णांक sisfb_max = -1;
अटल पूर्णांक sisfb_userom = 1;
अटल पूर्णांक sisfb_useoem = -1;
अटल पूर्णांक sisfb_mode_idx = -1;               /* Use a शेष mode अगर we are inside the kernel */
अटल पूर्णांक sisfb_parm_rate = -1;
अटल पूर्णांक sisfb_crt1off = 0;
अटल पूर्णांक sisfb_क्रमcecrt1 = -1;
अटल पूर्णांक sisfb_crt2type  = -1;	/* CRT2 type (क्रम overriding स्वतःdetection) */
अटल पूर्णांक sisfb_crt2flags = 0;
अटल पूर्णांक sisfb_pdc = 0xff;
अटल पूर्णांक sisfb_pdca = 0xff;
अटल पूर्णांक sisfb_scalelcd = -1;
अटल पूर्णांक sisfb_specialtiming = CUT_NONE;
अटल पूर्णांक sisfb_lvdshl = -1;
अटल पूर्णांक sisfb_dstn = 0;
अटल पूर्णांक sisfb_fstn = 0;
अटल पूर्णांक sisfb_tvplug = -1;		/* Tv plug type (क्रम overriding स्वतःdetection) */
अटल पूर्णांक sisfb_tvstd  = -1;
अटल पूर्णांक sisfb_tvxposoffset = 0;
अटल पूर्णांक sisfb_tvyposoffset = 0;
अटल पूर्णांक sisfb_nocrt2rate = 0;
#अगर !defined(__i386__) && !defined(__x86_64__)
अटल पूर्णांक sisfb_resetcard = 0;
अटल पूर्णांक sisfb_videoram = 0;
#पूर्ण_अगर

/* List of supported chips */
अटल काष्ठा sisfb_chip_info अणु
	पूर्णांक		chip;
	पूर्णांक		vgaengine;
	पूर्णांक		mni;
	पूर्णांक		hwcursor_size;
	पूर्णांक		CRT2_ग_लिखो_enable;
	स्थिर अक्षर	*chip_name;
पूर्ण sisfb_chip_info[] = अणु
	अणु SIS_300,    SIS_300_VGA, 0, HW_CURSOR_AREA_SIZE_300 * 2, SIS_CRT2_WENABLE_300, "SiS 300/305" पूर्ण,
	अणु SIS_540,    SIS_300_VGA, 0, HW_CURSOR_AREA_SIZE_300 * 2, SIS_CRT2_WENABLE_300, "SiS 540" पूर्ण,
	अणु SIS_630,    SIS_300_VGA, 0, HW_CURSOR_AREA_SIZE_300 * 2, SIS_CRT2_WENABLE_300, "SiS 630" पूर्ण,
	अणु SIS_315H,   SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "SiS 315H" पूर्ण,
	अणु SIS_315,    SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "SiS 315" पूर्ण,
	अणु SIS_315PRO, SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "SiS 315PRO" पूर्ण,
	अणु SIS_550,    SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "SiS 55x" पूर्ण,
	अणु SIS_650,    SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "SiS 650" पूर्ण,
	अणु SIS_330,    SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "SiS 330" पूर्ण,
	अणु SIS_660,    SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "SiS 660" पूर्ण,
	अणु XGI_20,     SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "XGI Z7" पूर्ण,
	अणु XGI_40,     SIS_315_VGA, 1, HW_CURSOR_AREA_SIZE_315 * 4, SIS_CRT2_WENABLE_315, "XGI V3XT/V5/V8" पूर्ण,
पूर्ण;

अटल काष्ठा pci_device_id sisfb_pci_table[] = अणु
#अगर_घोषित CONFIG_FB_SIS_300
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_300,     PCI_ANY_ID, PCI_ANY_ID, 0, 0, 0पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_540_VGA, PCI_ANY_ID, PCI_ANY_ID, 0, 0, 1पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_630_VGA, PCI_ANY_ID, PCI_ANY_ID, 0, 0, 2पूर्ण,
#पूर्ण_अगर
#अगर_घोषित CONFIG_FB_SIS_315
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_315H,    PCI_ANY_ID, PCI_ANY_ID, 0, 0, 3पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_315,     PCI_ANY_ID, PCI_ANY_ID, 0, 0, 4पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_315PRO,  PCI_ANY_ID, PCI_ANY_ID, 0, 0, 5पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_550_VGA, PCI_ANY_ID, PCI_ANY_ID, 0, 0, 6पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_650_VGA, PCI_ANY_ID, PCI_ANY_ID, 0, 0, 7पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_330,     PCI_ANY_ID, PCI_ANY_ID, 0, 0, 8पूर्ण,
	अणु PCI_VENDOR_ID_SI, PCI_DEVICE_ID_SI_660_VGA, PCI_ANY_ID, PCI_ANY_ID, 0, 0, 9पूर्ण,
	अणु PCI_VENDOR_ID_XGI,PCI_DEVICE_ID_XGI_20,     PCI_ANY_ID, PCI_ANY_ID, 0, 0,10पूर्ण,
	अणु PCI_VENDOR_ID_XGI,PCI_DEVICE_ID_XGI_40,     PCI_ANY_ID, PCI_ANY_ID, 0, 0,11पूर्ण,
#पूर्ण_अगर
	अणु 0 पूर्ण
पूर्ण;

MODULE_DEVICE_TABLE(pci, sisfb_pci_table);

अटल काष्ठा sis_video_info *card_list = शून्य;

/* The memory heap is now handled card-wise, by using
   sis_दो_स्मृति_new/sis_मुक्त_new. However, the DRM करोes
   not करो this yet. Until it करोes, we keep a "global"
   heap which is actually the first card's one.
 */
अटल काष्ठा SIS_HEAP	*sisfb_heap;

#घोषणा MD_SIS300 1
#घोषणा MD_SIS315 2

/* Mode table */
अटल स्थिर काष्ठा _sisbios_mode अणु
	अक्षर name[15];
	u8  mode_no[2];
	u16 vesa_mode_no_1;  /* "SiS defined" VESA mode number */
	u16 vesa_mode_no_2;  /* Real VESA mode numbers */
	u16 xres;
	u16 yres;
	u16 bpp;
	u16 rate_idx;
	u16 cols;
	u16 rows;
	u8  chipset;
पूर्ण sisbios_mode[] = अणु
/*0*/	अणु"none",         अणु0xff,0xffपूर्ण, 0x0000, 0x0000,    0,    0,  0, 0,   0,  0, MD_SIS300|MD_SIS315पूर्ण,
	अणु"320x200x8",    अणु0x59,0x59पूर्ण, 0x0138, 0x0000,  320,  200,  8, 1,  40, 12, MD_SIS300|MD_SIS315पूर्ण,
	अणु"320x200x16",   अणु0x41,0x41पूर्ण, 0x010e, 0x0000,  320,  200, 16, 1,  40, 12, MD_SIS300|MD_SIS315पूर्ण,
	अणु"320x200x24",   अणु0x4f,0x4fपूर्ण, 0x0000, 0x0000,  320,  200, 32, 1,  40, 12, MD_SIS300|MD_SIS315पूर्ण,  /* That's क्रम people who mix up color- and fb depth */
	अणु"320x200x32",   अणु0x4f,0x4fपूर्ण, 0x0000, 0x0000,  320,  200, 32, 1,  40, 12, MD_SIS300|MD_SIS315पूर्ण,
	अणु"320x240x8",    अणु0x50,0x50पूर्ण, 0x0132, 0x0000,  320,  240,  8, 1,  40, 15, MD_SIS300|MD_SIS315पूर्ण,
	अणु"320x240x16",   अणु0x56,0x56पूर्ण, 0x0135, 0x0000,  320,  240, 16, 1,  40, 15, MD_SIS300|MD_SIS315पूर्ण,
	अणु"320x240x24",   अणु0x53,0x53पूर्ण, 0x0000, 0x0000,  320,  240, 32, 1,  40, 15, MD_SIS300|MD_SIS315पूर्ण,
	अणु"320x240x32",   अणु0x53,0x53पूर्ण, 0x0000, 0x0000,  320,  240, 32, 1,  40, 15, MD_SIS300|MD_SIS315पूर्ण,
#घोषणा MODE_FSTN_8	9
#घोषणा MODE_FSTN_16	10
	अणु"320x240x8",    अणु0x5a,0x5aपूर्ण, 0x0132, 0x0000,  320,  240,  8, 1,  40, 15,           MD_SIS315पूर्ण,  /* FSTN */
/*10*/	अणु"320x240x16",   अणु0x5b,0x5bपूर्ण, 0x0135, 0x0000,  320,  240, 16, 1,  40, 15,           MD_SIS315पूर्ण,  /* FSTN */
	अणु"400x300x8",    अणु0x51,0x51पूर्ण, 0x0133, 0x0000,  400,  300,  8, 1,  50, 18, MD_SIS300|MD_SIS315पूर्ण,
	अणु"400x300x16",   अणु0x57,0x57पूर्ण, 0x0136, 0x0000,  400,  300, 16, 1,  50, 18, MD_SIS300|MD_SIS315पूर्ण,
	अणु"400x300x24",   अणु0x54,0x54पूर्ण, 0x0000, 0x0000,  400,  300, 32, 1,  50, 18, MD_SIS300|MD_SIS315पूर्ण,
	अणु"400x300x32",   अणु0x54,0x54पूर्ण, 0x0000, 0x0000,  400,  300, 32, 1,  50, 18, MD_SIS300|MD_SIS315पूर्ण,
	अणु"512x384x8",    अणु0x52,0x52पूर्ण, 0x0000, 0x0000,  512,  384,  8, 1,  64, 24, MD_SIS300|MD_SIS315पूर्ण,
	अणु"512x384x16",   अणु0x58,0x58पूर्ण, 0x0000, 0x0000,  512,  384, 16, 1,  64, 24, MD_SIS300|MD_SIS315पूर्ण,
	अणु"512x384x24",   अणु0x5c,0x5cपूर्ण, 0x0000, 0x0000,  512,  384, 32, 1,  64, 24, MD_SIS300|MD_SIS315पूर्ण,
	अणु"512x384x32",   अणु0x5c,0x5cपूर्ण, 0x0000, 0x0000,  512,  384, 32, 1,  64, 24, MD_SIS300|MD_SIS315पूर्ण,
	अणु"640x400x8",    अणु0x2f,0x2fपूर्ण, 0x0000, 0x0000,  640,  400,  8, 1,  80, 25, MD_SIS300|MD_SIS315पूर्ण,
/*20*/	अणु"640x400x16",   अणु0x5d,0x5dपूर्ण, 0x0000, 0x0000,  640,  400, 16, 1,  80, 25, MD_SIS300|MD_SIS315पूर्ण,
	अणु"640x400x24",   अणु0x5e,0x5eपूर्ण, 0x0000, 0x0000,  640,  400, 32, 1,  80, 25, MD_SIS300|MD_SIS315पूर्ण,
	अणु"640x400x32",   अणु0x5e,0x5eपूर्ण, 0x0000, 0x0000,  640,  400, 32, 1,  80, 25, MD_SIS300|MD_SIS315पूर्ण,
	अणु"640x480x8",    अणु0x2e,0x2eपूर्ण, 0x0101, 0x0101,  640,  480,  8, 1,  80, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"640x480x16",   अणु0x44,0x44पूर्ण, 0x0111, 0x0111,  640,  480, 16, 1,  80, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"640x480x24",   अणु0x62,0x62पूर्ण, 0x013a, 0x0112,  640,  480, 32, 1,  80, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"640x480x32",   अणु0x62,0x62पूर्ण, 0x013a, 0x0112,  640,  480, 32, 1,  80, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"720x480x8",    अणु0x31,0x31पूर्ण, 0x0000, 0x0000,  720,  480,  8, 1,  90, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"720x480x16",   अणु0x33,0x33पूर्ण, 0x0000, 0x0000,  720,  480, 16, 1,  90, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"720x480x24",   अणु0x35,0x35पूर्ण, 0x0000, 0x0000,  720,  480, 32, 1,  90, 30, MD_SIS300|MD_SIS315पूर्ण,
/*30*/	अणु"720x480x32",   अणु0x35,0x35पूर्ण, 0x0000, 0x0000,  720,  480, 32, 1,  90, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"720x576x8",    अणु0x32,0x32पूर्ण, 0x0000, 0x0000,  720,  576,  8, 1,  90, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"720x576x16",   अणु0x34,0x34पूर्ण, 0x0000, 0x0000,  720,  576, 16, 1,  90, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"720x576x24",   अणु0x36,0x36पूर्ण, 0x0000, 0x0000,  720,  576, 32, 1,  90, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"720x576x32",   अणु0x36,0x36पूर्ण, 0x0000, 0x0000,  720,  576, 32, 1,  90, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"768x576x8",    अणु0x5f,0x5fपूर्ण, 0x0000, 0x0000,  768,  576,  8, 1,  96, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"768x576x16",   अणु0x60,0x60पूर्ण, 0x0000, 0x0000,  768,  576, 16, 1,  96, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"768x576x24",   अणु0x61,0x61पूर्ण, 0x0000, 0x0000,  768,  576, 32, 1,  96, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"768x576x32",   अणु0x61,0x61पूर्ण, 0x0000, 0x0000,  768,  576, 32, 1,  96, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"800x480x8",    अणु0x70,0x70पूर्ण, 0x0000, 0x0000,  800,  480,  8, 1, 100, 30, MD_SIS300|MD_SIS315पूर्ण,
/*40*/	अणु"800x480x16",   अणु0x7a,0x7aपूर्ण, 0x0000, 0x0000,  800,  480, 16, 1, 100, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"800x480x24",   अणु0x76,0x76पूर्ण, 0x0000, 0x0000,  800,  480, 32, 1, 100, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"800x480x32",   अणु0x76,0x76पूर्ण, 0x0000, 0x0000,  800,  480, 32, 1, 100, 30, MD_SIS300|MD_SIS315पूर्ण,
#घोषणा DEFAULT_MODE		43 /* index क्रम 800x600x8 */
#घोषणा DEFAULT_LCDMODE		43 /* index क्रम 800x600x8 */
#घोषणा DEFAULT_TVMODE		43 /* index क्रम 800x600x8 */
	अणु"800x600x8",    अणु0x30,0x30पूर्ण, 0x0103, 0x0103,  800,  600,  8, 2, 100, 37, MD_SIS300|MD_SIS315पूर्ण,
	अणु"800x600x16",   अणु0x47,0x47पूर्ण, 0x0114, 0x0114,  800,  600, 16, 2, 100, 37, MD_SIS300|MD_SIS315पूर्ण,
	अणु"800x600x24",   अणु0x63,0x63पूर्ण, 0x013b, 0x0115,  800,  600, 32, 2, 100, 37, MD_SIS300|MD_SIS315पूर्ण,
	अणु"800x600x32",   अणु0x63,0x63पूर्ण, 0x013b, 0x0115,  800,  600, 32, 2, 100, 37, MD_SIS300|MD_SIS315पूर्ण,
	अणु"848x480x8",    अणु0x39,0x39पूर्ण, 0x0000, 0x0000,  848,  480,  8, 2, 106, 30, MD_SIS300|MD_SIS315पूर्ण,
#घोषणा DEFAULT_MODE_848	48
	अणु"848x480x16",   अणु0x3b,0x3bपूर्ण, 0x0000, 0x0000,  848,  480, 16, 2, 106, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"848x480x24",   अणु0x3e,0x3eपूर्ण, 0x0000, 0x0000,  848,  480, 32, 2, 106, 30, MD_SIS300|MD_SIS315पूर्ण,
/*50*/	अणु"848x480x32",   अणु0x3e,0x3eपूर्ण, 0x0000, 0x0000,  848,  480, 32, 2, 106, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"856x480x8",    अणु0x3f,0x3fपूर्ण, 0x0000, 0x0000,  856,  480,  8, 2, 107, 30, MD_SIS300|MD_SIS315पूर्ण,
#घोषणा DEFAULT_MODE_856	52
	अणु"856x480x16",   अणु0x42,0x42पूर्ण, 0x0000, 0x0000,  856,  480, 16, 2, 107, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"856x480x24",   अणु0x45,0x45पूर्ण, 0x0000, 0x0000,  856,  480, 32, 2, 107, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"856x480x32",   अणु0x45,0x45पूर्ण, 0x0000, 0x0000,  856,  480, 32, 2, 107, 30, MD_SIS300|MD_SIS315पूर्ण,
	अणु"960x540x8",    अणु0x1d,0x1dपूर्ण, 0x0000, 0x0000,  960,  540,  8, 1, 120, 33,           MD_SIS315पूर्ण,
	अणु"960x540x16",   अणु0x1e,0x1eपूर्ण, 0x0000, 0x0000,  960,  540, 16, 1, 120, 33,           MD_SIS315पूर्ण,
	अणु"960x540x24",   अणु0x1f,0x1fपूर्ण, 0x0000, 0x0000,  960,  540, 32, 1, 120, 33,           MD_SIS315पूर्ण,
	अणु"960x540x32",   अणु0x1f,0x1fपूर्ण, 0x0000, 0x0000,  960,  540, 32, 1, 120, 33,           MD_SIS315पूर्ण,
	अणु"960x600x8",    अणु0x20,0x20पूर्ण, 0x0000, 0x0000,  960,  600,  8, 1, 120, 37,           MD_SIS315पूर्ण,
/*60*/	अणु"960x600x16",   अणु0x21,0x21पूर्ण, 0x0000, 0x0000,  960,  600, 16, 1, 120, 37,           MD_SIS315पूर्ण,
	अणु"960x600x24",   अणु0x22,0x22पूर्ण, 0x0000, 0x0000,  960,  600, 32, 1, 120, 37,           MD_SIS315पूर्ण,
	अणु"960x600x32",   अणु0x22,0x22पूर्ण, 0x0000, 0x0000,  960,  600, 32, 1, 120, 37,           MD_SIS315पूर्ण,
	अणु"1024x576x8",   अणु0x71,0x71पूर्ण, 0x0000, 0x0000, 1024,  576,  8, 1, 128, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1024x576x16",  अणु0x74,0x74पूर्ण, 0x0000, 0x0000, 1024,  576, 16, 1, 128, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1024x576x24",  अणु0x77,0x77पूर्ण, 0x0000, 0x0000, 1024,  576, 32, 1, 128, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1024x576x32",  अणु0x77,0x77पूर्ण, 0x0000, 0x0000, 1024,  576, 32, 1, 128, 36, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1024x600x8",   अणु0x20,0x20पूर्ण, 0x0000, 0x0000, 1024,  600,  8, 1, 128, 37, MD_SIS300          पूर्ण,
	अणु"1024x600x16",  अणु0x21,0x21पूर्ण, 0x0000, 0x0000, 1024,  600, 16, 1, 128, 37, MD_SIS300          पूर्ण,
	अणु"1024x600x24",  अणु0x22,0x22पूर्ण, 0x0000, 0x0000, 1024,  600, 32, 1, 128, 37, MD_SIS300          पूर्ण,
/*70*/	अणु"1024x600x32",  अणु0x22,0x22पूर्ण, 0x0000, 0x0000, 1024,  600, 32, 1, 128, 37, MD_SIS300          पूर्ण,
	अणु"1024x768x8",   अणु0x38,0x38पूर्ण, 0x0105, 0x0105, 1024,  768,  8, 2, 128, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1024x768x16",  अणु0x4a,0x4aपूर्ण, 0x0117, 0x0117, 1024,  768, 16, 2, 128, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1024x768x24",  अणु0x64,0x64पूर्ण, 0x013c, 0x0118, 1024,  768, 32, 2, 128, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1024x768x32",  अणु0x64,0x64पूर्ण, 0x013c, 0x0118, 1024,  768, 32, 2, 128, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1152x768x8",   अणु0x23,0x23पूर्ण, 0x0000, 0x0000, 1152,  768,  8, 1, 144, 48, MD_SIS300          पूर्ण,
	अणु"1152x768x16",  अणु0x24,0x24पूर्ण, 0x0000, 0x0000, 1152,  768, 16, 1, 144, 48, MD_SIS300          पूर्ण,
	अणु"1152x768x24",  अणु0x25,0x25पूर्ण, 0x0000, 0x0000, 1152,  768, 32, 1, 144, 48, MD_SIS300          पूर्ण,
	अणु"1152x768x32",  अणु0x25,0x25पूर्ण, 0x0000, 0x0000, 1152,  768, 32, 1, 144, 48, MD_SIS300          पूर्ण,
	अणु"1152x864x8",   अणु0x29,0x29पूर्ण, 0x0000, 0x0000, 1152,  864,  8, 1, 144, 54, MD_SIS300|MD_SIS315पूर्ण,
/*80*/	अणु"1152x864x16",  अणु0x2a,0x2aपूर्ण, 0x0000, 0x0000, 1152,  864, 16, 1, 144, 54, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1152x864x24",  अणु0x2b,0x2bपूर्ण, 0x0000, 0x0000, 1152,  864, 32, 1, 144, 54, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1152x864x32",  अणु0x2b,0x2bपूर्ण, 0x0000, 0x0000, 1152,  864, 32, 1, 144, 54, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x720x8",   अणु0x79,0x79पूर्ण, 0x0000, 0x0000, 1280,  720,  8, 1, 160, 45, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x720x16",  अणु0x75,0x75पूर्ण, 0x0000, 0x0000, 1280,  720, 16, 1, 160, 45, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x720x24",  अणु0x78,0x78पूर्ण, 0x0000, 0x0000, 1280,  720, 32, 1, 160, 45, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x720x32",  अणु0x78,0x78पूर्ण, 0x0000, 0x0000, 1280,  720, 32, 1, 160, 45, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x768x8",   अणु0x55,0x23पूर्ण, 0x0000, 0x0000, 1280,  768,  8, 1, 160, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x768x16",  अणु0x5a,0x24पूर्ण, 0x0000, 0x0000, 1280,  768, 16, 1, 160, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x768x24",  अणु0x5b,0x25पूर्ण, 0x0000, 0x0000, 1280,  768, 32, 1, 160, 48, MD_SIS300|MD_SIS315पूर्ण,
/*90*/	अणु"1280x768x32",  अणु0x5b,0x25पूर्ण, 0x0000, 0x0000, 1280,  768, 32, 1, 160, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x800x8",   अणु0x14,0x14पूर्ण, 0x0000, 0x0000, 1280,  800,  8, 1, 160, 50,           MD_SIS315पूर्ण,
	अणु"1280x800x16",  अणु0x15,0x15पूर्ण, 0x0000, 0x0000, 1280,  800, 16, 1, 160, 50,           MD_SIS315पूर्ण,
	अणु"1280x800x24",  अणु0x16,0x16पूर्ण, 0x0000, 0x0000, 1280,  800, 32, 1, 160, 50,           MD_SIS315पूर्ण,
	अणु"1280x800x32",  अणु0x16,0x16पूर्ण, 0x0000, 0x0000, 1280,  800, 32, 1, 160, 50,           MD_SIS315पूर्ण,
	अणु"1280x854x8",   अणु0x14,0x14पूर्ण, 0x0000, 0x0000, 1280,  854,  8, 1, 160, 53,           MD_SIS315पूर्ण,
	अणु"1280x854x16",  अणु0x15,0x15पूर्ण, 0x0000, 0x0000, 1280,  854, 16, 1, 160, 53,           MD_SIS315पूर्ण,
	अणु"1280x854x24",  अणु0x16,0x16पूर्ण, 0x0000, 0x0000, 1280,  854, 32, 1, 160, 53,           MD_SIS315पूर्ण,
	अणु"1280x854x32",  अणु0x16,0x16पूर्ण, 0x0000, 0x0000, 1280,  854, 32, 1, 160, 53,           MD_SIS315पूर्ण,
	अणु"1280x960x8",   अणु0x7c,0x7cपूर्ण, 0x0000, 0x0000, 1280,  960,  8, 1, 160, 60, MD_SIS300|MD_SIS315पूर्ण,
/*100*/	अणु"1280x960x16",  अणु0x7d,0x7dपूर्ण, 0x0000, 0x0000, 1280,  960, 16, 1, 160, 60, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x960x24",  अणु0x7e,0x7eपूर्ण, 0x0000, 0x0000, 1280,  960, 32, 1, 160, 60, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x960x32",  अणु0x7e,0x7eपूर्ण, 0x0000, 0x0000, 1280,  960, 32, 1, 160, 60, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x1024x8",  अणु0x3a,0x3aपूर्ण, 0x0107, 0x0107, 1280, 1024,  8, 2, 160, 64, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x1024x16", अणु0x4d,0x4dपूर्ण, 0x011a, 0x011a, 1280, 1024, 16, 2, 160, 64, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x1024x24", अणु0x65,0x65पूर्ण, 0x013d, 0x011b, 1280, 1024, 32, 2, 160, 64, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1280x1024x32", अणु0x65,0x65पूर्ण, 0x013d, 0x011b, 1280, 1024, 32, 2, 160, 64, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1360x768x8",   अणु0x48,0x48पूर्ण, 0x0000, 0x0000, 1360,  768,  8, 1, 170, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1360x768x16",  अणु0x4b,0x4bपूर्ण, 0x0000, 0x0000, 1360,  768, 16, 1, 170, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1360x768x24",  अणु0x4e,0x4eपूर्ण, 0x0000, 0x0000, 1360,  768, 32, 1, 170, 48, MD_SIS300|MD_SIS315पूर्ण,
/*110*/	अणु"1360x768x32",  अणु0x4e,0x4eपूर्ण, 0x0000, 0x0000, 1360,  768, 32, 1, 170, 48, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1360x1024x8",  अणु0x67,0x67पूर्ण, 0x0000, 0x0000, 1360, 1024,  8, 1, 170, 64, MD_SIS300          पूर्ण,
#घोषणा DEFAULT_MODE_1360	112
	अणु"1360x1024x16", अणु0x6f,0x6fपूर्ण, 0x0000, 0x0000, 1360, 1024, 16, 1, 170, 64, MD_SIS300          पूर्ण,
	अणु"1360x1024x24", अणु0x72,0x72पूर्ण, 0x0000, 0x0000, 1360, 1024, 32, 1, 170, 64, MD_SIS300          पूर्ण,
	अणु"1360x1024x32", अणु0x72,0x72पूर्ण, 0x0000, 0x0000, 1360, 1024, 32, 1, 170, 64, MD_SIS300          पूर्ण,
	अणु"1400x1050x8",  अणु0x26,0x26पूर्ण, 0x0000, 0x0000, 1400, 1050,  8, 1, 175, 65,           MD_SIS315पूर्ण,
	अणु"1400x1050x16", अणु0x27,0x27पूर्ण, 0x0000, 0x0000, 1400, 1050, 16, 1, 175, 65,           MD_SIS315पूर्ण,
	अणु"1400x1050x24", अणु0x28,0x28पूर्ण, 0x0000, 0x0000, 1400, 1050, 32, 1, 175, 65,           MD_SIS315पूर्ण,
	अणु"1400x1050x32", अणु0x28,0x28पूर्ण, 0x0000, 0x0000, 1400, 1050, 32, 1, 175, 65,           MD_SIS315पूर्ण,
	अणु"1600x1200x8",  अणु0x3c,0x3cपूर्ण, 0x0130, 0x011c, 1600, 1200,  8, 1, 200, 75, MD_SIS300|MD_SIS315पूर्ण,
/*120*/	अणु"1600x1200x16", अणु0x3d,0x3dपूर्ण, 0x0131, 0x011e, 1600, 1200, 16, 1, 200, 75, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1600x1200x24", अणु0x66,0x66पूर्ण, 0x013e, 0x011f, 1600, 1200, 32, 1, 200, 75, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1600x1200x32", अणु0x66,0x66पूर्ण, 0x013e, 0x011f, 1600, 1200, 32, 1, 200, 75, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1680x1050x8",  अणु0x17,0x17पूर्ण, 0x0000, 0x0000, 1680, 1050,  8, 1, 210, 65,           MD_SIS315पूर्ण,
	अणु"1680x1050x16", अणु0x18,0x18पूर्ण, 0x0000, 0x0000, 1680, 1050, 16, 1, 210, 65,           MD_SIS315पूर्ण,
	अणु"1680x1050x24", अणु0x19,0x19पूर्ण, 0x0000, 0x0000, 1680, 1050, 32, 1, 210, 65,           MD_SIS315पूर्ण,
	अणु"1680x1050x32", अणु0x19,0x19पूर्ण, 0x0000, 0x0000, 1680, 1050, 32, 1, 210, 65,           MD_SIS315पूर्ण,
	अणु"1920x1080x8",  अणु0x2c,0x2cपूर्ण, 0x0000, 0x0000, 1920, 1080,  8, 1, 240, 67,           MD_SIS315पूर्ण,
	अणु"1920x1080x16", अणु0x2d,0x2dपूर्ण, 0x0000, 0x0000, 1920, 1080, 16, 1, 240, 67,           MD_SIS315पूर्ण,
	अणु"1920x1080x24", अणु0x73,0x73पूर्ण, 0x0000, 0x0000, 1920, 1080, 32, 1, 240, 67,           MD_SIS315पूर्ण,
/*130*/	अणु"1920x1080x32", अणु0x73,0x73पूर्ण, 0x0000, 0x0000, 1920, 1080, 32, 1, 240, 67,           MD_SIS315पूर्ण,
	अणु"1920x1440x8",  अणु0x68,0x68पूर्ण, 0x013f, 0x0000, 1920, 1440,  8, 1, 240, 75, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1920x1440x16", अणु0x69,0x69पूर्ण, 0x0140, 0x0000, 1920, 1440, 16, 1, 240, 75, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1920x1440x24", अणु0x6b,0x6bपूर्ण, 0x0141, 0x0000, 1920, 1440, 32, 1, 240, 75, MD_SIS300|MD_SIS315पूर्ण,
	अणु"1920x1440x32", अणु0x6b,0x6bपूर्ण, 0x0141, 0x0000, 1920, 1440, 32, 1, 240, 75, MD_SIS300|MD_SIS315पूर्ण,
	अणु"2048x1536x8",  अणु0x6c,0x6cपूर्ण, 0x0000, 0x0000, 2048, 1536,  8, 1, 256, 96,           MD_SIS315पूर्ण,
	अणु"2048x1536x16", अणु0x6d,0x6dपूर्ण, 0x0000, 0x0000, 2048, 1536, 16, 1, 256, 96,           MD_SIS315पूर्ण,
	अणु"2048x1536x24", अणु0x6e,0x6eपूर्ण, 0x0000, 0x0000, 2048, 1536, 32, 1, 256, 96,           MD_SIS315पूर्ण,
	अणु"2048x1536x32", अणु0x6e,0x6eपूर्ण, 0x0000, 0x0000, 2048, 1536, 32, 1, 256, 96,           MD_SIS315पूर्ण,
	अणु"\0", अणु0x00,0x00पूर्ण, 0, 0, 0, 0, 0, 0, 0पूर्ण
पूर्ण;

#घोषणा SIS_LCD_NUMBER 18
अटल काष्ठा _sis_lcd_data अणु
	u32 lcdtype;
	u16 xres;
	u16 yres;
	u8  शेष_mode_idx;
पूर्ण sis_lcd_data[] = अणु
	अणु LCD_640x480,    640,  480,  23 पूर्ण,
	अणु LCD_800x600,    800,  600,  43 पूर्ण,
	अणु LCD_1024x600,  1024,  600,  67 पूर्ण,
	अणु LCD_1024x768,  1024,  768,  71 पूर्ण,
	अणु LCD_1152x768,  1152,  768,  75 पूर्ण,
	अणु LCD_1152x864,  1152,  864,  79 पूर्ण,
	अणु LCD_1280x720,  1280,  720,  83 पूर्ण,
	अणु LCD_1280x768,  1280,  768,  87 पूर्ण,
	अणु LCD_1280x800,  1280,  800,  91 पूर्ण,
	अणु LCD_1280x854,  1280,  854,  95 पूर्ण,
	अणु LCD_1280x960,  1280,  960,  99 पूर्ण,
	अणु LCD_1280x1024, 1280, 1024, 103 पूर्ण,
	अणु LCD_1400x1050, 1400, 1050, 115 पूर्ण,
	अणु LCD_1680x1050, 1680, 1050, 123 पूर्ण,
	अणु LCD_1600x1200, 1600, 1200, 119 पूर्ण,
	अणु LCD_320x240_2,  320,  240,   9 पूर्ण,
	अणु LCD_320x240_3,  320,  240,   9 पूर्ण,
	अणु LCD_320x240,    320,  240,   9 पूर्ण,
पूर्ण;

/* CR36 evaluation */
अटल अचिन्हित लघु sis300paneltype[] = अणु
	LCD_UNKNOWN,   LCD_800x600,   LCD_1024x768,  LCD_1280x1024,
	LCD_1280x960,  LCD_640x480,   LCD_1024x600,  LCD_1152x768,
	LCD_UNKNOWN,   LCD_UNKNOWN,   LCD_UNKNOWN,   LCD_UNKNOWN,
	LCD_UNKNOWN,   LCD_UNKNOWN,   LCD_UNKNOWN,   LCD_UNKNOWN
पूर्ण;

अटल अचिन्हित लघु sis310paneltype[] = अणु
	LCD_UNKNOWN,   LCD_800x600,   LCD_1024x768,  LCD_1280x1024,
	LCD_640x480,   LCD_1024x600,  LCD_1152x864,  LCD_1280x960,
	LCD_1152x768,  LCD_1400x1050, LCD_1280x768,  LCD_1600x1200,
	LCD_320x240_2, LCD_320x240_3, LCD_UNKNOWN,   LCD_UNKNOWN
पूर्ण;

अटल अचिन्हित लघु sis661paneltype[] = अणु
	LCD_UNKNOWN,   LCD_800x600,   LCD_1024x768,  LCD_1280x1024,
	LCD_640x480,   LCD_1024x600,  LCD_1152x864,  LCD_1280x960,
	LCD_1280x854,  LCD_1400x1050, LCD_1280x768,  LCD_1600x1200,
	LCD_1280x800,  LCD_1680x1050, LCD_1280x720,  LCD_UNKNOWN
पूर्ण;

#घोषणा FL_550_DSTN 0x01
#घोषणा FL_550_FSTN 0x02
#घोषणा FL_300      0x04
#घोषणा FL_315      0x08

अटल काष्ठा _sis_crt2type अणु
	अक्षर name[32];
	u32 type_no;
	u32 tvplug_no;
	u16 flags;
पूर्ण sis_crt2type[] __initdata = अणु
	अणु"NONE", 	     0, 	-1,                     FL_300|FL_315पूर्ण,
	अणु"LCD",  	     CRT2_LCD, 	-1,                     FL_300|FL_315पूर्ण,
	अणु"TV",   	     CRT2_TV, 	-1,                     FL_300|FL_315पूर्ण,
	अणु"VGA",  	     CRT2_VGA, 	-1,                     FL_300|FL_315पूर्ण,
	अणु"SVIDEO", 	     CRT2_TV, 	TV_SVIDEO,              FL_300|FL_315पूर्ण,
	अणु"COMPOSITE", 	     CRT2_TV, 	TV_AVIDEO,              FL_300|FL_315पूर्ण,
	अणु"CVBS", 	     CRT2_TV, 	TV_AVIDEO,              FL_300|FL_315पूर्ण,
	अणु"SVIDEO+COMPOSITE", CRT2_TV,   TV_AVIDEO|TV_SVIDEO,    FL_300|FL_315पूर्ण,
	अणु"COMPOSITE+SVIDEO", CRT2_TV,   TV_AVIDEO|TV_SVIDEO,    FL_300|FL_315पूर्ण,
	अणु"SVIDEO+CVBS",      CRT2_TV,   TV_AVIDEO|TV_SVIDEO,    FL_300|FL_315पूर्ण,
	अणु"CVBS+SVIDEO",      CRT2_TV,   TV_AVIDEO|TV_SVIDEO,    FL_300|FL_315पूर्ण,
	अणु"SCART", 	     CRT2_TV, 	TV_SCART,               FL_300|FL_315पूर्ण,
	अणु"HIVISION",	     CRT2_TV,   TV_HIVISION,            FL_315पूर्ण,
	अणु"YPBPR480I",	     CRT2_TV,   TV_YPBPR|TV_YPBPR525I,  FL_315पूर्ण,
	अणु"YPBPR480P",	     CRT2_TV,   TV_YPBPR|TV_YPBPR525P,  FL_315पूर्ण,
	अणु"YPBPR720P",	     CRT2_TV,   TV_YPBPR|TV_YPBPR750P,  FL_315पूर्ण,
	अणु"YPBPR1080I",	     CRT2_TV,   TV_YPBPR|TV_YPBPR1080I, FL_315पूर्ण,
	अणु"DSTN",             CRT2_LCD,  -1,                     FL_315|FL_550_DSTNपूर्ण,
	अणु"FSTN",             CRT2_LCD,  -1,                     FL_315|FL_550_FSTNपूर्ण,
	अणु"\0",  	     -1, 	-1,                     0पूर्ण
पूर्ण;

/* TV standard */
अटल काष्ठा _sis_tvtype अणु
	अक्षर name[6];
	u32 type_no;
पूर्ण sis_tvtype[] __initdata = अणु
	अणु"PAL",  	TV_PALपूर्ण,
	अणु"NTSC", 	TV_NTSCपूर्ण,
	अणु"PALM",  	TV_PAL|TV_PALMपूर्ण,
	अणु"PALN",  	TV_PAL|TV_PALNपूर्ण,
	अणु"NTSCJ",  	TV_NTSC|TV_NTSCJपूर्ण,
	अणु"\0",   	-1पूर्ण
पूर्ण;

अटल स्थिर काष्ठा _sis_vrate अणु
	u16 idx;
	u16 xres;
	u16 yres;
	u16 refresh;
	bool SiS730valid32bpp;
पूर्ण sisfb_vrate[] = अणु
	अणु1,  320,  200,  70,  trueपूर्ण,
	अणु1,  320,  240,  60,  trueपूर्ण,
	अणु1,  400,  300,  60,  trueपूर्ण,
	अणु1,  512,  384,  60,  trueपूर्ण,
	अणु1,  640,  400,  72,  trueपूर्ण,
	अणु1,  640,  480,  60,  trueपूर्ण, अणु2,  640,  480,  72,  trueपूर्ण, अणु3,  640,  480,  75,  trueपूर्ण,
	अणु4,  640,  480,  85,  trueपूर्ण, अणु5,  640,  480, 100,  trueपूर्ण, अणु6,  640,  480, 120,  trueपूर्ण,
	अणु7,  640,  480, 160,  trueपूर्ण, अणु8,  640,  480, 200,  trueपूर्ण,
	अणु1,  720,  480,  60,  trueपूर्ण,
	अणु1,  720,  576,  58,  trueपूर्ण,
	अणु1,  768,  576,  58,  trueपूर्ण,
	अणु1,  800,  480,  60,  trueपूर्ण, अणु2,  800,  480,  75,  trueपूर्ण, अणु3,  800,  480,  85,  trueपूर्ण,
	अणु1,  800,  600,  56,  trueपूर्ण, अणु2,  800,  600,  60,  trueपूर्ण, अणु3,  800,  600,  72,  trueपूर्ण,
	अणु4,  800,  600,  75,  trueपूर्ण, अणु5,  800,  600,  85,  trueपूर्ण, अणु6,  800,  600, 105,  trueपूर्ण,
	अणु7,  800,  600, 120,  trueपूर्ण, अणु8,  800,  600, 160,  trueपूर्ण,
	अणु1,  848,  480,  39,  trueपूर्ण, अणु2,  848,  480,  60,  trueपूर्ण,
	अणु1,  856,  480,  39,  trueपूर्ण, अणु2,  856,  480,  60,  trueपूर्ण,
	अणु1,  960,  540,  60,  trueपूर्ण,
	अणु1,  960,  600,  60,  trueपूर्ण,
	अणु1, 1024,  576,  60,  trueपूर्ण, अणु2, 1024,  576,  75,  trueपूर्ण, अणु3, 1024,  576,  85,  trueपूर्ण,
	अणु1, 1024,  600,  60,  trueपूर्ण,
	अणु1, 1024,  768,  43,  trueपूर्ण, अणु2, 1024,  768,  60,  trueपूर्ण, अणु3, 1024,  768,  70, falseपूर्ण,
	अणु4, 1024,  768,  75, falseपूर्ण, अणु5, 1024,  768,  85,  trueपूर्ण, अणु6, 1024,  768, 100,  trueपूर्ण,
	अणु7, 1024,  768, 120,  trueपूर्ण,
	अणु1, 1152,  768,  60,  trueपूर्ण,
	अणु1, 1152,  864,  60,  trueपूर्ण, अणु2, 1152,  864,  75,  trueपूर्ण, अणु3, 1152,  864,  84,  trueपूर्ण,
	अणु1, 1280,  720,  60,  trueपूर्ण, अणु2, 1280,  720,  75,  trueपूर्ण, अणु3, 1280,  720,  85,  trueपूर्ण,
	अणु1, 1280,  768,  60,  trueपूर्ण,
	अणु1, 1280,  800,  60,  trueपूर्ण,
	अणु1, 1280,  854,  60,  trueपूर्ण,
	अणु1, 1280,  960,  60,  trueपूर्ण, अणु2, 1280,  960,  85,  trueपूर्ण,
	अणु1, 1280, 1024,  43,  trueपूर्ण, अणु2, 1280, 1024,  60,  trueपूर्ण, अणु3, 1280, 1024,  75,  trueपूर्ण,
	अणु4, 1280, 1024,  85,  trueपूर्ण,
	अणु1, 1360,  768,  60,  trueपूर्ण,
	अणु1, 1360, 1024,  59,  trueपूर्ण,
	अणु1, 1400, 1050,  60,  trueपूर्ण, अणु2, 1400, 1050,  75,  trueपूर्ण,
	अणु1, 1600, 1200,  60,  trueपूर्ण, अणु2, 1600, 1200,  65,  trueपूर्ण, अणु3, 1600, 1200,  70,  trueपूर्ण,
	अणु4, 1600, 1200,  75,  trueपूर्ण, अणु5, 1600, 1200,  85,  trueपूर्ण, अणु6, 1600, 1200, 100,  trueपूर्ण,
	अणु7, 1600, 1200, 120,  trueपूर्ण,
	अणु1, 1680, 1050,  60,  trueपूर्ण,
	अणु1, 1920, 1080,  30,  trueपूर्ण,
	अणु1, 1920, 1440,  60,  trueपूर्ण, अणु2, 1920, 1440,  65,  trueपूर्ण, अणु3, 1920, 1440,  70,  trueपूर्ण,
	अणु4, 1920, 1440,  75,  trueपूर्ण, अणु5, 1920, 1440,  85,  trueपूर्ण, अणु6, 1920, 1440, 100,  trueपूर्ण,
	अणु1, 2048, 1536,  60,  trueपूर्ण, अणु2, 2048, 1536,  65,  trueपूर्ण, अणु3, 2048, 1536,  70,  trueपूर्ण,
	अणु4, 2048, 1536,  75,  trueपूर्ण, अणु5, 2048, 1536,  85,  trueपूर्ण,
	अणु0,    0,    0,   0, falseपूर्ण
पूर्ण;

अटल काष्ठा _sisfbddcsmodes अणु
	u32 mask;
	u16 h;
	u16 v;
	u32 d;
पूर्ण sisfb_ddcsmodes[] = अणु
	अणु 0x10000, 67, 75, 108000पूर्ण,
	अणु 0x08000, 48, 72,  50000पूर्ण,
	अणु 0x04000, 46, 75,  49500पूर्ण,
	अणु 0x01000, 35, 43,  44900पूर्ण,
	अणु 0x00800, 48, 60,  65000पूर्ण,
	अणु 0x00400, 56, 70,  75000पूर्ण,
	अणु 0x00200, 60, 75,  78800पूर्ण,
	अणु 0x00100, 80, 75, 135000पूर्ण,
	अणु 0x00020, 31, 60,  25200पूर्ण,
	अणु 0x00008, 38, 72,  31500पूर्ण,
	अणु 0x00004, 37, 75,  31500पूर्ण,
	अणु 0x00002, 35, 56,  36000पूर्ण,
	अणु 0x00001, 38, 60,  40000पूर्ण
पूर्ण;

अटल काष्ठा _sisfbddcभ_शेषes अणु
	u16 x;
	u16 y;
	u16 v;
	u16 h;
	u32 d;
पूर्ण sisfb_ddcभ_शेषes[] = अणु
	अणु 1280, 1024, 85, 92, 157500पूर्ण,
	अणु 1600, 1200, 60, 75, 162000पूर्ण,
	अणु 1600, 1200, 65, 82, 175500पूर्ण,
	अणु 1600, 1200, 70, 88, 189000पूर्ण,
	अणु 1600, 1200, 75, 94, 202500पूर्ण,
	अणु 1600, 1200, 85, 107,229500पूर्ण,
	अणु 1920, 1440, 60, 90, 234000पूर्ण,
	अणु 1920, 1440, 75, 113,297000पूर्ण
पूर्ण;

#अगर_घोषित CONFIG_FB_SIS_300
अटल काष्ठा _chswtable अणु
	u16  subsysVenकरोr;
	u16  subsysCard;
	अक्षर *venकरोrName;
	अक्षर *cardName;
पूर्ण mychswtable[] = अणु
	अणु 0x1631, 0x1002, "Mitachi", "0x1002" पूर्ण,
	अणु 0x1071, 0x7521, "Mitac"  , "7521P"  पूर्ण,
	अणु 0,      0,      ""       , ""       पूर्ण
पूर्ण;
#पूर्ण_अगर

अटल काष्ठा _customttable अणु
	u16   chipID;
	अक्षर  *biosversion;
	अक्षर  *biosdate;
	u32   bioschksum;
	u16   biosFootprपूर्णांकAddr[5];
	u8    biosFootprपूर्णांकData[5];
	u16   pcisubsysvenकरोr;
	u16   pcisubsyscard;
	अक्षर  *venकरोrName;
	अक्षर  *cardName;
	u32   SpecialID;
	अक्षर  *optionName;
पूर्ण mycustomttable[] = अणु
	अणु SIS_630, "2.00.07", "09/27/2002-13:38:25",
	  0x3240A8,
	  अणु 0x220, 0x227, 0x228, 0x229, 0x0ee पूर्ण,
	  अणु  0x01,  0xe3,  0x9a,  0x6a,  0xef पूर्ण,
	  0x1039, 0x6300,
	  "Barco", "iQ R200L/300/400", CUT_BARCO1366, "BARCO_1366"
	पूर्ण,
	अणु SIS_630, "2.00.07", "09/27/2002-13:38:25",
	  0x323FBD,
	  अणु 0x220, 0x227, 0x228, 0x229, 0x0ee पूर्ण,
	  अणु  0x00,  0x5a,  0x64,  0x41,  0xef पूर्ण,
	  0x1039, 0x6300,
	  "Barco", "iQ G200L/300/400/500", CUT_BARCO1024, "BARCO_1024"
	पूर्ण,
	अणु SIS_650, "", "",
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x0e11, 0x083c,
	  "Inventec (Compaq)", "3017cl/3045US", CUT_COMPAQ12802, "COMPAQ_1280"
	पूर्ण,
	अणु SIS_650, "", "",
	  0,
	  अणु 0x00c, 0, 0, 0, 0 पूर्ण,
	  अणु 'e'  , 0, 0, 0, 0 पूर्ण,
	  0x1558, 0x0287,
	  "Clevo", "L285/L287 (Version 1)", CUT_CLEVO1024, "CLEVO_L28X_1"
	पूर्ण,
	अणु SIS_650, "", "",
	  0,
	  अणु 0x00c, 0, 0, 0, 0 पूर्ण,
	  अणु 'y'  , 0, 0, 0, 0 पूर्ण,
	  0x1558, 0x0287,
	  "Clevo", "L285/L287 (Version 2)", CUT_CLEVO10242, "CLEVO_L28X_2"
	पूर्ण,
	अणु SIS_650, "", "",
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1558, 0x0400,  /* possibly 401 and 402 as well; not panelsize specअगरic (?) */
	  "Clevo", "D400S/D410S/D400H/D410H", CUT_CLEVO1400, "CLEVO_D4X0"
	पूर्ण,
	अणु SIS_650, "", "",
	  0,	/* Shअगरt LCD in LCD-via-CRT1 mode */
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1558, 0x2263,
	  "Clevo", "D22ES/D27ES", CUT_UNIWILL1024, "CLEVO_D2X0ES"
	पूर्ण,
	अणु SIS_650, "", "",
	  0,	/* Shअगरt LCD in LCD-via-CRT1 mode */
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1734, 0x101f,
	  "Uniwill", "N243S9", CUT_UNIWILL1024, "UNIWILL_N243S9"
	पूर्ण,
	अणु SIS_650, "", "",
	  0,	/* Shअगरt LCD in LCD-via-CRT1 mode */
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1584, 0x5103,
	  "Uniwill", "N35BS1", CUT_UNIWILL10242, "UNIWILL_N35BS1"
	पूर्ण,
	अणु SIS_650, "1.09.2c", "",  /* Other versions, too? */
	  0,	/* Shअगरt LCD in LCD-via-CRT1 mode */
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1019, 0x0f05,
	  "ECS", "A928", CUT_UNIWILL1024, "ECS_A928"
	पूर्ण,
	अणु SIS_740, "1.11.27a", "",
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1043, 0x1612,
	  "Asus", "L3000D/L3500D", CUT_ASUSL3000D, "ASUS_L3X00"
	पूर्ण,
	अणु SIS_650, "1.10.9k", "",
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1025, 0x0028,
	  "Acer", "Aspire 1700", CUT_ACER1280, "ACER_ASPIRE1700"
	पूर्ण,
	अणु SIS_650, "1.10.7w", "",
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x14c0, 0x0012,
	  "Compal", "??? (V1)", CUT_COMPAL1400_1, "COMPAL_1400_1"
	पूर्ण,
	अणु SIS_650, "1.10.7x", "",
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x14c0, 0x0012,
	  "Compal", "??? (V2)", CUT_COMPAL1400_2, "COMPAL_1400_2"
	पूर्ण,
	अणु SIS_650, "1.10.8o", "",
	  0,	/* For EMI (unknown) */
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1043, 0x1612,
	  "Asus", "A2H (V1)", CUT_ASUSA2H_1, "ASUS_A2H_1"
	पूर्ण,
	अणु SIS_650, "1.10.8q", "",
	  0,	/* For EMI */
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0x1043, 0x1612,
	  "Asus", "A2H (V2)", CUT_ASUSA2H_2, "ASUS_A2H_2"
	पूर्ण,
	अणु 4321, "", "",			/* never स्वतःdetected */
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0, 0,
	  "Generic", "LVDS/Parallel 848x480", CUT_PANEL848, "PANEL848x480"
	पूर्ण,
	अणु 4322, "", "",			/* never स्वतःdetected */
	  0,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0, 0 पूर्ण,
	  0, 0,
	  "Generic", "LVDS/Parallel 856x480", CUT_PANEL856, "PANEL856x480"
	पूर्ण,
	अणु 0, "", "",
	  0,
	  अणु 0, 0, 0, 0 पूर्ण,
	  अणु 0, 0, 0, 0 पूर्ण,
	  0, 0,
	  "", "", CUT_NONE, ""
	पूर्ण
पूर्ण;

#पूर्ण_अगर
