<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0-or-later
/*
 *	Sonix sn9c201 sn9c202 library
 *
 * Copyright (C) 2012 Jean-Francois Moine <http://moinejf.मुक्त.fr>
 *	Copyright (C) 2008-2009 microdia project <microdia@googlegroups.com>
 *	Copyright (C) 2009 Brian Johnson <brijohn@gmail.com>
 */

#घोषणा pr_fmt(fmt) KBUILD_MODNAME ": " fmt

#समावेश <linux/input.h>

#समावेश "gspca.h"
#समावेश "jpeg.h"

#समावेश <linux/dmi.h>

MODULE_AUTHOR("Brian Johnson <brijohn@gmail.com>, microdia project <microdia@googlegroups.com>");
MODULE_DESCRIPTION("GSPCA/SN9C20X USB Camera Driver");
MODULE_LICENSE("GPL");

/*
 * Pixel क्रमmat निजी data
 */
#घोषणा SCALE_MASK	0x0f
#घोषणा SCALE_160x120	0
#घोषणा SCALE_320x240	1
#घोषणा SCALE_640x480	2
#घोषणा SCALE_1280x1024	3
#घोषणा MODE_RAW	0x10
#घोषणा MODE_JPEG	0x20
#घोषणा MODE_SXGA	0x80

#घोषणा SENSOR_OV9650	0
#घोषणा SENSOR_OV9655	1
#घोषणा SENSOR_SOI968	2
#घोषणा SENSOR_OV7660	3
#घोषणा SENSOR_OV7670	4
#घोषणा SENSOR_MT9V011	5
#घोषणा SENSOR_MT9V111	6
#घोषणा SENSOR_MT9V112	7
#घोषणा SENSOR_MT9M001	8
#घोषणा SENSOR_MT9M111	9
#घोषणा SENSOR_MT9M112  10
#घोषणा SENSOR_HV7131R	11
#घोषणा SENSOR_MT9VPRB	12

/* camera flags */
#घोषणा HAS_NO_BUTTON	0x1
#घोषणा LED_REVERSE	0x2 /* some cameras unset gpio to turn on leds */
#घोषणा FLIP_DETECT	0x4

/* specअगरic webcam descriptor */
काष्ठा sd अणु
	काष्ठा gspca_dev gspca_dev;

	काष्ठा अणु /* color control cluster */
		काष्ठा v4l2_ctrl *brightness;
		काष्ठा v4l2_ctrl *contrast;
		काष्ठा v4l2_ctrl *saturation;
		काष्ठा v4l2_ctrl *hue;
	पूर्ण;
	काष्ठा अणु /* blue/red balance control cluster */
		काष्ठा v4l2_ctrl *blue;
		काष्ठा v4l2_ctrl *red;
	पूर्ण;
	काष्ठा अणु /* h/vflip control cluster */
		काष्ठा v4l2_ctrl *hflip;
		काष्ठा v4l2_ctrl *vflip;
	पूर्ण;
	काष्ठा v4l2_ctrl *gamma;
	काष्ठा अणु /* स्वतःgain and exposure or gain control cluster */
		काष्ठा v4l2_ctrl *स्वतःgain;
		काष्ठा v4l2_ctrl *exposure;
		काष्ठा v4l2_ctrl *gain;
	पूर्ण;
	काष्ठा v4l2_ctrl *jpegqual;

	काष्ठा work_काष्ठा work;

	u32 pktsz;			/* (used by pkt_scan) */
	u16 npkt;
	s8 nchg;
	u8 fmt;				/* (used क्रम JPEG QTAB update */

#घोषणा MIN_AVG_LUM 80
#घोषणा MAX_AVG_LUM 130
	atomic_t avg_lum;
	u8 old_step;
	u8 older_step;
	u8 exposure_step;

	u8 i2c_addr;
	u8 i2c_पूर्णांकf;
	u8 sensor;
	u8 hstart;
	u8 vstart;

	u8 jpeg_hdr[JPEG_HDR_SZ];

	u8 flags;
पूर्ण;

अटल व्योम qual_upd(काष्ठा work_काष्ठा *work);

काष्ठा i2c_reg_u8 अणु
	u8 reg;
	u8 val;
पूर्ण;

काष्ठा i2c_reg_u16 अणु
	u8 reg;
	u16 val;
पूर्ण;

अटल स्थिर काष्ठा dmi_प्रणाली_id flip_dmi_table[] = अणु
	अणु
		.ident = "MSI MS-1034",
		.matches = अणु
			DMI_MATCH(DMI_SYS_VENDOR, "MICRO-STAR INT'L CO.,LTD."),
			DMI_MATCH(DMI_PRODUCT_NAME, "MS-1034"),
			DMI_MATCH(DMI_PRODUCT_VERSION, "0341")
		पूर्ण
	पूर्ण,
	अणु
		.ident = "MSI MS-1039",
		.matches = अणु
			DMI_MATCH(DMI_SYS_VENDOR, "MICRO-STAR INT'L CO.,LTD."),
			DMI_MATCH(DMI_PRODUCT_NAME, "MS-1039"),
		पूर्ण
	पूर्ण,
	अणु
		.ident = "MSI MS-1632",
		.matches = अणु
			DMI_MATCH(DMI_BOARD_VENDOR, "MSI"),
			DMI_MATCH(DMI_BOARD_NAME, "MS-1632")
		पूर्ण
	पूर्ण,
	अणु
		.ident = "MSI MS-1633X",
		.matches = अणु
			DMI_MATCH(DMI_BOARD_VENDOR, "MSI"),
			DMI_MATCH(DMI_BOARD_NAME, "MS-1633X")
		पूर्ण
	पूर्ण,
	अणु
		.ident = "MSI MS-1635X",
		.matches = अणु
			DMI_MATCH(DMI_BOARD_VENDOR, "MSI"),
			DMI_MATCH(DMI_BOARD_NAME, "MS-1635X")
		पूर्ण
	पूर्ण,
	अणु
		.ident = "ASUSTeK W7J",
		.matches = अणु
			DMI_MATCH(DMI_BOARD_VENDOR, "ASUSTeK Computer Inc."),
			DMI_MATCH(DMI_BOARD_NAME, "W7J       ")
		पूर्ण
	पूर्ण,
	अणुपूर्ण
पूर्ण;

अटल स्थिर काष्ठा v4l2_pix_क्रमmat vga_mode[] = अणु
	अणु160, 120, V4L2_PIX_FMT_JPEG, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 160 * 120 * 4 / 8 + 590,
		.colorspace = V4L2_COLORSPACE_JPEG,
		.priv = SCALE_160x120 | MODE_JPEGपूर्ण,
	अणु160, 120, V4L2_PIX_FMT_SBGGR8, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 160 * 120,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_160x120 | MODE_RAWपूर्ण,
	अणु160, 120, V4L2_PIX_FMT_SN9C20X_I420, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 240 * 120,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_160x120पूर्ण,
	अणु320, 240, V4L2_PIX_FMT_JPEG, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 320 * 240 * 4 / 8 + 590,
		.colorspace = V4L2_COLORSPACE_JPEG,
		.priv = SCALE_320x240 | MODE_JPEGपूर्ण,
	अणु320, 240, V4L2_PIX_FMT_SBGGR8, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 320 * 240 ,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_320x240 | MODE_RAWपूर्ण,
	अणु320, 240, V4L2_PIX_FMT_SN9C20X_I420, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 480 * 240 ,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_320x240पूर्ण,
	अणु640, 480, V4L2_PIX_FMT_JPEG, V4L2_FIELD_NONE,
		.bytesperline = 640,
		.sizeimage = 640 * 480 * 4 / 8 + 590,
		.colorspace = V4L2_COLORSPACE_JPEG,
		.priv = SCALE_640x480 | MODE_JPEGपूर्ण,
	अणु640, 480, V4L2_PIX_FMT_SBGGR8, V4L2_FIELD_NONE,
		.bytesperline = 640,
		.sizeimage = 640 * 480,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_640x480 | MODE_RAWपूर्ण,
	अणु640, 480, V4L2_PIX_FMT_SN9C20X_I420, V4L2_FIELD_NONE,
		.bytesperline = 640,
		.sizeimage = 960 * 480,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_640x480पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा v4l2_pix_क्रमmat sxga_mode[] = अणु
	अणु160, 120, V4L2_PIX_FMT_JPEG, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 160 * 120 * 4 / 8 + 590,
		.colorspace = V4L2_COLORSPACE_JPEG,
		.priv = SCALE_160x120 | MODE_JPEGपूर्ण,
	अणु160, 120, V4L2_PIX_FMT_SBGGR8, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 160 * 120,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_160x120 | MODE_RAWपूर्ण,
	अणु160, 120, V4L2_PIX_FMT_SN9C20X_I420, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 240 * 120,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_160x120पूर्ण,
	अणु320, 240, V4L2_PIX_FMT_JPEG, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 320 * 240 * 4 / 8 + 590,
		.colorspace = V4L2_COLORSPACE_JPEG,
		.priv = SCALE_320x240 | MODE_JPEGपूर्ण,
	अणु320, 240, V4L2_PIX_FMT_SBGGR8, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 320 * 240 ,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_320x240 | MODE_RAWपूर्ण,
	अणु320, 240, V4L2_PIX_FMT_SN9C20X_I420, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 480 * 240 ,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_320x240पूर्ण,
	अणु640, 480, V4L2_PIX_FMT_JPEG, V4L2_FIELD_NONE,
		.bytesperline = 640,
		.sizeimage = 640 * 480 * 4 / 8 + 590,
		.colorspace = V4L2_COLORSPACE_JPEG,
		.priv = SCALE_640x480 | MODE_JPEGपूर्ण,
	अणु640, 480, V4L2_PIX_FMT_SBGGR8, V4L2_FIELD_NONE,
		.bytesperline = 640,
		.sizeimage = 640 * 480,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_640x480 | MODE_RAWपूर्ण,
	अणु640, 480, V4L2_PIX_FMT_SN9C20X_I420, V4L2_FIELD_NONE,
		.bytesperline = 640,
		.sizeimage = 960 * 480,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_640x480पूर्ण,
	अणु1280, 1024, V4L2_PIX_FMT_SBGGR8, V4L2_FIELD_NONE,
		.bytesperline = 1280,
		.sizeimage = 1280 * 1024,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_1280x1024 | MODE_RAW | MODE_SXGAपूर्ण,
पूर्ण;

अटल स्थिर काष्ठा v4l2_pix_क्रमmat mono_mode[] = अणु
	अणु160, 120, V4L2_PIX_FMT_GREY, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 160 * 120,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_160x120 | MODE_RAWपूर्ण,
	अणु320, 240, V4L2_PIX_FMT_GREY, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 320 * 240 ,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_320x240 | MODE_RAWपूर्ण,
	अणु640, 480, V4L2_PIX_FMT_GREY, V4L2_FIELD_NONE,
		.bytesperline = 640,
		.sizeimage = 640 * 480,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_640x480 | MODE_RAWपूर्ण,
	अणु1280, 1024, V4L2_PIX_FMT_GREY, V4L2_FIELD_NONE,
		.bytesperline = 1280,
		.sizeimage = 1280 * 1024,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = SCALE_1280x1024 | MODE_RAW | MODE_SXGAपूर्ण,
पूर्ण;

अटल स्थिर s16 hsv_red_x[] = अणु
	41,  44,  46,  48,  50,  52,  54,  56,
	58,  60,  62,  64,  66,  68,  70,  72,
	74,  76,  78,  80,  81,  83,  85,  87,
	88,  90,  92,  93,  95,  97,  98, 100,
	101, 102, 104, 105, 107, 108, 109, 110,
	112, 113, 114, 115, 116, 117, 118, 119,
	120, 121, 122, 123, 123, 124, 125, 125,
	126, 127, 127, 128, 128, 129, 129, 129,
	130, 130, 130, 130, 131, 131, 131, 131,
	131, 131, 131, 131, 130, 130, 130, 130,
	129, 129, 129, 128, 128, 127, 127, 126,
	125, 125, 124, 123, 122, 122, 121, 120,
	119, 118, 117, 116, 115, 114, 112, 111,
	110, 109, 107, 106, 105, 103, 102, 101,
	99,  98,  96,  94,  93,  91,  90,  88,
	86,  84,  83,  81,  79,  77,  75,  74,
	72,  70,  68,  66,  64,  62,  60,  58,
	56,  54,  52,  49,  47,  45,  43,  41,
	39,  36,  34,  32,  30,  28,  25,  23,
	21,  19,  16,  14,  12,   9,   7,   5,
	3,   0,  -1,  -3,  -6,  -8, -10, -12,
	-15, -17, -19, -22, -24, -26, -28, -30,
	-33, -35, -37, -39, -41, -44, -46, -48,
	-50, -52, -54, -56, -58, -60, -62, -64,
	-66, -68, -70, -72, -74, -76, -78, -80,
	-81, -83, -85, -87, -88, -90, -92, -93,
	-95, -97, -98, -100, -101, -102, -104, -105,
	-107, -108, -109, -110, -112, -113, -114, -115,
	-116, -117, -118, -119, -120, -121, -122, -123,
	-123, -124, -125, -125, -126, -127, -127, -128,
	-128, -128, -128, -128, -128, -128, -128, -128,
	-128, -128, -128, -128, -128, -128, -128, -128,
	-128, -128, -128, -128, -128, -128, -128, -128,
	-128, -127, -127, -126, -125, -125, -124, -123,
	-122, -122, -121, -120, -119, -118, -117, -116,
	-115, -114, -112, -111, -110, -109, -107, -106,
	-105, -103, -102, -101, -99, -98, -96, -94,
	-93, -91, -90, -88, -86, -84, -83, -81,
	-79, -77, -75, -74, -72, -70, -68, -66,
	-64, -62, -60, -58, -56, -54, -52, -49,
	-47, -45, -43, -41, -39, -36, -34, -32,
	-30, -28, -25, -23, -21, -19, -16, -14,
	-12,  -9,  -7,  -5,  -3,   0,   1,   3,
	6,   8,  10,  12,  15,  17,  19,  22,
	24,  26,  28,  30,  33,  35,  37,  39, 41
पूर्ण;

अटल स्थिर s16 hsv_red_y[] = अणु
	82,  80,  78,  76,  74,  73,  71,  69,
	67,  65,  63,  61,  58,  56,  54,  52,
	50,  48,  46,  44,  41,  39,  37,  35,
	32,  30,  28,  26,  23,  21,  19,  16,
	14,  12,  10,   7,   5,   3,   0,  -1,
	-3,  -6,  -8, -10, -13, -15, -17, -19,
	-22, -24, -26, -29, -31, -33, -35, -38,
	-40, -42, -44, -46, -48, -51, -53, -55,
	-57, -59, -61, -63, -65, -67, -69, -71,
	-73, -75, -77, -79, -81, -82, -84, -86,
	-88, -89, -91, -93, -94, -96, -98, -99,
	-101, -102, -104, -105, -106, -108, -109, -110,
	-112, -113, -114, -115, -116, -117, -119, -120,
	-120, -121, -122, -123, -124, -125, -126, -126,
	-127, -128, -128, -128, -128, -128, -128, -128,
	-128, -128, -128, -128, -128, -128, -128, -128,
	-128, -128, -128, -128, -128, -128, -128, -128,
	-128, -128, -128, -128, -128, -128, -128, -128,
	-127, -127, -126, -125, -125, -124, -123, -122,
	-121, -120, -119, -118, -117, -116, -115, -114,
	-113, -111, -110, -109, -107, -106, -105, -103,
	-102, -100, -99, -97, -96, -94, -92, -91,
	-89, -87, -85, -84, -82, -80, -78, -76,
	-74, -73, -71, -69, -67, -65, -63, -61,
	-58, -56, -54, -52, -50, -48, -46, -44,
	-41, -39, -37, -35, -32, -30, -28, -26,
	-23, -21, -19, -16, -14, -12, -10,  -7,
	-5,  -3,   0,   1,   3,   6,   8,  10,
	13,  15,  17,  19,  22,  24,  26,  29,
	31,  33,  35,  38,  40,  42,  44,  46,
	48,  51,  53,  55,  57,  59,  61,  63,
	65,  67,  69,  71,  73,  75,  77,  79,
	81,  82,  84,  86,  88,  89,  91,  93,
	94,  96,  98,  99, 101, 102, 104, 105,
	106, 108, 109, 110, 112, 113, 114, 115,
	116, 117, 119, 120, 120, 121, 122, 123,
	124, 125, 126, 126, 127, 128, 128, 129,
	129, 130, 130, 131, 131, 131, 131, 132,
	132, 132, 132, 132, 132, 132, 132, 132,
	132, 132, 132, 131, 131, 131, 130, 130,
	130, 129, 129, 128, 127, 127, 126, 125,
	125, 124, 123, 122, 121, 120, 119, 118,
	117, 116, 115, 114, 113, 111, 110, 109,
	107, 106, 105, 103, 102, 100,  99,  97,
	96, 94, 92, 91, 89, 87, 85, 84, 82
पूर्ण;

अटल स्थिर s16 hsv_green_x[] = अणु
	-124, -124, -125, -125, -125, -125, -125, -125,
	-125, -126, -126, -125, -125, -125, -125, -125,
	-125, -124, -124, -124, -123, -123, -122, -122,
	-121, -121, -120, -120, -119, -118, -117, -117,
	-116, -115, -114, -113, -112, -111, -110, -109,
	-108, -107, -105, -104, -103, -102, -100, -99,
	-98, -96, -95, -93, -92, -91, -89, -87,
	-86, -84, -83, -81, -79, -77, -76, -74,
	-72, -70, -69, -67, -65, -63, -61, -59,
	-57, -55, -53, -51, -49, -47, -45, -43,
	-41, -39, -37, -35, -33, -30, -28, -26,
	-24, -22, -20, -18, -15, -13, -11,  -9,
	-7,  -4,  -2,   0,   1,   3,   6,   8,
	10,  12,  14,  17,  19,  21,  23,  25,
	27,  29,  32,  34,  36,  38,  40,  42,
	44,  46,  48,  50,  52,  54,  56,  58,
	60,  62,  64,  66,  68,  70,  71,  73,
	75,  77,  78,  80,  82,  83,  85,  87,
	88,  90,  91,  93,  94,  96,  97,  98,
	100, 101, 102, 104, 105, 106, 107, 108,
	109, 111, 112, 113, 113, 114, 115, 116,
	117, 118, 118, 119, 120, 120, 121, 122,
	122, 123, 123, 124, 124, 124, 125, 125,
	125, 125, 125, 125, 125, 126, 126, 125,
	125, 125, 125, 125, 125, 124, 124, 124,
	123, 123, 122, 122, 121, 121, 120, 120,
	119, 118, 117, 117, 116, 115, 114, 113,
	112, 111, 110, 109, 108, 107, 105, 104,
	103, 102, 100,  99,  98,  96,  95,  93,
	92,  91,  89,  87,  86,  84,  83,  81,
	79,  77,  76,  74,  72,  70,  69,  67,
	65,  63,  61,  59,  57,  55,  53,  51,
	49,  47,  45,  43,  41,  39,  37,  35,
	33,  30,  28,  26,  24,  22,  20,  18,
	15,  13,  11,   9,   7,   4,   2,   0,
	-1,  -3,  -6,  -8, -10, -12, -14, -17,
	-19, -21, -23, -25, -27, -29, -32, -34,
	-36, -38, -40, -42, -44, -46, -48, -50,
	-52, -54, -56, -58, -60, -62, -64, -66,
	-68, -70, -71, -73, -75, -77, -78, -80,
	-82, -83, -85, -87, -88, -90, -91, -93,
	-94, -96, -97, -98, -100, -101, -102, -104,
	-105, -106, -107, -108, -109, -111, -112, -113,
	-113, -114, -115, -116, -117, -118, -118, -119,
	-120, -120, -121, -122, -122, -123, -123, -124, -124
पूर्ण;

अटल स्थिर s16 hsv_green_y[] = अणु
	-100, -99, -98, -97, -95, -94, -93, -91,
	-90, -89, -87, -86, -84, -83, -81, -80,
	-78, -76, -75, -73, -71, -70, -68, -66,
	-64, -63, -61, -59, -57, -55, -53, -51,
	-49, -48, -46, -44, -42, -40, -38, -36,
	-34, -32, -30, -27, -25, -23, -21, -19,
	-17, -15, -13, -11,  -9,  -7,  -4,  -2,
	0,   1,   3,   5,   7,   9,  11,  14,
	16,  18,  20,  22,  24,  26,  28,  30,
	32,  34,  36,  38,  40,  42,  44,  46,
	48,  50,  52,  54,  56,  58,  59,  61,
	63,  65,  67,  68,  70,  72,  74,  75,
	77,  78,  80,  82,  83,  85,  86,  88,
	89,  90,  92,  93,  95,  96,  97,  98,
	100, 101, 102, 103, 104, 105, 106, 107,
	108, 109, 110, 111, 112, 112, 113, 114,
	115, 115, 116, 116, 117, 117, 118, 118,
	119, 119, 119, 120, 120, 120, 120, 120,
	121, 121, 121, 121, 121, 121, 120, 120,
	120, 120, 120, 119, 119, 119, 118, 118,
	117, 117, 116, 116, 115, 114, 114, 113,
	112, 111, 111, 110, 109, 108, 107, 106,
	105, 104, 103, 102, 100,  99,  98,  97,
	95,  94,  93,  91,  90,  89,  87,  86,
	84,  83,  81,  80,  78,  76,  75,  73,
	71,  70,  68,  66,  64,  63,  61,  59,
	57,  55,  53,  51,  49,  48,  46,  44,
	42,  40,  38,  36,  34,  32,  30,  27,
	25,  23,  21,  19,  17,  15,  13,  11,
	9,   7,   4,   2,   0,  -1,  -3,  -5,
	-7,  -9, -11, -14, -16, -18, -20, -22,
	-24, -26, -28, -30, -32, -34, -36, -38,
	-40, -42, -44, -46, -48, -50, -52, -54,
	-56, -58, -59, -61, -63, -65, -67, -68,
	-70, -72, -74, -75, -77, -78, -80, -82,
	-83, -85, -86, -88, -89, -90, -92, -93,
	-95, -96, -97, -98, -100, -101, -102, -103,
	-104, -105, -106, -107, -108, -109, -110, -111,
	-112, -112, -113, -114, -115, -115, -116, -116,
	-117, -117, -118, -118, -119, -119, -119, -120,
	-120, -120, -120, -120, -121, -121, -121, -121,
	-121, -121, -120, -120, -120, -120, -120, -119,
	-119, -119, -118, -118, -117, -117, -116, -116,
	-115, -114, -114, -113, -112, -111, -111, -110,
	-109, -108, -107, -106, -105, -104, -103, -102, -100
पूर्ण;

अटल स्थिर s16 hsv_blue_x[] = अणु
	112, 113, 114, 114, 115, 116, 117, 117,
	118, 118, 119, 119, 120, 120, 120, 121,
	121, 121, 122, 122, 122, 122, 122, 122,
	122, 122, 122, 122, 122, 122, 121, 121,
	121, 120, 120, 120, 119, 119, 118, 118,
	117, 116, 116, 115, 114, 113, 113, 112,
	111, 110, 109, 108, 107, 106, 105, 104,
	103, 102, 100,  99,  98,  97,  95,  94,
	93,  91,  90,  88,  87,  85,  84,  82,
	80,  79,  77,  76,  74,  72,  70,  69,
	67,  65,  63,  61,  60,  58,  56,  54,
	52,  50,  48,  46,  44,  42,  40,  38,
	36,  34,  32,  30,  28,  26,  24,  22,
	19,  17,  15,  13,  11,   9,   7,   5,
	2,   0,  -1,  -3,  -5,  -7,  -9, -12,
	-14, -16, -18, -20, -22, -24, -26, -28,
	-31, -33, -35, -37, -39, -41, -43, -45,
	-47, -49, -51, -53, -54, -56, -58, -60,
	-62, -64, -66, -67, -69, -71, -73, -74,
	-76, -78, -79, -81, -83, -84, -86, -87,
	-89, -90, -92, -93, -94, -96, -97, -98,
	-99, -101, -102, -103, -104, -105, -106, -107,
	-108, -109, -110, -111, -112, -113, -114, -114,
	-115, -116, -117, -117, -118, -118, -119, -119,
	-120, -120, -120, -121, -121, -121, -122, -122,
	-122, -122, -122, -122, -122, -122, -122, -122,
	-122, -122, -121, -121, -121, -120, -120, -120,
	-119, -119, -118, -118, -117, -116, -116, -115,
	-114, -113, -113, -112, -111, -110, -109, -108,
	-107, -106, -105, -104, -103, -102, -100, -99,
	-98, -97, -95, -94, -93, -91, -90, -88,
	-87, -85, -84, -82, -80, -79, -77, -76,
	-74, -72, -70, -69, -67, -65, -63, -61,
	-60, -58, -56, -54, -52, -50, -48, -46,
	-44, -42, -40, -38, -36, -34, -32, -30,
	-28, -26, -24, -22, -19, -17, -15, -13,
	-11,  -9,  -7,  -5,  -2,   0,   1,   3,
	5,   7,   9,  12,  14,  16,  18,  20,
	22,  24,  26,  28,  31,  33,  35,  37,
	39,  41,  43,  45,  47,  49,  51,  53,
	54,  56,  58,  60,  62,  64,  66,  67,
	69,  71,  73,  74,  76,  78,  79,  81,
	83,  84,  86,  87,  89,  90,  92,  93,
	94,  96,  97,  98,  99, 101, 102, 103,
	104, 105, 106, 107, 108, 109, 110, 111, 112
पूर्ण;

अटल स्थिर s16 hsv_blue_y[] = अणु
	-11, -13, -15, -17, -19, -21, -23, -25,
	-27, -29, -31, -33, -35, -37, -39, -41,
	-43, -45, -46, -48, -50, -52, -54, -55,
	-57, -59, -61, -62, -64, -66, -67, -69,
	-71, -72, -74, -75, -77, -78, -80, -81,
	-83, -84, -86, -87, -88, -90, -91, -92,
	-93, -95, -96, -97, -98, -99, -100, -101,
	-102, -103, -104, -105, -106, -106, -107, -108,
	-109, -109, -110, -111, -111, -112, -112, -113,
	-113, -114, -114, -114, -115, -115, -115, -115,
	-116, -116, -116, -116, -116, -116, -116, -116,
	-116, -115, -115, -115, -115, -114, -114, -114,
	-113, -113, -112, -112, -111, -111, -110, -110,
	-109, -108, -108, -107, -106, -105, -104, -103,
	-102, -101, -100, -99, -98, -97, -96, -95,
	-94, -93, -91, -90, -89, -88, -86, -85,
	-84, -82, -81, -79, -78, -76, -75, -73,
	-71, -70, -68, -67, -65, -63, -62, -60,
	-58, -56, -55, -53, -51, -49, -47, -45,
	-44, -42, -40, -38, -36, -34, -32, -30,
	-28, -26, -24, -22, -20, -18, -16, -14,
	-12, -10,  -8,  -6,  -4,  -2,   0,   1,
	3,   5,   7,   9,  11,  13,  15,  17,
	19,  21,  23,  25,  27,  29,  31,  33,
	35,  37,  39,  41,  43,  45,  46,  48,
	50,  52,  54,  55,  57,  59,  61,  62,
	64,  66,  67,  69,  71,  72,  74,  75,
	77,  78,  80,  81,  83,  84,  86,  87,
	88,  90,  91,  92,  93,  95,  96,  97,
	98,  99, 100, 101, 102, 103, 104, 105,
	106, 106, 107, 108, 109, 109, 110, 111,
	111, 112, 112, 113, 113, 114, 114, 114,
	115, 115, 115, 115, 116, 116, 116, 116,
	116, 116, 116, 116, 116, 115, 115, 115,
	115, 114, 114, 114, 113, 113, 112, 112,
	111, 111, 110, 110, 109, 108, 108, 107,
	106, 105, 104, 103, 102, 101, 100,  99,
	98,  97,  96,  95,  94,  93,  91,  90,
	89,  88,  86,  85,  84,  82,  81,  79,
	78,  76,  75,  73,  71,  70,  68,  67,
	65,  63,  62,  60,  58,  56,  55,  53,
	51,  49,  47,  45,  44,  42,  40,  38,
	36,  34,  32,  30,  28,  26,  24,  22,
	20,  18,  16,  14,  12,  10,   8,   6,
	4,   2,   0,  -1,  -3,  -5,  -7,  -9, -11
पूर्ण;

अटल स्थिर u16 bridge_init[][2] = अणु
	अणु0x1000, 0x78पूर्ण, अणु0x1001, 0x40पूर्ण, अणु0x1002, 0x1cपूर्ण,
	अणु0x1020, 0x80पूर्ण, अणु0x1061, 0x01पूर्ण, अणु0x1067, 0x40पूर्ण,
	अणु0x1068, 0x30पूर्ण, अणु0x1069, 0x20पूर्ण,	अणु0x106a, 0x10पूर्ण,
	अणु0x106b, 0x08पूर्ण,	अणु0x1188, 0x87पूर्ण,	अणु0x11a1, 0x00पूर्ण,
	अणु0x11a2, 0x00पूर्ण,	अणु0x11a3, 0x6aपूर्ण,	अणु0x11a4, 0x50पूर्ण,
	अणु0x11ab, 0x00पूर्ण,	अणु0x11ac, 0x00पूर्ण,	अणु0x11ad, 0x50पूर्ण,
	अणु0x11ae, 0x3cपूर्ण,	अणु0x118a, 0x04पूर्ण,	अणु0x0395, 0x04पूर्ण,
	अणु0x11b8, 0x3aपूर्ण,	अणु0x118b, 0x0eपूर्ण,	अणु0x10f7, 0x05पूर्ण,
	अणु0x10f8, 0x14पूर्ण,	अणु0x10fa, 0xffपूर्ण,	अणु0x10f9, 0x00पूर्ण,
	अणु0x11ba, 0x0aपूर्ण,	अणु0x11a5, 0x2dपूर्ण,	अणु0x11a6, 0x2dपूर्ण,
	अणु0x11a7, 0x3aपूर्ण,	अणु0x11a8, 0x05पूर्ण,	अणु0x11a9, 0x04पूर्ण,
	अणु0x11aa, 0x3fपूर्ण,	अणु0x11af, 0x28पूर्ण,	अणु0x11b0, 0xd8पूर्ण,
	अणु0x11b1, 0x14पूर्ण,	अणु0x11b2, 0xecपूर्ण,	अणु0x11b3, 0x32पूर्ण,
	अणु0x11b4, 0xddपूर्ण,	अणु0x11b5, 0x32पूर्ण,	अणु0x11b6, 0xddपूर्ण,
	अणु0x10e0, 0x2cपूर्ण,	अणु0x11bc, 0x40पूर्ण,	अणु0x11bd, 0x01पूर्ण,
	अणु0x11be, 0xf0पूर्ण,	अणु0x11bf, 0x00पूर्ण,	अणु0x118c, 0x1fपूर्ण,
	अणु0x118d, 0x1fपूर्ण,	अणु0x118e, 0x1fपूर्ण,	अणु0x118f, 0x1fपूर्ण,
	अणु0x1180, 0x01पूर्ण,	अणु0x1181, 0x00पूर्ण,	अणु0x1182, 0x01पूर्ण,
	अणु0x1183, 0x00पूर्ण,	अणु0x1184, 0x50पूर्ण,	अणु0x1185, 0x80पूर्ण,
	अणु0x1007, 0x00पूर्ण
पूर्ण;

/* Gain = (bit[3:0] / 16 + 1) * (bit[4] + 1) * (bit[5] + 1) * (bit[6] + 1) */
अटल स्थिर u8 ov_gain[] = अणु
	0x00 /* 1x */, 0x04 /* 1.25x */, 0x08 /* 1.5x */, 0x0c /* 1.75x */,
	0x10 /* 2x */, 0x12 /* 2.25x */, 0x14 /* 2.5x */, 0x16 /* 2.75x */,
	0x18 /* 3x */, 0x1a /* 3.25x */, 0x1c /* 3.5x */, 0x1e /* 3.75x */,
	0x30 /* 4x */, 0x31 /* 4.25x */, 0x32 /* 4.5x */, 0x33 /* 4.75x */,
	0x34 /* 5x */, 0x35 /* 5.25x */, 0x36 /* 5.5x */, 0x37 /* 5.75x */,
	0x38 /* 6x */, 0x39 /* 6.25x */, 0x3a /* 6.5x */, 0x3b /* 6.75x */,
	0x3c /* 7x */, 0x3d /* 7.25x */, 0x3e /* 7.5x */, 0x3f /* 7.75x */,
	0x70 /* 8x */
पूर्ण;

/* Gain = (bit[8] + 1) * (bit[7] + 1) * (bit[6:0] * 0.03125) */
अटल स्थिर u16 micron1_gain[] = अणु
	/* 1x   1.25x   1.5x    1.75x */
	0x0020, 0x0028, 0x0030, 0x0038,
	/* 2x   2.25x   2.5x    2.75x */
	0x00a0, 0x00a4, 0x00a8, 0x00ac,
	/* 3x   3.25x   3.5x    3.75x */
	0x00b0, 0x00b4, 0x00b8, 0x00bc,
	/* 4x   4.25x   4.5x    4.75x */
	0x00c0, 0x00c4, 0x00c8, 0x00cc,
	/* 5x   5.25x   5.5x    5.75x */
	0x00d0, 0x00d4, 0x00d8, 0x00dc,
	/* 6x   6.25x   6.5x    6.75x */
	0x00e0, 0x00e4, 0x00e8, 0x00ec,
	/* 7x   7.25x   7.5x    7.75x */
	0x00f0, 0x00f4, 0x00f8, 0x00fc,
	/* 8x */
	0x01c0
पूर्ण;

/* mt9m001 sensor uses a dअगरferent gain क्रमmula then other micron sensors */
/* Gain = (bit[6] + 1) * (bit[5-0] * 0.125) */
अटल स्थिर u16 micron2_gain[] = अणु
	/* 1x   1.25x   1.5x    1.75x */
	0x0008, 0x000a, 0x000c, 0x000e,
	/* 2x   2.25x   2.5x    2.75x */
	0x0010, 0x0012, 0x0014, 0x0016,
	/* 3x   3.25x   3.5x    3.75x */
	0x0018, 0x001a, 0x001c, 0x001e,
	/* 4x   4.25x   4.5x    4.75x */
	0x0020, 0x0051, 0x0052, 0x0053,
	/* 5x   5.25x   5.5x    5.75x */
	0x0054, 0x0055, 0x0056, 0x0057,
	/* 6x   6.25x   6.5x    6.75x */
	0x0058, 0x0059, 0x005a, 0x005b,
	/* 7x   7.25x   7.5x    7.75x */
	0x005c, 0x005d, 0x005e, 0x005f,
	/* 8x */
	0x0060
पूर्ण;

/* Gain = .5 + bit[7:0] / 16 */
अटल स्थिर u8 hv7131r_gain[] = अणु
	0x08 /* 1x */, 0x0c /* 1.25x */, 0x10 /* 1.5x */, 0x14 /* 1.75x */,
	0x18 /* 2x */, 0x1c /* 2.25x */, 0x20 /* 2.5x */, 0x24 /* 2.75x */,
	0x28 /* 3x */, 0x2c /* 3.25x */, 0x30 /* 3.5x */, 0x34 /* 3.75x */,
	0x38 /* 4x */, 0x3c /* 4.25x */, 0x40 /* 4.5x */, 0x44 /* 4.75x */,
	0x48 /* 5x */, 0x4c /* 5.25x */, 0x50 /* 5.5x */, 0x54 /* 5.75x */,
	0x58 /* 6x */, 0x5c /* 6.25x */, 0x60 /* 6.5x */, 0x64 /* 6.75x */,
	0x68 /* 7x */, 0x6c /* 7.25x */, 0x70 /* 7.5x */, 0x74 /* 7.75x */,
	0x78 /* 8x */
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u8 soi968_init[] = अणु
	अणु0x0c, 0x00पूर्ण, अणु0x0f, 0x1fपूर्ण,
	अणु0x11, 0x80पूर्ण, अणु0x38, 0x52पूर्ण, अणु0x1e, 0x00पूर्ण,
	अणु0x33, 0x08पूर्ण, अणु0x35, 0x8cपूर्ण, अणु0x36, 0x0cपूर्ण,
	अणु0x37, 0x04पूर्ण, अणु0x45, 0x04पूर्ण, अणु0x47, 0xffपूर्ण,
	अणु0x3e, 0x00पूर्ण, अणु0x3f, 0x00पूर्ण, अणु0x3b, 0x20पूर्ण,
	अणु0x3a, 0x96पूर्ण, अणु0x3d, 0x0aपूर्ण, अणु0x14, 0x8eपूर्ण,
	अणु0x13, 0x8bपूर्ण, अणु0x12, 0x40पूर्ण, अणु0x17, 0x13पूर्ण,
	अणु0x18, 0x63पूर्ण, अणु0x19, 0x01पूर्ण, अणु0x1a, 0x79पूर्ण,
	अणु0x32, 0x24पूर्ण, अणु0x03, 0x00पूर्ण, अणु0x11, 0x40पूर्ण,
	अणु0x2a, 0x10पूर्ण, अणु0x2b, 0xe0पूर्ण, अणु0x10, 0x32पूर्ण,
	अणु0x00, 0x00पूर्ण, अणु0x01, 0x80पूर्ण, अणु0x02, 0x80पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u8 ov7660_init[] = अणु
	अणु0x0e, 0x80पूर्ण, अणु0x0d, 0x08पूर्ण, अणु0x0f, 0xc3पूर्ण,
	अणु0x04, 0xc3पूर्ण, अणु0x10, 0x40पूर्ण, अणु0x11, 0x40पूर्ण,
	अणु0x12, 0x05पूर्ण, अणु0x13, 0xbaपूर्ण, अणु0x14, 0x2aपूर्ण,
	/* HDG Set hstart and hstop, datasheet शेष 0x11, 0x61, using
	   0x10, 0x61 and sd->hstart, vstart = 3, fixes ugly colored borders */
	अणु0x17, 0x10पूर्ण, अणु0x18, 0x61पूर्ण,
	अणु0x37, 0x0fपूर्ण, अणु0x38, 0x02पूर्ण, अणु0x39, 0x43पूर्ण,
	अणु0x3a, 0x00पूर्ण, अणु0x69, 0x90पूर्ण, अणु0x2d, 0x00पूर्ण,
	अणु0x2e, 0x00पूर्ण, अणु0x01, 0x78पूर्ण, अणु0x02, 0x50पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u8 ov7670_init[] = अणु
	अणु0x11, 0x80पूर्ण, अणु0x3a, 0x04पूर्ण, अणु0x12, 0x01पूर्ण,
	अणु0x32, 0xb6पूर्ण, अणु0x03, 0x0aपूर्ण, अणु0x0c, 0x00पूर्ण, अणु0x3e, 0x00पूर्ण,
	अणु0x70, 0x3aपूर्ण, अणु0x71, 0x35पूर्ण, अणु0x72, 0x11पूर्ण, अणु0x73, 0xf0पूर्ण,
	अणु0xa2, 0x02पूर्ण, अणु0x13, 0xe0पूर्ण, अणु0x00, 0x00पूर्ण, अणु0x10, 0x00पूर्ण,
	अणु0x0d, 0x40पूर्ण, अणु0x14, 0x28पूर्ण, अणु0xa5, 0x05पूर्ण, अणु0xab, 0x07पूर्ण,
	अणु0x24, 0x95पूर्ण, अणु0x25, 0x33पूर्ण, अणु0x26, 0xe3पूर्ण, अणु0x9f, 0x75पूर्ण,
	अणु0xa0, 0x65पूर्ण, अणु0xa1, 0x0bपूर्ण, अणु0xa6, 0xd8पूर्ण, अणु0xa7, 0xd8पूर्ण,
	अणु0xa8, 0xf0पूर्ण, अणु0xa9, 0x90पूर्ण, अणु0xaa, 0x94पूर्ण, अणु0x13, 0xe5पूर्ण,
	अणु0x0e, 0x61पूर्ण, अणु0x0f, 0x4bपूर्ण, अणु0x16, 0x02पूर्ण, अणु0x1e, 0x27पूर्ण,
	अणु0x21, 0x02पूर्ण, अणु0x22, 0x91पूर्ण, अणु0x29, 0x07पूर्ण, अणु0x33, 0x0bपूर्ण,
	अणु0x35, 0x0bपूर्ण, अणु0x37, 0x1dपूर्ण, अणु0x38, 0x71पूर्ण, अणु0x39, 0x2aपूर्ण,
	अणु0x3c, 0x78पूर्ण, अणु0x4d, 0x40पूर्ण, अणु0x4e, 0x20पूर्ण, अणु0x69, 0x00पूर्ण,
	अणु0x74, 0x19पूर्ण, अणु0x8d, 0x4fपूर्ण, अणु0x8e, 0x00पूर्ण, अणु0x8f, 0x00पूर्ण,
	अणु0x90, 0x00पूर्ण, अणु0x91, 0x00पूर्ण, अणु0x96, 0x00पूर्ण, अणु0x9a, 0x80पूर्ण,
	अणु0xb0, 0x84पूर्ण, अणु0xb1, 0x0cपूर्ण, अणु0xb2, 0x0eपूर्ण, अणु0xb3, 0x82पूर्ण,
	अणु0xb8, 0x0aपूर्ण, अणु0x43, 0x0aपूर्ण, अणु0x44, 0xf0पूर्ण, अणु0x45, 0x20पूर्ण,
	अणु0x46, 0x7dपूर्ण, अणु0x47, 0x29पूर्ण, अणु0x48, 0x4aपूर्ण, अणु0x59, 0x8cपूर्ण,
	अणु0x5a, 0xa5पूर्ण, अणु0x5b, 0xdeपूर्ण, अणु0x5c, 0x96पूर्ण, अणु0x5d, 0x66पूर्ण,
	अणु0x5e, 0x10पूर्ण, अणु0x6c, 0x0aपूर्ण, अणु0x6d, 0x55पूर्ण, अणु0x6e, 0x11पूर्ण,
	अणु0x6f, 0x9eपूर्ण, अणु0x6a, 0x40पूर्ण, अणु0x01, 0x40पूर्ण, अणु0x02, 0x40पूर्ण,
	अणु0x13, 0xe7पूर्ण, अणु0x4f, 0x6eपूर्ण, अणु0x50, 0x70पूर्ण, अणु0x51, 0x02पूर्ण,
	अणु0x52, 0x1dपूर्ण, अणु0x53, 0x56पूर्ण, अणु0x54, 0x73पूर्ण, अणु0x55, 0x0aपूर्ण,
	अणु0x56, 0x55पूर्ण, अणु0x57, 0x80पूर्ण, अणु0x58, 0x9eपूर्ण, अणु0x41, 0x08पूर्ण,
	अणु0x3f, 0x02पूर्ण, अणु0x75, 0x03पूर्ण, अणु0x76, 0x63पूर्ण, अणु0x4c, 0x04पूर्ण,
	अणु0x77, 0x06पूर्ण, अणु0x3d, 0x02पूर्ण, अणु0x4b, 0x09पूर्ण, अणु0xc9, 0x30पूर्ण,
	अणु0x41, 0x08पूर्ण, अणु0x56, 0x48पूर्ण, अणु0x34, 0x11पूर्ण, अणु0xa4, 0x88पूर्ण,
	अणु0x96, 0x00पूर्ण, अणु0x97, 0x30पूर्ण, अणु0x98, 0x20पूर्ण, अणु0x99, 0x30पूर्ण,
	अणु0x9a, 0x84पूर्ण, अणु0x9b, 0x29पूर्ण, अणु0x9c, 0x03पूर्ण, अणु0x9d, 0x99पूर्ण,
	अणु0x9e, 0x7fपूर्ण, अणु0x78, 0x04पूर्ण, अणु0x79, 0x01पूर्ण, अणु0xc8, 0xf0पूर्ण,
	अणु0x79, 0x0fपूर्ण, अणु0xc8, 0x00पूर्ण, अणु0x79, 0x10पूर्ण, अणु0xc8, 0x7eपूर्ण,
	अणु0x79, 0x0aपूर्ण, अणु0xc8, 0x80पूर्ण, अणु0x79, 0x0bपूर्ण, अणु0xc8, 0x01पूर्ण,
	अणु0x79, 0x0cपूर्ण, अणु0xc8, 0x0fपूर्ण, अणु0x79, 0x0dपूर्ण, अणु0xc8, 0x20पूर्ण,
	अणु0x79, 0x09पूर्ण, अणु0xc8, 0x80पूर्ण, अणु0x79, 0x02पूर्ण, अणु0xc8, 0xc0पूर्ण,
	अणु0x79, 0x03पूर्ण, अणु0xc8, 0x40पूर्ण, अणु0x79, 0x05पूर्ण, अणु0xc8, 0x30पूर्ण,
	अणु0x79, 0x26पूर्ण, अणु0x62, 0x20पूर्ण, अणु0x63, 0x00पूर्ण, अणु0x64, 0x06पूर्ण,
	अणु0x65, 0x00पूर्ण, अणु0x66, 0x05पूर्ण, अणु0x94, 0x05पूर्ण, अणु0x95, 0x0aपूर्ण,
	अणु0x17, 0x13पूर्ण, अणु0x18, 0x01पूर्ण, अणु0x19, 0x02पूर्ण, अणु0x1a, 0x7aपूर्ण,
	अणु0x46, 0x59पूर्ण, अणु0x47, 0x30पूर्ण, अणु0x58, 0x9aपूर्ण, अणु0x59, 0x84पूर्ण,
	अणु0x5a, 0x91पूर्ण, अणु0x5b, 0x57पूर्ण, अणु0x5c, 0x75पूर्ण, अणु0x5d, 0x6dपूर्ण,
	अणु0x5e, 0x13पूर्ण, अणु0x64, 0x07पूर्ण, अणु0x94, 0x07पूर्ण, अणु0x95, 0x0dपूर्ण,
	अणु0xa6, 0xdfपूर्ण, अणु0xa7, 0xdfपूर्ण, अणु0x48, 0x4dपूर्ण, अणु0x51, 0x00पूर्ण,
	अणु0x6b, 0x0aपूर्ण, अणु0x11, 0x80पूर्ण, अणु0x2a, 0x00पूर्ण, अणु0x2b, 0x00पूर्ण,
	अणु0x92, 0x00पूर्ण, अणु0x93, 0x00पूर्ण, अणु0x55, 0x0aपूर्ण, अणु0x56, 0x60पूर्ण,
	अणु0x4f, 0x6eपूर्ण, अणु0x50, 0x70पूर्ण, अणु0x51, 0x00पूर्ण, अणु0x52, 0x1dपूर्ण,
	अणु0x53, 0x56पूर्ण, अणु0x54, 0x73पूर्ण, अणु0x58, 0x9aपूर्ण, अणु0x4f, 0x6eपूर्ण,
	अणु0x50, 0x70पूर्ण, अणु0x51, 0x00पूर्ण, अणु0x52, 0x1dपूर्ण, अणु0x53, 0x56पूर्ण,
	अणु0x54, 0x73पूर्ण, अणु0x58, 0x9aपूर्ण, अणु0x3f, 0x01पूर्ण, अणु0x7b, 0x03पूर्ण,
	अणु0x7c, 0x09पूर्ण, अणु0x7d, 0x16पूर्ण, अणु0x7e, 0x38पूर्ण, अणु0x7f, 0x47पूर्ण,
	अणु0x80, 0x53पूर्ण, अणु0x81, 0x5eपूर्ण, अणु0x82, 0x6aपूर्ण, अणु0x83, 0x74पूर्ण,
	अणु0x84, 0x80पूर्ण, अणु0x85, 0x8cपूर्ण, अणु0x86, 0x9bपूर्ण, अणु0x87, 0xb2पूर्ण,
	अणु0x88, 0xccपूर्ण, अणु0x89, 0xe5पूर्ण, अणु0x7a, 0x24पूर्ण, अणु0x3b, 0x00पूर्ण,
	अणु0x9f, 0x76पूर्ण, अणु0xa0, 0x65पूर्ण, अणु0x13, 0xe2पूर्ण, अणु0x6b, 0x0aपूर्ण,
	अणु0x11, 0x80पूर्ण, अणु0x2a, 0x00पूर्ण, अणु0x2b, 0x00पूर्ण, अणु0x92, 0x00पूर्ण,
	अणु0x93, 0x00पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u8 ov9650_init[] = अणु
	अणु0x00, 0x00पूर्ण, अणु0x01, 0x78पूर्ण,
	अणु0x02, 0x78पूर्ण, अणु0x03, 0x36पूर्ण, अणु0x04, 0x03पूर्ण,
	अणु0x05, 0x00पूर्ण, अणु0x06, 0x00पूर्ण, अणु0x08, 0x00पूर्ण,
	अणु0x09, 0x01पूर्ण, अणु0x0c, 0x00पूर्ण, अणु0x0d, 0x00पूर्ण,
	अणु0x0e, 0xa0पूर्ण, अणु0x0f, 0x52पूर्ण, अणु0x10, 0x7cपूर्ण,
	अणु0x11, 0x80पूर्ण, अणु0x12, 0x45पूर्ण, अणु0x13, 0xc2पूर्ण,
	अणु0x14, 0x2eपूर्ण, अणु0x15, 0x00पूर्ण, अणु0x16, 0x07पूर्ण,
	अणु0x17, 0x24पूर्ण, अणु0x18, 0xc5पूर्ण, अणु0x19, 0x00पूर्ण,
	अणु0x1a, 0x3cपूर्ण, अणु0x1b, 0x00पूर्ण, अणु0x1e, 0x04पूर्ण,
	अणु0x1f, 0x00पूर्ण, अणु0x24, 0x78पूर्ण, अणु0x25, 0x68पूर्ण,
	अणु0x26, 0xd4पूर्ण, अणु0x27, 0x80पूर्ण, अणु0x28, 0x80पूर्ण,
	अणु0x29, 0x30पूर्ण, अणु0x2a, 0x00पूर्ण, अणु0x2b, 0x00पूर्ण,
	अणु0x2c, 0x80पूर्ण, अणु0x2d, 0x00पूर्ण, अणु0x2e, 0x00पूर्ण,
	अणु0x2f, 0x00पूर्ण, अणु0x30, 0x08पूर्ण, अणु0x31, 0x30पूर्ण,
	अणु0x32, 0x84पूर्ण, अणु0x33, 0xe2पूर्ण, अणु0x34, 0xbfपूर्ण,
	अणु0x35, 0x81पूर्ण, अणु0x36, 0xf9पूर्ण, अणु0x37, 0x00पूर्ण,
	अणु0x38, 0x93पूर्ण, अणु0x39, 0x50पूर्ण, अणु0x3a, 0x01पूर्ण,
	अणु0x3b, 0x01पूर्ण, अणु0x3c, 0x73पूर्ण, अणु0x3d, 0x19पूर्ण,
	अणु0x3e, 0x0bपूर्ण, अणु0x3f, 0x80पूर्ण, अणु0x40, 0xc1पूर्ण,
	अणु0x41, 0x00पूर्ण, अणु0x42, 0x08पूर्ण, अणु0x67, 0x80पूर्ण,
	अणु0x68, 0x80पूर्ण, अणु0x69, 0x40पूर्ण, अणु0x6a, 0x00पूर्ण,
	अणु0x6b, 0x0aपूर्ण, अणु0x8b, 0x06पूर्ण, अणु0x8c, 0x20पूर्ण,
	अणु0x8d, 0x00पूर्ण, अणु0x8e, 0x00पूर्ण, अणु0x8f, 0xdfपूर्ण,
	अणु0x92, 0x00पूर्ण, अणु0x93, 0x00पूर्ण, अणु0x94, 0x88पूर्ण,
	अणु0x95, 0x88पूर्ण, अणु0x96, 0x04पूर्ण, अणु0xa1, 0x00पूर्ण,
	अणु0xa5, 0x80पूर्ण, अणु0xa8, 0x80पूर्ण, अणु0xa9, 0xb8पूर्ण,
	अणु0xaa, 0x92पूर्ण, अणु0xab, 0x0aपूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u8 ov9655_init[] = अणु
	अणु0x0e, 0x61पूर्ण, अणु0x11, 0x80पूर्ण, अणु0x13, 0xbaपूर्ण,
	अणु0x14, 0x2eपूर्ण, अणु0x16, 0x24पूर्ण, अणु0x1e, 0x04पूर्ण, अणु0x27, 0x08पूर्ण,
	अणु0x28, 0x08पूर्ण, अणु0x29, 0x15पूर्ण, अणु0x2c, 0x08पूर्ण, अणु0x34, 0x3dपूर्ण,
	अणु0x35, 0x00पूर्ण, अणु0x38, 0x12पूर्ण, अणु0x0f, 0x42पूर्ण, अणु0x39, 0x57पूर्ण,
	अणु0x3a, 0x00पूर्ण, अणु0x3b, 0xccपूर्ण, अणु0x3c, 0x0cपूर्ण, अणु0x3d, 0x19पूर्ण,
	अणु0x3e, 0x0cपूर्ण, अणु0x3f, 0x01पूर्ण, अणु0x41, 0x40पूर्ण, अणु0x42, 0x80पूर्ण,
	अणु0x45, 0x46पूर्ण, अणु0x46, 0x62पूर्ण, अणु0x47, 0x2aपूर्ण, अणु0x48, 0x3cपूर्ण,
	अणु0x4a, 0xf0पूर्ण, अणु0x4b, 0xdcपूर्ण, अणु0x4c, 0xdcपूर्ण, अणु0x4d, 0xdcपूर्ण,
	अणु0x4e, 0xdcपूर्ण, अणु0x6c, 0x04पूर्ण, अणु0x6f, 0x9eपूर्ण, अणु0x70, 0x05पूर्ण,
	अणु0x71, 0x78पूर्ण, अणु0x77, 0x02पूर्ण, अणु0x8a, 0x23पूर्ण, अणु0x90, 0x7eपूर्ण,
	अणु0x91, 0x7cपूर्ण, अणु0x9f, 0x6eपूर्ण, अणु0xa0, 0x6eपूर्ण, अणु0xa5, 0x68पूर्ण,
	अणु0xa6, 0x60पूर्ण, अणु0xa8, 0xc1पूर्ण, अणु0xa9, 0xfaपूर्ण, अणु0xaa, 0x92पूर्ण,
	अणु0xab, 0x04पूर्ण, अणु0xac, 0x80पूर्ण, अणु0xad, 0x80पूर्ण, अणु0xae, 0x80पूर्ण,
	अणु0xaf, 0x80पूर्ण, अणु0xb2, 0xf2पूर्ण, अणु0xb3, 0x20पूर्ण, अणु0xb5, 0x00पूर्ण,
	अणु0xb6, 0xafपूर्ण, अणु0xbb, 0xaeपूर्ण, अणु0xbc, 0x44पूर्ण, अणु0xbd, 0x44पूर्ण,
	अणु0xbe, 0x3bपूर्ण, अणु0xbf, 0x3aपूर्ण, अणु0xc1, 0xc8पूर्ण, अणु0xc2, 0x01पूर्ण,
	अणु0xc4, 0x00पूर्ण, अणु0xc6, 0x85पूर्ण, अणु0xc7, 0x81पूर्ण, अणु0xc9, 0xe0पूर्ण,
	अणु0xca, 0xe8पूर्ण, अणु0xcc, 0xd8पूर्ण, अणु0xcd, 0x93पूर्ण, अणु0x2d, 0x00पूर्ण,
	अणु0x2e, 0x00पूर्ण, अणु0x01, 0x80पूर्ण, अणु0x02, 0x80पूर्ण, अणु0x12, 0x61पूर्ण,
	अणु0x36, 0xfaपूर्ण, अणु0x8c, 0x8dपूर्ण, अणु0xc0, 0xaaपूर्ण, अणु0x69, 0x0aपूर्ण,
	अणु0x03, 0x09पूर्ण, अणु0x17, 0x16पूर्ण, अणु0x18, 0x6eपूर्ण, अणु0x19, 0x01पूर्ण,
	अणु0x1a, 0x3eपूर्ण, अणु0x32, 0x09पूर्ण, अणु0x2a, 0x10पूर्ण, अणु0x2b, 0x0aपूर्ण,
	अणु0x92, 0x00पूर्ण, अणु0x93, 0x00पूर्ण, अणु0xa1, 0x00पूर्ण, अणु0x10, 0x7cपूर्ण,
	अणु0x04, 0x03पूर्ण, अणु0x00, 0x13पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u16 mt9v112_init[] = अणु
	अणु0xf0, 0x0000पूर्ण, अणु0x0d, 0x0021पूर्ण, अणु0x0d, 0x0020पूर्ण,
	अणु0x34, 0xc019पूर्ण, अणु0x0a, 0x0011पूर्ण, अणु0x0b, 0x000bपूर्ण,
	अणु0x20, 0x0703पूर्ण, अणु0x35, 0x2022पूर्ण, अणु0xf0, 0x0001पूर्ण,
	अणु0x05, 0x0000पूर्ण, अणु0x06, 0x340cपूर्ण, अणु0x3b, 0x042aपूर्ण,
	अणु0x3c, 0x0400पूर्ण, अणु0xf0, 0x0002पूर्ण, अणु0x2e, 0x0c58पूर्ण,
	अणु0x5b, 0x0001पूर्ण, अणु0xc8, 0x9f0bपूर्ण, अणु0xf0, 0x0001पूर्ण,
	अणु0x9b, 0x5300पूर्ण, अणु0xf0, 0x0000पूर्ण, अणु0x2b, 0x0020पूर्ण,
	अणु0x2c, 0x002aपूर्ण, अणु0x2d, 0x0032पूर्ण, अणु0x2e, 0x0020पूर्ण,
	अणु0x09, 0x01dcपूर्ण, अणु0x01, 0x000cपूर्ण, अणु0x02, 0x0020पूर्ण,
	अणु0x03, 0x01e0पूर्ण, अणु0x04, 0x0280पूर्ण, अणु0x06, 0x000cपूर्ण,
	अणु0x05, 0x0098पूर्ण, अणु0x20, 0x0703पूर्ण, अणु0x09, 0x01f2पूर्ण,
	अणु0x2b, 0x00a0पूर्ण, अणु0x2c, 0x00a0पूर्ण, अणु0x2d, 0x00a0पूर्ण,
	अणु0x2e, 0x00a0पूर्ण, अणु0x01, 0x000cपूर्ण, अणु0x02, 0x0020पूर्ण,
	अणु0x03, 0x01e0पूर्ण, अणु0x04, 0x0280पूर्ण, अणु0x06, 0x000cपूर्ण,
	अणु0x05, 0x0098पूर्ण, अणु0x09, 0x01c1पूर्ण, अणु0x2b, 0x00aeपूर्ण,
	अणु0x2c, 0x00aeपूर्ण, अणु0x2d, 0x00aeपूर्ण, अणु0x2e, 0x00aeपूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u16 mt9v111_init[] = अणु
	अणु0x01, 0x0004पूर्ण, अणु0x0d, 0x0001पूर्ण, अणु0x0d, 0x0000पूर्ण,
	अणु0x01, 0x0001पूर्ण, अणु0x05, 0x0004पूर्ण, अणु0x2d, 0xe0a0पूर्ण,
	अणु0x2e, 0x0c64पूर्ण,	अणु0x2f, 0x0064पूर्ण, अणु0x06, 0x600eपूर्ण,
	अणु0x08, 0x0480पूर्ण, अणु0x01, 0x0004पूर्ण, अणु0x02, 0x0016पूर्ण,
	अणु0x03, 0x01e7पूर्ण, अणु0x04, 0x0287पूर्ण, अणु0x05, 0x0004पूर्ण,
	अणु0x06, 0x002dपूर्ण,	अणु0x07, 0x3002पूर्ण, अणु0x08, 0x0008पूर्ण,
	अणु0x0e, 0x0008पूर्ण, अणु0x20, 0x0000पूर्ण
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u16 mt9v011_init[] = अणु
	अणु0x07, 0x0002पूर्ण,	अणु0x0d, 0x0001पूर्ण,	अणु0x0d, 0x0000पूर्ण,
	अणु0x01, 0x0008पूर्ण,	अणु0x02, 0x0016पूर्ण,	अणु0x03, 0x01e1पूर्ण,
	अणु0x04, 0x0281पूर्ण,	अणु0x05, 0x0083पूर्ण,	अणु0x06, 0x0006पूर्ण,
	अणु0x0d, 0x0002पूर्ण, अणु0x0a, 0x0000पूर्ण,	अणु0x0b, 0x0000पूर्ण,
	अणु0x0c, 0x0000पूर्ण,	अणु0x0d, 0x0000पूर्ण,	अणु0x0e, 0x0000पूर्ण,
	अणु0x0f, 0x0000पूर्ण,	अणु0x10, 0x0000पूर्ण,	अणु0x11, 0x0000पूर्ण,
	अणु0x12, 0x0000पूर्ण,	अणु0x13, 0x0000पूर्ण,	अणु0x14, 0x0000पूर्ण,
	अणु0x15, 0x0000पूर्ण,	अणु0x16, 0x0000पूर्ण,	अणु0x17, 0x0000पूर्ण,
	अणु0x18, 0x0000पूर्ण,	अणु0x19, 0x0000पूर्ण,	अणु0x1a, 0x0000पूर्ण,
	अणु0x1b, 0x0000पूर्ण,	अणु0x1c, 0x0000पूर्ण,	अणु0x1d, 0x0000पूर्ण,
	अणु0x32, 0x0000पूर्ण,	अणु0x20, 0x1101पूर्ण,	अणु0x21, 0x0000पूर्ण,
	अणु0x22, 0x0000पूर्ण,	अणु0x23, 0x0000पूर्ण,	अणु0x24, 0x0000पूर्ण,
	अणु0x25, 0x0000पूर्ण,	अणु0x26, 0x0000पूर्ण,	अणु0x27, 0x0024पूर्ण,
	अणु0x2f, 0xf7b0पूर्ण,	अणु0x30, 0x0005पूर्ण,	अणु0x31, 0x0000पूर्ण,
	अणु0x32, 0x0000पूर्ण,	अणु0x33, 0x0000पूर्ण,	अणु0x34, 0x0100पूर्ण,
	अणु0x3d, 0x068fपूर्ण,	अणु0x40, 0x01e0पूर्ण,	अणु0x41, 0x00d1पूर्ण,
	अणु0x44, 0x0082पूर्ण,	अणु0x5a, 0x0000पूर्ण,	अणु0x5b, 0x0000पूर्ण,
	अणु0x5c, 0x0000पूर्ण,	अणु0x5d, 0x0000पूर्ण,	अणु0x5e, 0x0000पूर्ण,
	अणु0x5f, 0xa31dपूर्ण,	अणु0x62, 0x0611पूर्ण,	अणु0x0a, 0x0000पूर्ण,
	अणु0x06, 0x0029पूर्ण,	अणु0x05, 0x0009पूर्ण,	अणु0x20, 0x1101पूर्ण,
	अणु0x20, 0x1101पूर्ण,	अणु0x09, 0x0064पूर्ण,	अणु0x07, 0x0003पूर्ण,
	अणु0x2b, 0x0033पूर्ण,	अणु0x2c, 0x00a0पूर्ण,	अणु0x2d, 0x00a0पूर्ण,
	अणु0x2e, 0x0033पूर्ण,	अणु0x07, 0x0002पूर्ण,	अणु0x06, 0x0000पूर्ण,
	अणु0x06, 0x0029पूर्ण,	अणु0x05, 0x0009पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u16 mt9m001_init[] = अणु
	अणु0x0d, 0x0001पूर्ण,
	अणु0x0d, 0x0000पूर्ण,
	अणु0x04, 0x0500पूर्ण,		/* hres = 1280 */
	अणु0x03, 0x0400पूर्ण,		/* vres = 1024 */
	अणु0x20, 0x1100पूर्ण,
	अणु0x06, 0x0010पूर्ण,
	अणु0x2b, 0x0024पूर्ण,
	अणु0x2e, 0x0024पूर्ण,
	अणु0x35, 0x0024पूर्ण,
	अणु0x2d, 0x0020पूर्ण,
	अणु0x2c, 0x0020पूर्ण,
	अणु0x09, 0x0ad4पूर्ण,
	अणु0x35, 0x0057पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u16 mt9m111_init[] = अणु
	अणु0xf0, 0x0000पूर्ण, अणु0x0d, 0x0021पूर्ण, अणु0x0d, 0x0008पूर्ण,
	अणु0xf0, 0x0001पूर्ण, अणु0x3a, 0x4300पूर्ण, अणु0x9b, 0x4300पूर्ण,
	अणु0x06, 0x708eपूर्ण, अणु0xf0, 0x0002पूर्ण, अणु0x2e, 0x0a1eपूर्ण,
	अणु0xf0, 0x0000पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u16 mt9m112_init[] = अणु
	अणु0xf0, 0x0000पूर्ण, अणु0x0d, 0x0021पूर्ण, अणु0x0d, 0x0008पूर्ण,
	अणु0xf0, 0x0001पूर्ण, अणु0x3a, 0x4300पूर्ण, अणु0x9b, 0x4300पूर्ण,
	अणु0x06, 0x708eपूर्ण, अणु0xf0, 0x0002पूर्ण, अणु0x2e, 0x0a1eपूर्ण,
	अणु0xf0, 0x0000पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा i2c_reg_u8 hv7131r_init[] = अणु
	अणु0x02, 0x08पूर्ण, अणु0x02, 0x00पूर्ण, अणु0x01, 0x08पूर्ण,
	अणु0x02, 0x00पूर्ण, अणु0x20, 0x00पूर्ण, अणु0x21, 0xd0पूर्ण,
	अणु0x22, 0x00पूर्ण, अणु0x23, 0x09पूर्ण, अणु0x01, 0x08पूर्ण,
	अणु0x01, 0x08पूर्ण, अणु0x01, 0x08पूर्ण, अणु0x25, 0x07पूर्ण,
	अणु0x26, 0xc3पूर्ण, अणु0x27, 0x50पूर्ण, अणु0x30, 0x62पूर्ण,
	अणु0x31, 0x10पूर्ण, अणु0x32, 0x06पूर्ण, अणु0x33, 0x10पूर्ण,
	अणु0x20, 0x00पूर्ण, अणु0x21, 0xd0पूर्ण, अणु0x22, 0x00पूर्ण,
	अणु0x23, 0x09पूर्ण, अणु0x01, 0x08पूर्ण,
पूर्ण;

अटल व्योम reg_r(काष्ठा gspca_dev *gspca_dev, u16 reg, u16 length)
अणु
	काष्ठा usb_device *dev = gspca_dev->dev;
	पूर्णांक result;

	अगर (gspca_dev->usb_err < 0)
		वापस;
	result = usb_control_msg(dev, usb_rcvctrlpipe(dev, 0),
			0x00,
			USB_सूची_IN | USB_TYPE_VENDOR | USB_RECIP_INTERFACE,
			reg,
			0x00,
			gspca_dev->usb_buf,
			length,
			500);
	अगर (unlikely(result < 0 || result != length)) अणु
		pr_err("Read register %02x failed %d\n", reg, result);
		gspca_dev->usb_err = result;
		/*
		 * Make sure the buffer is zeroed to aव्योम uninitialized
		 * values.
		 */
		स_रखो(gspca_dev->usb_buf, 0, USB_BUF_SZ);
	पूर्ण
पूर्ण

अटल व्योम reg_w(काष्ठा gspca_dev *gspca_dev, u16 reg,
		 स्थिर u8 *buffer, पूर्णांक length)
अणु
	काष्ठा usb_device *dev = gspca_dev->dev;
	पूर्णांक result;

	अगर (gspca_dev->usb_err < 0)
		वापस;
	स_नकल(gspca_dev->usb_buf, buffer, length);
	result = usb_control_msg(dev, usb_sndctrlpipe(dev, 0),
			0x08,
			USB_सूची_OUT | USB_TYPE_VENDOR | USB_RECIP_INTERFACE,
			reg,
			0x00,
			gspca_dev->usb_buf,
			length,
			500);
	अगर (unlikely(result < 0 || result != length)) अणु
		pr_err("Write register %02x failed %d\n", reg, result);
		gspca_dev->usb_err = result;
	पूर्ण
पूर्ण

अटल व्योम reg_w1(काष्ठा gspca_dev *gspca_dev, u16 reg, स्थिर u8 value)
अणु
	reg_w(gspca_dev, reg, &value, 1);
पूर्ण

अटल व्योम i2c_w(काष्ठा gspca_dev *gspca_dev, स्थिर u8 *buffer)
अणु
	पूर्णांक i;

	reg_w(gspca_dev, 0x10c0, buffer, 8);
	क्रम (i = 0; i < 5; i++) अणु
		reg_r(gspca_dev, 0x10c0, 1);
		अगर (gspca_dev->usb_err < 0)
			वापस;
		अगर (gspca_dev->usb_buf[0] & 0x04) अणु
			अगर (gspca_dev->usb_buf[0] & 0x08) अणु
				pr_err("i2c_w error\n");
				gspca_dev->usb_err = -EIO;
			पूर्ण
			वापस;
		पूर्ण
		msleep(10);
	पूर्ण
	pr_err("i2c_w reg %02x no response\n", buffer[2]);
/*	gspca_dev->usb_err = -EIO;	fixme: may occur */
पूर्ण

अटल व्योम i2c_w1(काष्ठा gspca_dev *gspca_dev, u8 reg, u8 val)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u8 row[8];

	/*
	 * from the poपूर्णांक of view of the bridge, the length
	 * includes the address
	 */
	row[0] = sd->i2c_पूर्णांकf | (2 << 4);
	row[1] = sd->i2c_addr;
	row[2] = reg;
	row[3] = val;
	row[4] = 0x00;
	row[5] = 0x00;
	row[6] = 0x00;
	row[7] = 0x10;

	i2c_w(gspca_dev, row);
पूर्ण

अटल व्योम i2c_w1_buf(काष्ठा gspca_dev *gspca_dev,
			स्थिर काष्ठा i2c_reg_u8 *buf, पूर्णांक sz)
अणु
	जबतक (--sz >= 0) अणु
		i2c_w1(gspca_dev, buf->reg, buf->val);
		buf++;
	पूर्ण
पूर्ण

अटल व्योम i2c_w2(काष्ठा gspca_dev *gspca_dev, u8 reg, u16 val)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u8 row[8];

	/*
	 * from the poपूर्णांक of view of the bridge, the length
	 * includes the address
	 */
	row[0] = sd->i2c_पूर्णांकf | (3 << 4);
	row[1] = sd->i2c_addr;
	row[2] = reg;
	row[3] = val >> 8;
	row[4] = val;
	row[5] = 0x00;
	row[6] = 0x00;
	row[7] = 0x10;

	i2c_w(gspca_dev, row);
पूर्ण

अटल व्योम i2c_w2_buf(काष्ठा gspca_dev *gspca_dev,
			स्थिर काष्ठा i2c_reg_u16 *buf, पूर्णांक sz)
अणु
	जबतक (--sz >= 0) अणु
		i2c_w2(gspca_dev, buf->reg, buf->val);
		buf++;
	पूर्ण
पूर्ण

अटल व्योम i2c_r1(काष्ठा gspca_dev *gspca_dev, u8 reg, u8 *val)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u8 row[8];

	row[0] = sd->i2c_पूर्णांकf | (1 << 4);
	row[1] = sd->i2c_addr;
	row[2] = reg;
	row[3] = 0;
	row[4] = 0;
	row[5] = 0;
	row[6] = 0;
	row[7] = 0x10;
	i2c_w(gspca_dev, row);
	row[0] = sd->i2c_पूर्णांकf | (1 << 4) | 0x02;
	row[2] = 0;
	i2c_w(gspca_dev, row);
	reg_r(gspca_dev, 0x10c2, 5);
	*val = gspca_dev->usb_buf[4];
पूर्ण

अटल व्योम i2c_r2(काष्ठा gspca_dev *gspca_dev, u8 reg, u16 *val)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u8 row[8];

	row[0] = sd->i2c_पूर्णांकf | (1 << 4);
	row[1] = sd->i2c_addr;
	row[2] = reg;
	row[3] = 0;
	row[4] = 0;
	row[5] = 0;
	row[6] = 0;
	row[7] = 0x10;
	i2c_w(gspca_dev, row);
	row[0] = sd->i2c_पूर्णांकf | (2 << 4) | 0x02;
	row[2] = 0;
	i2c_w(gspca_dev, row);
	reg_r(gspca_dev, 0x10c2, 5);
	*val = (gspca_dev->usb_buf[3] << 8) | gspca_dev->usb_buf[4];
पूर्ण

अटल व्योम ov9650_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	u16 id;
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_r2(gspca_dev, 0x1c, &id);
	अगर (gspca_dev->usb_err < 0)
		वापस;

	अगर (id != 0x7fa2) अणु
		pr_err("sensor id for ov9650 doesn't match (0x%04x)\n", id);
		gspca_dev->usb_err = -ENODEV;
		वापस;
	पूर्ण

	i2c_w1(gspca_dev, 0x12, 0x80);		/* sensor reset */
	msleep(200);
	i2c_w1_buf(gspca_dev, ov9650_init, ARRAY_SIZE(ov9650_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("OV9650 sensor initialization failed\n");
	sd->hstart = 1;
	sd->vstart = 7;
पूर्ण

अटल व्योम ov9655_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_w1(gspca_dev, 0x12, 0x80);		/* sensor reset */
	msleep(200);
	i2c_w1_buf(gspca_dev, ov9655_init, ARRAY_SIZE(ov9655_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("OV9655 sensor initialization failed\n");

	sd->hstart = 1;
	sd->vstart = 2;
पूर्ण

अटल व्योम soi968_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_w1(gspca_dev, 0x12, 0x80);		/* sensor reset */
	msleep(200);
	i2c_w1_buf(gspca_dev, soi968_init, ARRAY_SIZE(soi968_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("SOI968 sensor initialization failed\n");

	sd->hstart = 60;
	sd->vstart = 11;
पूर्ण

अटल व्योम ov7660_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_w1(gspca_dev, 0x12, 0x80);		/* sensor reset */
	msleep(200);
	i2c_w1_buf(gspca_dev, ov7660_init, ARRAY_SIZE(ov7660_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("OV7660 sensor initialization failed\n");
	sd->hstart = 3;
	sd->vstart = 3;
पूर्ण

अटल व्योम ov7670_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_w1(gspca_dev, 0x12, 0x80);		/* sensor reset */
	msleep(200);
	i2c_w1_buf(gspca_dev, ov7670_init, ARRAY_SIZE(ov7670_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("OV7670 sensor initialization failed\n");

	sd->hstart = 0;
	sd->vstart = 1;
पूर्ण

अटल व्योम mt9v_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u16 value;

	sd->i2c_addr = 0x5d;
	i2c_r2(gspca_dev, 0xff, &value);
	अगर (gspca_dev->usb_err >= 0
	 && value == 0x8243) अणु
		i2c_w2_buf(gspca_dev, mt9v011_init, ARRAY_SIZE(mt9v011_init));
		अगर (gspca_dev->usb_err < 0) अणु
			pr_err("MT9V011 sensor initialization failed\n");
			वापस;
		पूर्ण
		sd->hstart = 2;
		sd->vstart = 2;
		sd->sensor = SENSOR_MT9V011;
		pr_info("MT9V011 sensor detected\n");
		वापस;
	पूर्ण

	gspca_dev->usb_err = 0;
	sd->i2c_addr = 0x5c;
	i2c_w2(gspca_dev, 0x01, 0x0004);
	i2c_r2(gspca_dev, 0xff, &value);
	अगर (gspca_dev->usb_err >= 0
	 && value == 0x823a) अणु
		i2c_w2_buf(gspca_dev, mt9v111_init, ARRAY_SIZE(mt9v111_init));
		अगर (gspca_dev->usb_err < 0) अणु
			pr_err("MT9V111 sensor initialization failed\n");
			वापस;
		पूर्ण
		sd->hstart = 2;
		sd->vstart = 2;
		sd->sensor = SENSOR_MT9V111;
		pr_info("MT9V111 sensor detected\n");
		वापस;
	पूर्ण

	gspca_dev->usb_err = 0;
	sd->i2c_addr = 0x5d;
	i2c_w2(gspca_dev, 0xf0, 0x0000);
	अगर (gspca_dev->usb_err < 0) अणु
		gspca_dev->usb_err = 0;
		sd->i2c_addr = 0x48;
		i2c_w2(gspca_dev, 0xf0, 0x0000);
	पूर्ण
	i2c_r2(gspca_dev, 0x00, &value);
	अगर (gspca_dev->usb_err >= 0
	 && value == 0x1229) अणु
		i2c_w2_buf(gspca_dev, mt9v112_init, ARRAY_SIZE(mt9v112_init));
		अगर (gspca_dev->usb_err < 0) अणु
			pr_err("MT9V112 sensor initialization failed\n");
			वापस;
		पूर्ण
		sd->hstart = 6;
		sd->vstart = 2;
		sd->sensor = SENSOR_MT9V112;
		pr_info("MT9V112 sensor detected\n");
		वापस;
	पूर्ण

	gspca_dev->usb_err = -ENODEV;
पूर्ण

अटल व्योम mt9m112_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_w2_buf(gspca_dev, mt9m112_init, ARRAY_SIZE(mt9m112_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("MT9M112 sensor initialization failed\n");

	sd->hstart = 0;
	sd->vstart = 2;
पूर्ण

अटल व्योम mt9m111_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_w2_buf(gspca_dev, mt9m111_init, ARRAY_SIZE(mt9m111_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("MT9M111 sensor initialization failed\n");

	sd->hstart = 0;
	sd->vstart = 2;
पूर्ण

अटल व्योम mt9m001_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u16 id;

	i2c_r2(gspca_dev, 0x00, &id);
	अगर (gspca_dev->usb_err < 0)
		वापस;

	/* must be 0x8411 or 0x8421 क्रम colour sensor and 8431 क्रम bw */
	चयन (id) अणु
	हाल 0x8411:
	हाल 0x8421:
		pr_info("MT9M001 color sensor detected\n");
		अवरोध;
	हाल 0x8431:
		pr_info("MT9M001 mono sensor detected\n");
		अवरोध;
	शेष:
		pr_err("No MT9M001 chip detected, ID = %x\n\n", id);
		gspca_dev->usb_err = -ENODEV;
		वापस;
	पूर्ण

	i2c_w2_buf(gspca_dev, mt9m001_init, ARRAY_SIZE(mt9m001_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("MT9M001 sensor initialization failed\n");

	sd->hstart = 1;
	sd->vstart = 1;
पूर्ण

अटल व्योम hv7131r_init_sensor(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	i2c_w1_buf(gspca_dev, hv7131r_init, ARRAY_SIZE(hv7131r_init));
	अगर (gspca_dev->usb_err < 0)
		pr_err("HV7131R Sensor initialization failed\n");

	sd->hstart = 0;
	sd->vstart = 1;
पूर्ण

अटल व्योम set_cmatrix(काष्ठा gspca_dev *gspca_dev,
		s32 brightness, s32 contrast, s32 satur, s32 hue)
अणु
	s32 hue_coord, hue_index = 180 + hue;
	u8 cmatrix[21];

	स_रखो(cmatrix, 0, माप(cmatrix));
	cmatrix[2] = (contrast * 0x25 / 0x100) + 0x26;
	cmatrix[0] = 0x13 + (cmatrix[2] - 0x26) * 0x13 / 0x25;
	cmatrix[4] = 0x07 + (cmatrix[2] - 0x26) * 0x07 / 0x25;
	cmatrix[18] = brightness - 0x80;

	hue_coord = (hsv_red_x[hue_index] * satur) >> 8;
	cmatrix[6] = hue_coord;
	cmatrix[7] = (hue_coord >> 8) & 0x0f;

	hue_coord = (hsv_red_y[hue_index] * satur) >> 8;
	cmatrix[8] = hue_coord;
	cmatrix[9] = (hue_coord >> 8) & 0x0f;

	hue_coord = (hsv_green_x[hue_index] * satur) >> 8;
	cmatrix[10] = hue_coord;
	cmatrix[11] = (hue_coord >> 8) & 0x0f;

	hue_coord = (hsv_green_y[hue_index] * satur) >> 8;
	cmatrix[12] = hue_coord;
	cmatrix[13] = (hue_coord >> 8) & 0x0f;

	hue_coord = (hsv_blue_x[hue_index] * satur) >> 8;
	cmatrix[14] = hue_coord;
	cmatrix[15] = (hue_coord >> 8) & 0x0f;

	hue_coord = (hsv_blue_y[hue_index] * satur) >> 8;
	cmatrix[16] = hue_coord;
	cmatrix[17] = (hue_coord >> 8) & 0x0f;

	reg_w(gspca_dev, 0x10e1, cmatrix, 21);
पूर्ण

अटल व्योम set_gamma(काष्ठा gspca_dev *gspca_dev, s32 val)
अणु
	u8 gamma[17];
	u8 gval = val * 0xb8 / 0x100;

	gamma[0] = 0x0a;
	gamma[1] = 0x13 + (gval * (0xcb - 0x13) / 0xb8);
	gamma[2] = 0x25 + (gval * (0xee - 0x25) / 0xb8);
	gamma[3] = 0x37 + (gval * (0xfa - 0x37) / 0xb8);
	gamma[4] = 0x45 + (gval * (0xfc - 0x45) / 0xb8);
	gamma[5] = 0x55 + (gval * (0xfb - 0x55) / 0xb8);
	gamma[6] = 0x65 + (gval * (0xfc - 0x65) / 0xb8);
	gamma[7] = 0x74 + (gval * (0xfd - 0x74) / 0xb8);
	gamma[8] = 0x83 + (gval * (0xfe - 0x83) / 0xb8);
	gamma[9] = 0x92 + (gval * (0xfc - 0x92) / 0xb8);
	gamma[10] = 0xa1 + (gval * (0xfc - 0xa1) / 0xb8);
	gamma[11] = 0xb0 + (gval * (0xfc - 0xb0) / 0xb8);
	gamma[12] = 0xbf + (gval * (0xfb - 0xbf) / 0xb8);
	gamma[13] = 0xce + (gval * (0xfb - 0xce) / 0xb8);
	gamma[14] = 0xdf + (gval * (0xfd - 0xdf) / 0xb8);
	gamma[15] = 0xea + (gval * (0xf9 - 0xea) / 0xb8);
	gamma[16] = 0xf5;

	reg_w(gspca_dev, 0x1190, gamma, 17);
पूर्ण

अटल व्योम set_redblue(काष्ठा gspca_dev *gspca_dev, s32 blue, s32 red)
अणु
	reg_w1(gspca_dev, 0x118c, red);
	reg_w1(gspca_dev, 0x118f, blue);
पूर्ण

अटल व्योम set_hvflip(काष्ठा gspca_dev *gspca_dev, s32 hflip, s32 vflip)
अणु
	u8 value, tslb;
	u16 value2;
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	अगर ((sd->flags & FLIP_DETECT) && dmi_check_प्रणाली(flip_dmi_table)) अणु
		hflip = !hflip;
		vflip = !vflip;
	पूर्ण

	चयन (sd->sensor) अणु
	हाल SENSOR_OV7660:
		value = 0x01;
		अगर (hflip)
			value |= 0x20;
		अगर (vflip) अणु
			value |= 0x10;
			sd->vstart = 2;
		पूर्ण अन्यथा अणु
			sd->vstart = 3;
		पूर्ण
		reg_w1(gspca_dev, 0x1182, sd->vstart);
		i2c_w1(gspca_dev, 0x1e, value);
		अवरोध;
	हाल SENSOR_OV9650:
		i2c_r1(gspca_dev, 0x1e, &value);
		value &= ~0x30;
		tslb = 0x01;
		अगर (hflip)
			value |= 0x20;
		अगर (vflip) अणु
			value |= 0x10;
			tslb = 0x49;
		पूर्ण
		i2c_w1(gspca_dev, 0x1e, value);
		i2c_w1(gspca_dev, 0x3a, tslb);
		अवरोध;
	हाल SENSOR_MT9V111:
	हाल SENSOR_MT9V011:
		i2c_r2(gspca_dev, 0x20, &value2);
		value2 &= ~0xc0a0;
		अगर (hflip)
			value2 |= 0x8080;
		अगर (vflip)
			value2 |= 0x4020;
		i2c_w2(gspca_dev, 0x20, value2);
		अवरोध;
	हाल SENSOR_MT9M112:
	हाल SENSOR_MT9M111:
	हाल SENSOR_MT9V112:
		i2c_r2(gspca_dev, 0x20, &value2);
		value2 &= ~0x0003;
		अगर (hflip)
			value2 |= 0x0002;
		अगर (vflip)
			value2 |= 0x0001;
		i2c_w2(gspca_dev, 0x20, value2);
		अवरोध;
	हाल SENSOR_HV7131R:
		i2c_r1(gspca_dev, 0x01, &value);
		value &= ~0x03;
		अगर (vflip)
			value |= 0x01;
		अगर (hflip)
			value |= 0x02;
		i2c_w1(gspca_dev, 0x01, value);
		अवरोध;
	पूर्ण
पूर्ण

अटल व्योम set_exposure(काष्ठा gspca_dev *gspca_dev, s32 expo)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u8 exp[8] = अणुsd->i2c_पूर्णांकf, sd->i2c_addr,
				0x00, 0x00, 0x00, 0x00, 0x00, 0x10पूर्ण;
	पूर्णांक expo2;

	अगर (gspca_dev->streaming)
		exp[7] = 0x1e;

	चयन (sd->sensor) अणु
	हाल SENSOR_OV7660:
	हाल SENSOR_OV7670:
	हाल SENSOR_OV9655:
	हाल SENSOR_OV9650:
		अगर (expo > 547)
			expo2 = 547;
		अन्यथा
			expo2 = expo;
		exp[0] |= (2 << 4);
		exp[2] = 0x10;			/* AECH */
		exp[3] = expo2 >> 2;
		exp[7] = 0x10;
		i2c_w(gspca_dev, exp);
		exp[2] = 0x04;			/* COM1 */
		exp[3] = expo2 & 0x0003;
		exp[7] = 0x10;
		i2c_w(gspca_dev, exp);
		expo -= expo2;
		exp[7] = 0x1e;
		exp[0] |= (3 << 4);
		exp[2] = 0x2d;			/* ADVFL & ADVFH */
		exp[3] = expo;
		exp[4] = expo >> 8;
		अवरोध;
	हाल SENSOR_MT9M001:
	हाल SENSOR_MT9V112:
	हाल SENSOR_MT9V011:
		exp[0] |= (3 << 4);
		exp[2] = 0x09;
		exp[3] = expo >> 8;
		exp[4] = expo;
		अवरोध;
	हाल SENSOR_HV7131R:
		exp[0] |= (4 << 4);
		exp[2] = 0x25;
		exp[3] = expo >> 5;
		exp[4] = expo << 3;
		exp[5] = 0;
		अवरोध;
	शेष:
		वापस;
	पूर्ण
	i2c_w(gspca_dev, exp);
पूर्ण

अटल व्योम set_gain(काष्ठा gspca_dev *gspca_dev, s32 g)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u8 gain[8] = अणुsd->i2c_पूर्णांकf, sd->i2c_addr,
				0x00, 0x00, 0x00, 0x00, 0x00, 0x10पूर्ण;

	अगर (gspca_dev->streaming)
		gain[7] = 0x15;		/* or 1d ? */

	चयन (sd->sensor) अणु
	हाल SENSOR_OV7660:
	हाल SENSOR_OV7670:
	हाल SENSOR_SOI968:
	हाल SENSOR_OV9655:
	हाल SENSOR_OV9650:
		gain[0] |= (2 << 4);
		gain[3] = ov_gain[g];
		अवरोध;
	हाल SENSOR_MT9V011:
		gain[0] |= (3 << 4);
		gain[2] = 0x35;
		gain[3] = micron1_gain[g] >> 8;
		gain[4] = micron1_gain[g];
		अवरोध;
	हाल SENSOR_MT9V112:
		gain[0] |= (3 << 4);
		gain[2] = 0x2f;
		gain[3] = micron1_gain[g] >> 8;
		gain[4] = micron1_gain[g];
		अवरोध;
	हाल SENSOR_MT9M001:
		gain[0] |= (3 << 4);
		gain[2] = 0x2f;
		gain[3] = micron2_gain[g] >> 8;
		gain[4] = micron2_gain[g];
		अवरोध;
	हाल SENSOR_HV7131R:
		gain[0] |= (2 << 4);
		gain[2] = 0x30;
		gain[3] = hv7131r_gain[g];
		अवरोध;
	शेष:
		वापस;
	पूर्ण
	i2c_w(gspca_dev, gain);
पूर्ण

अटल व्योम set_quality(काष्ठा gspca_dev *gspca_dev, s32 val)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	jpeg_set_qual(sd->jpeg_hdr, val);
	reg_w1(gspca_dev, 0x1061, 0x01);	/* stop transfer */
	reg_w1(gspca_dev, 0x10e0, sd->fmt | 0x20); /* ग_लिखो QTAB */
	reg_w(gspca_dev, 0x1100, &sd->jpeg_hdr[JPEG_QT0_OFFSET], 64);
	reg_w(gspca_dev, 0x1140, &sd->jpeg_hdr[JPEG_QT1_OFFSET], 64);
	reg_w1(gspca_dev, 0x1061, 0x03);	/* restart transfer */
	reg_w1(gspca_dev, 0x10e0, sd->fmt);
	sd->fmt ^= 0x0c;			/* invert QTAB use + ग_लिखो */
	reg_w1(gspca_dev, 0x10e0, sd->fmt);
पूर्ण

#अगर_घोषित CONFIG_VIDEO_ADV_DEBUG
अटल पूर्णांक sd_dbg_g_रेजिस्टर(काष्ठा gspca_dev *gspca_dev,
			काष्ठा v4l2_dbg_रेजिस्टर *reg)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	reg->size = 1;
	चयन (reg->match.addr) अणु
	हाल 0:
		अगर (reg->reg < 0x1000 || reg->reg > 0x11ff)
			वापस -EINVAL;
		reg_r(gspca_dev, reg->reg, 1);
		reg->val = gspca_dev->usb_buf[0];
		वापस gspca_dev->usb_err;
	हाल 1:
		अगर (sd->sensor >= SENSOR_MT9V011 &&
		    sd->sensor <= SENSOR_MT9M112) अणु
			i2c_r2(gspca_dev, reg->reg, (u16 *) &reg->val);
			reg->size = 2;
		पूर्ण अन्यथा अणु
			i2c_r1(gspca_dev, reg->reg, (u8 *) &reg->val);
		पूर्ण
		वापस gspca_dev->usb_err;
	पूर्ण
	वापस -EINVAL;
पूर्ण

अटल पूर्णांक sd_dbg_s_रेजिस्टर(काष्ठा gspca_dev *gspca_dev,
			स्थिर काष्ठा v4l2_dbg_रेजिस्टर *reg)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	चयन (reg->match.addr) अणु
	हाल 0:
		अगर (reg->reg < 0x1000 || reg->reg > 0x11ff)
			वापस -EINVAL;
		reg_w1(gspca_dev, reg->reg, reg->val);
		वापस gspca_dev->usb_err;
	हाल 1:
		अगर (sd->sensor >= SENSOR_MT9V011 &&
		    sd->sensor <= SENSOR_MT9M112) अणु
			i2c_w2(gspca_dev, reg->reg, reg->val);
		पूर्ण अन्यथा अणु
			i2c_w1(gspca_dev, reg->reg, reg->val);
		पूर्ण
		वापस gspca_dev->usb_err;
	पूर्ण
	वापस -EINVAL;
पूर्ण

अटल पूर्णांक sd_chip_info(काष्ठा gspca_dev *gspca_dev,
			काष्ठा v4l2_dbg_chip_info *chip)
अणु
	अगर (chip->match.addr > 1)
		वापस -EINVAL;
	अगर (chip->match.addr == 1)
		strscpy(chip->name, "sensor", माप(chip->name));
	वापस 0;
पूर्ण
#पूर्ण_अगर

अटल पूर्णांक sd_config(काष्ठा gspca_dev *gspca_dev,
			स्थिर काष्ठा usb_device_id *id)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	काष्ठा cam *cam;

	cam = &gspca_dev->cam;
	cam->needs_full_bandwidth = 1;

	sd->sensor = id->driver_info >> 8;
	sd->i2c_addr = id->driver_info;
	sd->flags = id->driver_info >> 16;
	sd->i2c_पूर्णांकf = 0x80;			/* i2c 100 Kb/s */

	चयन (sd->sensor) अणु
	हाल SENSOR_MT9M112:
	हाल SENSOR_MT9M111:
	हाल SENSOR_OV9650:
	हाल SENSOR_SOI968:
		cam->cam_mode = sxga_mode;
		cam->nmodes = ARRAY_SIZE(sxga_mode);
		अवरोध;
	हाल SENSOR_MT9M001:
		cam->cam_mode = mono_mode;
		cam->nmodes = ARRAY_SIZE(mono_mode);
		अवरोध;
	हाल SENSOR_HV7131R:
		sd->i2c_पूर्णांकf = 0x81;			/* i2c 400 Kb/s */
		fallthrough;
	शेष:
		cam->cam_mode = vga_mode;
		cam->nmodes = ARRAY_SIZE(vga_mode);
		अवरोध;
	पूर्ण

	sd->old_step = 0;
	sd->older_step = 0;
	sd->exposure_step = 16;

	INIT_WORK(&sd->work, qual_upd);

	वापस 0;
पूर्ण

अटल पूर्णांक sd_s_ctrl(काष्ठा v4l2_ctrl *ctrl)
अणु
	काष्ठा gspca_dev *gspca_dev =
		container_of(ctrl->handler, काष्ठा gspca_dev, ctrl_handler);
	काष्ठा sd *sd = (काष्ठा sd *)gspca_dev;

	gspca_dev->usb_err = 0;

	अगर (!gspca_dev->streaming)
		वापस 0;

	चयन (ctrl->id) अणु
	/* color control cluster */
	हाल V4L2_CID_BRIGHTNESS:
		set_cmatrix(gspca_dev, sd->brightness->val,
			sd->contrast->val, sd->saturation->val, sd->hue->val);
		अवरोध;
	हाल V4L2_CID_GAMMA:
		set_gamma(gspca_dev, ctrl->val);
		अवरोध;
	/* blue/red balance cluster */
	हाल V4L2_CID_BLUE_BALANCE:
		set_redblue(gspca_dev, sd->blue->val, sd->red->val);
		अवरोध;
	/* h/vflip cluster */
	हाल V4L2_CID_HFLIP:
		set_hvflip(gspca_dev, sd->hflip->val, sd->vflip->val);
		अवरोध;
	/* standalone exposure control */
	हाल V4L2_CID_EXPOSURE:
		set_exposure(gspca_dev, ctrl->val);
		अवरोध;
	/* standalone gain control */
	हाल V4L2_CID_GAIN:
		set_gain(gspca_dev, ctrl->val);
		अवरोध;
	/* स्वतःgain + exposure or gain control cluster */
	हाल V4L2_CID_AUTOGAIN:
		अगर (sd->sensor == SENSOR_SOI968)
			set_gain(gspca_dev, sd->gain->val);
		अन्यथा
			set_exposure(gspca_dev, sd->exposure->val);
		अवरोध;
	हाल V4L2_CID_JPEG_COMPRESSION_QUALITY:
		set_quality(gspca_dev, ctrl->val);
		अवरोध;
	पूर्ण
	वापस gspca_dev->usb_err;
पूर्ण

अटल स्थिर काष्ठा v4l2_ctrl_ops sd_ctrl_ops = अणु
	.s_ctrl = sd_s_ctrl,
पूर्ण;

अटल पूर्णांक sd_init_controls(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	काष्ठा v4l2_ctrl_handler *hdl = &gspca_dev->ctrl_handler;

	gspca_dev->vdev.ctrl_handler = hdl;
	v4l2_ctrl_handler_init(hdl, 13);

	sd->brightness = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_BRIGHTNESS, 0, 255, 1, 127);
	sd->contrast = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_CONTRAST, 0, 255, 1, 127);
	sd->saturation = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_SATURATION, 0, 255, 1, 127);
	sd->hue = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_HUE, -180, 180, 1, 0);

	sd->gamma = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_GAMMA, 0, 255, 1, 0x10);

	sd->blue = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_BLUE_BALANCE, 0, 127, 1, 0x28);
	sd->red = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_RED_BALANCE, 0, 127, 1, 0x28);

	अगर (sd->sensor != SENSOR_OV9655 && sd->sensor != SENSOR_SOI968 &&
	    sd->sensor != SENSOR_OV7670 && sd->sensor != SENSOR_MT9M001 &&
	    sd->sensor != SENSOR_MT9VPRB) अणु
		sd->hflip = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_HFLIP, 0, 1, 1, 0);
		sd->vflip = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_VFLIP, 0, 1, 1, 0);
	पूर्ण

	अगर (sd->sensor != SENSOR_SOI968 && sd->sensor != SENSOR_MT9VPRB &&
	    sd->sensor != SENSOR_MT9M112 && sd->sensor != SENSOR_MT9M111 &&
	    sd->sensor != SENSOR_MT9V111)
		sd->exposure = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_EXPOSURE, 0, 0x1780, 1, 0x33);

	अगर (sd->sensor != SENSOR_MT9VPRB && sd->sensor != SENSOR_MT9M112 &&
	    sd->sensor != SENSOR_MT9M111 && sd->sensor != SENSOR_MT9V111) अणु
		sd->gain = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_GAIN, 0, 28, 1, 0);
		sd->स्वतःgain = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_AUTOGAIN, 0, 1, 1, 1);
	पूर्ण

	sd->jpegqual = v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_JPEG_COMPRESSION_QUALITY, 50, 90, 1, 80);
	अगर (hdl->error) अणु
		pr_err("Could not initialize controls\n");
		वापस hdl->error;
	पूर्ण

	v4l2_ctrl_cluster(4, &sd->brightness);
	v4l2_ctrl_cluster(2, &sd->blue);
	अगर (sd->hflip)
		v4l2_ctrl_cluster(2, &sd->hflip);
	अगर (sd->स्वतःgain) अणु
		अगर (sd->sensor == SENSOR_SOI968)
			/* this sensor करोesn't have the exposure control and
			   स्वतःgain is clustered with gain instead. This works
			   because sd->exposure == शून्य. */
			v4l2_ctrl_स्वतः_cluster(3, &sd->स्वतःgain, 0, false);
		अन्यथा
			/* Otherwise स्वतःgain is clustered with exposure. */
			v4l2_ctrl_स्वतः_cluster(2, &sd->स्वतःgain, 0, false);
	पूर्ण
	वापस 0;
पूर्ण

अटल पूर्णांक sd_init(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	पूर्णांक i;
	u8 value;
	u8 i2c_init[9] = अणु
		0x80, sd->i2c_addr, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x03
	पूर्ण;

	क्रम (i = 0; i < ARRAY_SIZE(bridge_init); i++) अणु
		value = bridge_init[i][1];
		reg_w(gspca_dev, bridge_init[i][0], &value, 1);
		अगर (gspca_dev->usb_err < 0) अणु
			pr_err("Device initialization failed\n");
			वापस gspca_dev->usb_err;
		पूर्ण
	पूर्ण

	अगर (sd->flags & LED_REVERSE)
		reg_w1(gspca_dev, 0x1006, 0x00);
	अन्यथा
		reg_w1(gspca_dev, 0x1006, 0x20);

	reg_w(gspca_dev, 0x10c0, i2c_init, 9);
	अगर (gspca_dev->usb_err < 0) अणु
		pr_err("Device initialization failed\n");
		वापस gspca_dev->usb_err;
	पूर्ण

	चयन (sd->sensor) अणु
	हाल SENSOR_OV9650:
		ov9650_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("OV9650 sensor detected\n");
		अवरोध;
	हाल SENSOR_OV9655:
		ov9655_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("OV9655 sensor detected\n");
		अवरोध;
	हाल SENSOR_SOI968:
		soi968_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("SOI968 sensor detected\n");
		अवरोध;
	हाल SENSOR_OV7660:
		ov7660_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("OV7660 sensor detected\n");
		अवरोध;
	हाल SENSOR_OV7670:
		ov7670_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("OV7670 sensor detected\n");
		अवरोध;
	हाल SENSOR_MT9VPRB:
		mt9v_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("MT9VPRB sensor detected\n");
		अवरोध;
	हाल SENSOR_MT9M111:
		mt9m111_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("MT9M111 sensor detected\n");
		अवरोध;
	हाल SENSOR_MT9M112:
		mt9m112_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("MT9M112 sensor detected\n");
		अवरोध;
	हाल SENSOR_MT9M001:
		mt9m001_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		अवरोध;
	हाल SENSOR_HV7131R:
		hv7131r_init_sensor(gspca_dev);
		अगर (gspca_dev->usb_err < 0)
			अवरोध;
		pr_info("HV7131R sensor detected\n");
		अवरोध;
	शेष:
		pr_err("Unsupported sensor\n");
		gspca_dev->usb_err = -ENODEV;
	पूर्ण
	वापस gspca_dev->usb_err;
पूर्ण

अटल व्योम configure_sensor_output(काष्ठा gspca_dev *gspca_dev, पूर्णांक mode)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	u8 value;

	चयन (sd->sensor) अणु
	हाल SENSOR_SOI968:
		अगर (mode & MODE_SXGA) अणु
			i2c_w1(gspca_dev, 0x17, 0x1d);
			i2c_w1(gspca_dev, 0x18, 0xbd);
			i2c_w1(gspca_dev, 0x19, 0x01);
			i2c_w1(gspca_dev, 0x1a, 0x81);
			i2c_w1(gspca_dev, 0x12, 0x00);
			sd->hstart = 140;
			sd->vstart = 19;
		पूर्ण अन्यथा अणु
			i2c_w1(gspca_dev, 0x17, 0x13);
			i2c_w1(gspca_dev, 0x18, 0x63);
			i2c_w1(gspca_dev, 0x19, 0x01);
			i2c_w1(gspca_dev, 0x1a, 0x79);
			i2c_w1(gspca_dev, 0x12, 0x40);
			sd->hstart = 60;
			sd->vstart = 11;
		पूर्ण
		अवरोध;
	हाल SENSOR_OV9650:
		अगर (mode & MODE_SXGA) अणु
			i2c_w1(gspca_dev, 0x17, 0x1b);
			i2c_w1(gspca_dev, 0x18, 0xbc);
			i2c_w1(gspca_dev, 0x19, 0x01);
			i2c_w1(gspca_dev, 0x1a, 0x82);
			i2c_r1(gspca_dev, 0x12, &value);
			i2c_w1(gspca_dev, 0x12, value & 0x07);
		पूर्ण अन्यथा अणु
			i2c_w1(gspca_dev, 0x17, 0x24);
			i2c_w1(gspca_dev, 0x18, 0xc5);
			i2c_w1(gspca_dev, 0x19, 0x00);
			i2c_w1(gspca_dev, 0x1a, 0x3c);
			i2c_r1(gspca_dev, 0x12, &value);
			i2c_w1(gspca_dev, 0x12, (value & 0x7) | 0x40);
		पूर्ण
		अवरोध;
	हाल SENSOR_MT9M112:
	हाल SENSOR_MT9M111:
		अगर (mode & MODE_SXGA) अणु
			i2c_w2(gspca_dev, 0xf0, 0x0002);
			i2c_w2(gspca_dev, 0xc8, 0x970b);
			i2c_w2(gspca_dev, 0xf0, 0x0000);
		पूर्ण अन्यथा अणु
			i2c_w2(gspca_dev, 0xf0, 0x0002);
			i2c_w2(gspca_dev, 0xc8, 0x8000);
			i2c_w2(gspca_dev, 0xf0, 0x0000);
		पूर्ण
		अवरोध;
	पूर्ण
पूर्ण

अटल पूर्णांक sd_isoc_init(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा usb_पूर्णांकerface *पूर्णांकf;
	u32 flags = gspca_dev->cam.cam_mode[(पूर्णांक)gspca_dev->curr_mode].priv;

	/*
	 * When using the SN9C20X_I420 fmt the sn9c20x needs more bandwidth
	 * than our regular bandwidth calculations reserve, so we क्रमce the
	 * use of a specअगरic altsetting when using the SN9C20X_I420 fmt.
	 */
	अगर (!(flags & (MODE_RAW | MODE_JPEG))) अणु
		पूर्णांकf = usb_अगरnum_to_अगर(gspca_dev->dev, gspca_dev->अगरace);

		अगर (पूर्णांकf->num_altsetting != 9) अणु
			pr_warn("sn9c20x camera with unknown number of alt settings (%d), please report!\n",
				पूर्णांकf->num_altsetting);
			gspca_dev->alt = पूर्णांकf->num_altsetting;
			वापस 0;
		पूर्ण

		चयन (gspca_dev->pixfmt.width) अणु
		हाल 160: /* 160x120 */
			gspca_dev->alt = 2;
			अवरोध;
		हाल 320: /* 320x240 */
			gspca_dev->alt = 6;
			अवरोध;
		शेष:  /* >= 640x480 */
			gspca_dev->alt = 9;
			अवरोध;
		पूर्ण
	पूर्ण

	वापस 0;
पूर्ण

#घोषणा HW_WIN(mode, hstart, vstart) \
((स्थिर u8 [])अणुhstart, 0, vstart, 0, \
(mode & MODE_SXGA ? 1280 >> 4 : 640 >> 4), \
(mode & MODE_SXGA ? 1024 >> 3 : 480 >> 3)पूर्ण)

#घोषणा CLR_WIN(width, height) \
((स्थिर u8 [])\
अणु0, width >> 2, 0, height >> 1,\
((width >> 10) & 0x01) | ((height >> 8) & 0x6)पूर्ण)

अटल पूर्णांक sd_start(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	पूर्णांक mode = gspca_dev->cam.cam_mode[(पूर्णांक) gspca_dev->curr_mode].priv;
	पूर्णांक width = gspca_dev->pixfmt.width;
	पूर्णांक height = gspca_dev->pixfmt.height;
	u8 fmt, scale = 0;

	jpeg_define(sd->jpeg_hdr, height, width,
			0x21);
	jpeg_set_qual(sd->jpeg_hdr, v4l2_ctrl_g_ctrl(sd->jpegqual));

	अगर (mode & MODE_RAW)
		fmt = 0x2d;
	अन्यथा अगर (mode & MODE_JPEG)
		fmt = 0x24;
	अन्यथा
		fmt = 0x2f;	/* YUV 420 */
	sd->fmt = fmt;

	चयन (mode & SCALE_MASK) अणु
	हाल SCALE_1280x1024:
		scale = 0xc0;
		pr_info("Set 1280x1024\n");
		अवरोध;
	हाल SCALE_640x480:
		scale = 0x80;
		pr_info("Set 640x480\n");
		अवरोध;
	हाल SCALE_320x240:
		scale = 0x90;
		pr_info("Set 320x240\n");
		अवरोध;
	हाल SCALE_160x120:
		scale = 0xa0;
		pr_info("Set 160x120\n");
		अवरोध;
	पूर्ण

	configure_sensor_output(gspca_dev, mode);
	reg_w(gspca_dev, 0x1100, &sd->jpeg_hdr[JPEG_QT0_OFFSET], 64);
	reg_w(gspca_dev, 0x1140, &sd->jpeg_hdr[JPEG_QT1_OFFSET], 64);
	reg_w(gspca_dev, 0x10fb, CLR_WIN(width, height), 5);
	reg_w(gspca_dev, 0x1180, HW_WIN(mode, sd->hstart, sd->vstart), 6);
	reg_w1(gspca_dev, 0x1189, scale);
	reg_w1(gspca_dev, 0x10e0, fmt);

	set_cmatrix(gspca_dev, v4l2_ctrl_g_ctrl(sd->brightness),
			v4l2_ctrl_g_ctrl(sd->contrast),
			v4l2_ctrl_g_ctrl(sd->saturation),
			v4l2_ctrl_g_ctrl(sd->hue));
	set_gamma(gspca_dev, v4l2_ctrl_g_ctrl(sd->gamma));
	set_redblue(gspca_dev, v4l2_ctrl_g_ctrl(sd->blue),
			v4l2_ctrl_g_ctrl(sd->red));
	अगर (sd->gain)
		set_gain(gspca_dev, v4l2_ctrl_g_ctrl(sd->gain));
	अगर (sd->exposure)
		set_exposure(gspca_dev, v4l2_ctrl_g_ctrl(sd->exposure));
	अगर (sd->hflip)
		set_hvflip(gspca_dev, v4l2_ctrl_g_ctrl(sd->hflip),
				v4l2_ctrl_g_ctrl(sd->vflip));

	reg_w1(gspca_dev, 0x1007, 0x20);
	reg_w1(gspca_dev, 0x1061, 0x03);

	/* अगर JPEG, prepare the compression quality update */
	अगर (mode & MODE_JPEG) अणु
		sd->pktsz = sd->npkt = 0;
		sd->nchg = 0;
	पूर्ण

	वापस gspca_dev->usb_err;
पूर्ण

अटल व्योम sd_stopN(काष्ठा gspca_dev *gspca_dev)
अणु
	reg_w1(gspca_dev, 0x1007, 0x00);
	reg_w1(gspca_dev, 0x1061, 0x01);
पूर्ण

/* called on streamoff with alt==0 and on disconnect */
/* the usb_lock is held at entry - restore on निकास */
अटल व्योम sd_stop0(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	mutex_unlock(&gspca_dev->usb_lock);
	flush_work(&sd->work);
	mutex_lock(&gspca_dev->usb_lock);
पूर्ण

अटल व्योम करो_स्वतःexposure(काष्ठा gspca_dev *gspca_dev, u16 avg_lum)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	s32 cur_exp = v4l2_ctrl_g_ctrl(sd->exposure);
	s32 max = sd->exposure->maximum - sd->exposure_step;
	s32 min = sd->exposure->minimum + sd->exposure_step;
	s16 new_exp;

	/*
	 * some hardcoded values are present
	 * like those क्रम maximal/minimal exposure
	 * and exposure steps
	 */
	अगर (avg_lum < MIN_AVG_LUM) अणु
		अगर (cur_exp > max)
			वापस;

		new_exp = cur_exp + sd->exposure_step;
		अगर (new_exp > max)
			new_exp = max;
		अगर (new_exp < min)
			new_exp = min;
		v4l2_ctrl_s_ctrl(sd->exposure, new_exp);

		sd->older_step = sd->old_step;
		sd->old_step = 1;

		अगर (sd->old_step ^ sd->older_step)
			sd->exposure_step /= 2;
		अन्यथा
			sd->exposure_step += 2;
	पूर्ण
	अगर (avg_lum > MAX_AVG_LUM) अणु
		अगर (cur_exp < min)
			वापस;
		new_exp = cur_exp - sd->exposure_step;
		अगर (new_exp > max)
			new_exp = max;
		अगर (new_exp < min)
			new_exp = min;
		v4l2_ctrl_s_ctrl(sd->exposure, new_exp);
		sd->older_step = sd->old_step;
		sd->old_step = 0;

		अगर (sd->old_step ^ sd->older_step)
			sd->exposure_step /= 2;
		अन्यथा
			sd->exposure_step += 2;
	पूर्ण
पूर्ण

अटल व्योम करो_स्वतःgain(काष्ठा gspca_dev *gspca_dev, u16 avg_lum)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	s32 cur_gain = v4l2_ctrl_g_ctrl(sd->gain);

	अगर (avg_lum < MIN_AVG_LUM && cur_gain < sd->gain->maximum)
		v4l2_ctrl_s_ctrl(sd->gain, cur_gain + 1);
	अगर (avg_lum > MAX_AVG_LUM && cur_gain > sd->gain->minimum)
		v4l2_ctrl_s_ctrl(sd->gain, cur_gain - 1);
पूर्ण

अटल व्योम sd_dqcallback(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	पूर्णांक avg_lum;

	अगर (sd->स्वतःgain == शून्य || !v4l2_ctrl_g_ctrl(sd->स्वतःgain))
		वापस;

	avg_lum = atomic_पढ़ो(&sd->avg_lum);
	अगर (sd->sensor == SENSOR_SOI968)
		करो_स्वतःgain(gspca_dev, avg_lum);
	अन्यथा
		करो_स्वतःexposure(gspca_dev, avg_lum);
पूर्ण

/* JPEG quality update */
/* This function is executed from a work queue. */
अटल व्योम qual_upd(काष्ठा work_काष्ठा *work)
अणु
	काष्ठा sd *sd = container_of(work, काष्ठा sd, work);
	काष्ठा gspca_dev *gspca_dev = &sd->gspca_dev;
	s32 qual = v4l2_ctrl_g_ctrl(sd->jpegqual);

	/* To protect gspca_dev->usb_buf and gspca_dev->usb_err */
	mutex_lock(&gspca_dev->usb_lock);
	gspca_dbg(gspca_dev, D_STREAM, "qual_upd %d%%\n", qual);
	gspca_dev->usb_err = 0;
	set_quality(gspca_dev, qual);
	mutex_unlock(&gspca_dev->usb_lock);
पूर्ण

#अगर IS_ENABLED(CONFIG_INPUT)
अटल पूर्णांक sd_पूर्णांक_pkt_scan(काष्ठा gspca_dev *gspca_dev,
			u8 *data,		/* पूर्णांकerrupt packet */
			पूर्णांक len)		/* पूर्णांकerrupt packet length */
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;

	अगर (!(sd->flags & HAS_NO_BUTTON) && len == 1) अणु
		input_report_key(gspca_dev->input_dev, KEY_CAMERA, 1);
		input_sync(gspca_dev->input_dev);
		input_report_key(gspca_dev->input_dev, KEY_CAMERA, 0);
		input_sync(gspca_dev->input_dev);
		वापस 0;
	पूर्ण
	वापस -EINVAL;
पूर्ण
#पूर्ण_अगर

/* check the JPEG compression */
अटल व्योम transfer_check(काष्ठा gspca_dev *gspca_dev,
			u8 *data)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	पूर्णांक new_qual, r;

	new_qual = 0;

	/* अगर USB error, discard the frame and decrease the quality */
	अगर (data[6] & 0x08) अणु				/* USB FIFO full */
		gspca_dev->last_packet_type = DISCARD_PACKET;
		new_qual = -5;
	पूर्ण अन्यथा अणु

		/* अन्यथा, compute the filling rate and a new JPEG quality */
		r = (sd->pktsz * 100) /
			(sd->npkt *
				gspca_dev->urb[0]->iso_frame_desc[0].length);
		अगर (r >= 85)
			new_qual = -3;
		अन्यथा अगर (r < 75)
			new_qual = 2;
	पूर्ण
	अगर (new_qual != 0) अणु
		sd->nchg += new_qual;
		अगर (sd->nchg < -6 || sd->nchg >= 12) अणु
			/* Note: we are in पूर्णांकerrupt context, so we can't
			   use v4l2_ctrl_g/s_ctrl here. Access the value
			   directly instead. */
			s32 curqual = sd->jpegqual->cur.val;
			sd->nchg = 0;
			new_qual += curqual;
			अगर (new_qual < sd->jpegqual->minimum)
				new_qual = sd->jpegqual->minimum;
			अन्यथा अगर (new_qual > sd->jpegqual->maximum)
				new_qual = sd->jpegqual->maximum;
			अगर (new_qual != curqual) अणु
				sd->jpegqual->cur.val = new_qual;
				schedule_work(&sd->work);
			पूर्ण
		पूर्ण
	पूर्ण अन्यथा अणु
		sd->nchg = 0;
	पूर्ण
	sd->pktsz = sd->npkt = 0;
पूर्ण

अटल व्योम sd_pkt_scan(काष्ठा gspca_dev *gspca_dev,
			u8 *data,			/* isoc packet */
			पूर्णांक len)			/* iso packet length */
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	पूर्णांक avg_lum, is_jpeg;
	अटल स्थिर u8 frame_header[] = अणु
		0xff, 0xff, 0x00, 0xc4, 0xc4, 0x96
	पूर्ण;

	is_jpeg = (sd->fmt & 0x03) == 0;
	अगर (len >= 64 && स_भेद(data, frame_header, 6) == 0) अणु
		avg_lum = ((data[35] >> 2) & 3) |
			   (data[20] << 2) |
			   (data[19] << 10);
		avg_lum += ((data[35] >> 4) & 3) |
			    (data[22] << 2) |
			    (data[21] << 10);
		avg_lum += ((data[35] >> 6) & 3) |
			    (data[24] << 2) |
			    (data[23] << 10);
		avg_lum += (data[36] & 3) |
			   (data[26] << 2) |
			   (data[25] << 10);
		avg_lum += ((data[36] >> 2) & 3) |
			    (data[28] << 2) |
			    (data[27] << 10);
		avg_lum += ((data[36] >> 4) & 3) |
			    (data[30] << 2) |
			    (data[29] << 10);
		avg_lum += ((data[36] >> 6) & 3) |
			    (data[32] << 2) |
			    (data[31] << 10);
		avg_lum += ((data[44] >> 4) & 3) |
			    (data[34] << 2) |
			    (data[33] << 10);
		avg_lum >>= 9;
		atomic_set(&sd->avg_lum, avg_lum);

		अगर (is_jpeg)
			transfer_check(gspca_dev, data);

		gspca_frame_add(gspca_dev, LAST_PACKET, शून्य, 0);
		len -= 64;
		अगर (len == 0)
			वापस;
		data += 64;
	पूर्ण
	अगर (gspca_dev->last_packet_type == LAST_PACKET) अणु
		अगर (is_jpeg) अणु
			gspca_frame_add(gspca_dev, FIRST_PACKET,
				sd->jpeg_hdr, JPEG_HDR_SZ);
			gspca_frame_add(gspca_dev, INTER_PACKET,
				data, len);
		पूर्ण अन्यथा अणु
			gspca_frame_add(gspca_dev, FIRST_PACKET,
				data, len);
		पूर्ण
	पूर्ण अन्यथा अणु
		/* अगर JPEG, count the packets and their size */
		अगर (is_jpeg) अणु
			sd->npkt++;
			sd->pktsz += len;
		पूर्ण
		gspca_frame_add(gspca_dev, INTER_PACKET, data, len);
	पूर्ण
पूर्ण

/* sub-driver description */
अटल स्थिर काष्ठा sd_desc sd_desc = अणु
	.name = KBUILD_MODNAME,
	.config = sd_config,
	.init = sd_init,
	.init_controls = sd_init_controls,
	.isoc_init = sd_isoc_init,
	.start = sd_start,
	.stopN = sd_stopN,
	.stop0 = sd_stop0,
	.pkt_scan = sd_pkt_scan,
#अगर IS_ENABLED(CONFIG_INPUT)
	.पूर्णांक_pkt_scan = sd_पूर्णांक_pkt_scan,
#पूर्ण_अगर
	.dq_callback = sd_dqcallback,
#अगर_घोषित CONFIG_VIDEO_ADV_DEBUG
	.set_रेजिस्टर = sd_dbg_s_रेजिस्टर,
	.get_रेजिस्टर = sd_dbg_g_रेजिस्टर,
	.get_chip_info = sd_chip_info,
#पूर्ण_अगर
पूर्ण;

#घोषणा SN9C20X(sensor, i2c_addr, flags) \
	.driver_info =  ((flags & 0xff) << 16) \
			| (SENSOR_ ## sensor << 8) \
			| (i2c_addr)

अटल स्थिर काष्ठा usb_device_id device_table[] = अणु
	अणुUSB_DEVICE(0x0c45, 0x6240), SN9C20X(MT9M001, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6242), SN9C20X(MT9M111, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6248), SN9C20X(OV9655, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x624c), SN9C20X(MT9M112, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x624e), SN9C20X(SOI968, 0x30, LED_REVERSE)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x624f), SN9C20X(OV9650, 0x30,
					     (FLIP_DETECT | HAS_NO_BUTTON))पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6251), SN9C20X(OV9650, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6253), SN9C20X(OV9650, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6260), SN9C20X(OV7670, 0x21, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6270), SN9C20X(MT9VPRB, 0x00, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x627b), SN9C20X(OV7660, 0x21, FLIP_DETECT)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x627c), SN9C20X(HV7131R, 0x11, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x627f), SN9C20X(OV9650, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6280), SN9C20X(MT9M001, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6282), SN9C20X(MT9M111, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x6288), SN9C20X(OV9655, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x628c), SN9C20X(MT9M112, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x628e), SN9C20X(SOI968, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x628f), SN9C20X(OV9650, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x62a0), SN9C20X(OV7670, 0x21, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x62b0), SN9C20X(MT9VPRB, 0x00, 0)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x62b3), SN9C20X(OV9655, 0x30, LED_REVERSE)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x62bb), SN9C20X(OV7660, 0x21, LED_REVERSE)पूर्ण,
	अणुUSB_DEVICE(0x0c45, 0x62bc), SN9C20X(HV7131R, 0x11, 0)पूर्ण,
	अणुUSB_DEVICE(0x045e, 0x00f4), SN9C20X(OV9650, 0x30, 0)पूर्ण,
	अणुUSB_DEVICE(0x145f, 0x013d), SN9C20X(OV7660, 0x21, 0)पूर्ण,
	अणुUSB_DEVICE(0x0458, 0x7029), SN9C20X(HV7131R, 0x11, 0)पूर्ण,
	अणुUSB_DEVICE(0x0458, 0x7045), SN9C20X(MT9M112, 0x5d, LED_REVERSE)पूर्ण,
	अणुUSB_DEVICE(0x0458, 0x704a), SN9C20X(MT9M112, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0x0458, 0x704c), SN9C20X(MT9M112, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0xa168, 0x0610), SN9C20X(HV7131R, 0x11, 0)पूर्ण,
	अणुUSB_DEVICE(0xa168, 0x0611), SN9C20X(HV7131R, 0x11, 0)पूर्ण,
	अणुUSB_DEVICE(0xa168, 0x0613), SN9C20X(HV7131R, 0x11, 0)पूर्ण,
	अणुUSB_DEVICE(0xa168, 0x0618), SN9C20X(HV7131R, 0x11, 0)पूर्ण,
	अणुUSB_DEVICE(0xa168, 0x0614), SN9C20X(MT9M111, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0xa168, 0x0615), SN9C20X(MT9M111, 0x5d, 0)पूर्ण,
	अणुUSB_DEVICE(0xa168, 0x0617), SN9C20X(MT9M111, 0x5d, 0)पूर्ण,
	अणुपूर्ण
पूर्ण;
MODULE_DEVICE_TABLE(usb, device_table);

/* -- device connect -- */
अटल पूर्णांक sd_probe(काष्ठा usb_पूर्णांकerface *पूर्णांकf,
		    स्थिर काष्ठा usb_device_id *id)
अणु
	वापस gspca_dev_probe(पूर्णांकf, id, &sd_desc, माप(काष्ठा sd),
				THIS_MODULE);
पूर्ण

अटल काष्ठा usb_driver sd_driver = अणु
	.name = KBUILD_MODNAME,
	.id_table = device_table,
	.probe = sd_probe,
	.disconnect = gspca_disconnect,
#अगर_घोषित CONFIG_PM
	.suspend = gspca_suspend,
	.resume = gspca_resume,
	.reset_resume = gspca_resume,
#पूर्ण_अगर
पूर्ण;

module_usb_driver(sd_driver);
