<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0-or-later
/*
 * SPCA508 chip based cameras subdriver
 *
 * Copyright (C) 2009 Jean-Francois Moine <http://moinejf.मुक्त.fr>
 */

#घोषणा pr_fmt(fmt) KBUILD_MODNAME ": " fmt

#घोषणा MODULE_NAME "spca508"

#समावेश "gspca.h"

MODULE_AUTHOR("Michel Xhaard <mxhaard@users.sourceforge.net>");
MODULE_DESCRIPTION("GSPCA/SPCA508 USB Camera Driver");
MODULE_LICENSE("GPL");

/* specअगरic webcam descriptor */
काष्ठा sd अणु
	काष्ठा gspca_dev gspca_dev;		/* !! must be the first item */

	u8 subtype;
#घोषणा CreativeVista 0
#घोषणा HamaUSBSightcam 1
#घोषणा HamaUSBSightcam2 2
#घोषणा IntelEasyPCCamera 3
#घोषणा MicroInnovationIC200 4
#घोषणा ViewQuestVQ110 5
पूर्ण;

अटल स्थिर काष्ठा v4l2_pix_क्रमmat sअगर_mode[] = अणु
	अणु160, 120, V4L2_PIX_FMT_SPCA508, V4L2_FIELD_NONE,
		.bytesperline = 160,
		.sizeimage = 160 * 120 * 3 / 2,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = 3पूर्ण,
	अणु176, 144, V4L2_PIX_FMT_SPCA508, V4L2_FIELD_NONE,
		.bytesperline = 176,
		.sizeimage = 176 * 144 * 3 / 2,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = 2पूर्ण,
	अणु320, 240, V4L2_PIX_FMT_SPCA508, V4L2_FIELD_NONE,
		.bytesperline = 320,
		.sizeimage = 320 * 240 * 3 / 2,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = 1पूर्ण,
	अणु352, 288, V4L2_PIX_FMT_SPCA508, V4L2_FIELD_NONE,
		.bytesperline = 352,
		.sizeimage = 352 * 288 * 3 / 2,
		.colorspace = V4L2_COLORSPACE_SRGB,
		.priv = 0पूर्ण,
पूर्ण;

/* Frame packet header offsets क्रम the spca508 */
#घोषणा SPCA508_OFFSET_DATA 37

/*
 * Initialization data: this is the first set-up data written to the
 * device (beक्रमe the खोलो data).
 */
अटल स्थिर u16 spca508_init_data[][2] = अणु
	अणु0x0000, 0x870bपूर्ण,

	अणु0x0020, 0x8112पूर्ण,	/* Video drop enable, ISO streaming disable */
	अणु0x0003, 0x8111पूर्ण,	/* Reset compression & memory */
	अणु0x0000, 0x8110पूर्ण,	/* Disable all outमाला_दो */
	/* READ अणु0x0000, 0x8114पूर्ण -> 0000: 00  */
	अणु0x0000, 0x8114पूर्ण,	/* SW GPIO data */
	अणु0x0008, 0x8110पूर्ण,	/* Enable अक्षरge pump output */
	अणु0x0002, 0x8116पूर्ण,	/* 200 kHz pump घड़ी */
	/* UNKNOWN सूचीECTION (URB_FUNCTION_SELECT_INTERFACE:) */
	अणु0x0003, 0x8111पूर्ण,	/* Reset compression & memory */
	अणु0x0000, 0x8111पूर्ण,	/* Normal mode (not reset) */
	अणु0x0098, 0x8110पूर्ण,
		/* Enable अक्षरge pump output, sync.serial,बाह्यal 2x घड़ी */
	अणु0x000d, 0x8114पूर्ण,	/* SW GPIO data */
	अणु0x0002, 0x8116पूर्ण,	/* 200 kHz pump घड़ी */
	अणु0x0020, 0x8112पूर्ण,	/* Video drop enable, ISO streaming disable */
/* --------------------------------------- */
	अणु0x000f, 0x8402पूर्ण,	/* memory bank */
	अणु0x0000, 0x8403पूर्ण,	/* ... address */
/* --------------------------------------- */
/* 0x88__ is Synchronous Serial Interface. */
/* TBD: This table could be expressed more compactly */
/* using spca508_ग_लिखो_i2c_vector(). */
/* TBD: Should see अगर the values in spca50x_i2c_data */
/* would work with the VQ110 instead of the values */
/* below. */
	अणु0x00c0, 0x8804पूर्ण,	/* SSI slave addr */
	अणु0x0008, 0x8802पूर्ण,	/* 375 Khz SSI घड़ी */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,	/* 375 Khz SSI घड़ी */
	अणु0x0012, 0x8801पूर्ण,	/* SSI reg addr */
	अणु0x0080, 0x8800पूर्ण,	/* SSI data to ग_लिखो */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,	/* 375 Khz SSI घड़ी */
	अणु0x0012, 0x8801पूर्ण,	/* SSI reg addr */
	अणु0x0000, 0x8800पूर्ण,	/* SSI data to ग_लिखो */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,	/* 375 Khz SSI घड़ी */
	अणु0x0011, 0x8801पूर्ण,	/* SSI reg addr */
	अणु0x0040, 0x8800पूर्ण,	/* SSI data to ग_लिखो */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0013, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0014, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0015, 0x8801पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0016, 0x8801पूर्ण,
	अणु0x0003, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0017, 0x8801पूर्ण,
	अणु0x0036, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0018, 0x8801पूर्ण,
	अणु0x00ec, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x001a, 0x8801पूर्ण,
	अणु0x0094, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x001b, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0027, 0x8801पूर्ण,
	अणु0x00a2, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0028, 0x8801पूर्ण,
	अणु0x0040, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x002a, 0x8801पूर्ण,
	अणु0x0084, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00 */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x002b, 0x8801पूर्ण,
	अणु0x00a8, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x002c, 0x8801पूर्ण,
	अणु0x00fe, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x002d, 0x8801पूर्ण,
	अणु0x0003, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0038, 0x8801पूर्ण,
	अणु0x0083, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0033, 0x8801पूर्ण,
	अणु0x0081, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0034, 0x8801पूर्ण,
	अणु0x004a, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0039, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0010, 0x8801पूर्ण,
	अणु0x00a8, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x0058, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00 */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0000, 0x8801पूर्ण,
	अणु0x0004, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0040, 0x8801पूर्ण,
	अणु0x0080, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0041, 0x8801पूर्ण,
	अणु0x000c, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0042, 0x8801पूर्ण,
	अणु0x000c, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0043, 0x8801पूर्ण,
	अणु0x0028, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0044, 0x8801पूर्ण,
	अणु0x0080, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0045, 0x8801पूर्ण,
	अणु0x0020, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0046, 0x8801पूर्ण,
	अणु0x0020, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0047, 0x8801पूर्ण,
	अणु0x0080, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0048, 0x8801पूर्ण,
	अणु0x004c, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x0049, 0x8801पूर्ण,
	अणु0x0084, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x004a, 0x8801पूर्ण,
	अणु0x0084, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x0008, 0x8802पूर्ण,
	अणु0x004b, 0x8801पूर्ण,
	अणु0x0084, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* --------------------------------------- */
	अणु0x0012, 0x8700पूर्ण,	/* Clock speed 48Mhz/(2+2)/2= 6 Mhz */
	अणु0x0000, 0x8701पूर्ण,	/* CKx1 घड़ी delay adj */
	अणु0x0000, 0x8701पूर्ण,	/* CKx1 घड़ी delay adj */
	अणु0x0001, 0x870cपूर्ण,	/* CKOx2 output */
	/* --------------------------------------- */
	अणु0x0080, 0x8600पूर्ण,	/* Line memory पढ़ो counter (L) */
	अणु0x0001, 0x8606पूर्ण,	/* reserved */
	अणु0x0064, 0x8607पूर्ण,	/* Line memory पढ़ो counter (H) 0x6480=25,728 */
	अणु0x002a, 0x8601पूर्ण,	/* CDSP sharp पूर्णांकerpolation mode,
	 *			line sel क्रम color sep, edge enhance enab */
	अणु0x0000, 0x8602पूर्ण,	/* optical black level क्रम user settng = 0 */
	अणु0x0080, 0x8600पूर्ण,	/* Line memory पढ़ो counter (L) */
	अणु0x000a, 0x8603पूर्ण,	/* optical black level calc mode:
				 * स्वतः; optical black offset = 10 */
	अणु0x00df, 0x865bपूर्ण,	/* Horiz offset क्रम valid pixels (L)=0xdf */
	अणु0x0012, 0x865cपूर्ण,	/* Vert offset क्रम valid lines (L)=0x12 */

/* The following two lines seem to be the "wrong" resolution. */
/* But perhaps these indicate the actual size of the sensor */
/* rather than the size of the current video mode. */
	अणु0x0058, 0x865dपूर्ण,	/* Horiz valid pixels (*4) (L) = 352 */
	अणु0x0048, 0x865eपूर्ण,	/* Vert valid lines (*4) (L) = 288 */

	अणु0x0015, 0x8608पूर्ण,	/* A11 Coef ... */
	अणु0x0030, 0x8609पूर्ण,
	अणु0x00fb, 0x860aपूर्ण,
	अणु0x003e, 0x860bपूर्ण,
	अणु0x00ce, 0x860cपूर्ण,
	अणु0x00f4, 0x860dपूर्ण,
	अणु0x00eb, 0x860eपूर्ण,
	अणु0x00dc, 0x860fपूर्ण,
	अणु0x0039, 0x8610पूर्ण,
	अणु0x0001, 0x8611पूर्ण,	/* R offset क्रम white balance ... */
	अणु0x0000, 0x8612पूर्ण,
	अणु0x0001, 0x8613पूर्ण,
	अणु0x0000, 0x8614पूर्ण,
	अणु0x005b, 0x8651पूर्ण,	/* R gain क्रम white balance ... */
	अणु0x0040, 0x8652पूर्ण,
	अणु0x0060, 0x8653पूर्ण,
	अणु0x0040, 0x8654पूर्ण,
	अणु0x0000, 0x8655पूर्ण,
	अणु0x0001, 0x863fपूर्ण,	/* Fixed gamma correction enable, USB control,
				 * lum filter disable, lum noise clip disable */
	अणु0x00a1, 0x8656पूर्ण,	/* Winकरोw1 size 256x256, Winकरोws2 size 64x64,
				 * gamma look-up disable,
				 * new edge enhancement enable */
	अणु0x0018, 0x8657पूर्ण,	/* Edge gain high thresh */
	अणु0x0020, 0x8658पूर्ण,	/* Edge gain low thresh */
	अणु0x000a, 0x8659पूर्ण,	/* Edge bandwidth high threshold */
	अणु0x0005, 0x865aपूर्ण,	/* Edge bandwidth low threshold */
	/* -------------------------------- */
	अणु0x0030, 0x8112पूर्ण,	/* Video drop enable, ISO streaming enable */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0xa908, 0x8802पूर्ण,
	अणु0x0034, 0x8801पूर्ण,	/* SSI reg addr */
	अणु0x00ca, 0x8800पूर्ण,
	/* SSI data to ग_लिखो */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0x1f08, 0x8802पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x0080, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

/* ----- Read back coefs we wrote earlier. */
	/* READ अणु 0x0000, 0x8608 पूर्ण -> 0000: 15  */
	/* READ अणु 0x0000, 0x8609 पूर्ण -> 0000: 30  */
	/* READ अणु 0x0000, 0x860a पूर्ण -> 0000: fb  */
	/* READ अणु 0x0000, 0x860b पूर्ण -> 0000: 3e  */
	/* READ अणु 0x0000, 0x860c पूर्ण -> 0000: ce  */
	/* READ अणु 0x0000, 0x860d पूर्ण -> 0000: f4  */
	/* READ अणु 0x0000, 0x860e पूर्ण -> 0000: eb  */
	/* READ अणु 0x0000, 0x860f पूर्ण -> 0000: dc  */
	/* READ अणु 0x0000, 0x8610 पूर्ण -> 0000: 39  */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 08  */
	अणु0xb008, 0x8802पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x007d, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */


	/* This chunk is seemingly redundant with */
	/* earlier commands (A11 Coef...), but अगर I disable it, */
	/* the image appears too dark.  Maybe there was some kind of */
	/* reset since the earlier commands, so this is necessary again. */
	अणु0x0015, 0x8608पूर्ण,
	अणु0x0030, 0x8609पूर्ण,
	अणु0xfffb, 0x860aपूर्ण,
	अणु0x003e, 0x860bपूर्ण,
	अणु0xffce, 0x860cपूर्ण,
	अणु0xfff4, 0x860dपूर्ण,
	अणु0xffeb, 0x860eपूर्ण,
	अणु0xffdc, 0x860fपूर्ण,
	अणु0x0039, 0x8610पूर्ण,
	अणु0x0018, 0x8657पूर्ण,

	अणु0x0000, 0x8508पूर्ण,	/* Disable compression. */
	/* Previous line was:
	अणु0x0021, 0x8508पूर्ण,	 * Enable compression. */
	अणु0x0032, 0x850bपूर्ण,	/* compression stuff */
	अणु0x0003, 0x8509पूर्ण,	/* compression stuff */
	अणु0x0011, 0x850aपूर्ण,	/* compression stuff */
	अणु0x0021, 0x850dपूर्ण,	/* compression stuff */
	अणु0x0010, 0x850cपूर्ण,	/* compression stuff */
	अणु0x0003, 0x8500पूर्ण,	/* *** Video mode: 160x120 */
	अणु0x0001, 0x8501पूर्ण,	/* Hardware-करोminated snap control */
	अणु0x0061, 0x8656पूर्ण,	/* Winकरोw1 size 128x128, Winकरोws2 size 128x128,
				 * gamma look-up disable,
				 * new edge enhancement enable */
	अणु0x0018, 0x8617पूर्ण,	/* Winकरोw1 start X (*2) */
	अणु0x0008, 0x8618पूर्ण,	/* Winकरोw1 start Y (*2) */
	अणु0x0061, 0x8656पूर्ण,	/* Winकरोw1 size 128x128, Winकरोws2 size 128x128,
				 * gamma look-up disable,
				 * new edge enhancement enable */
	अणु0x0058, 0x8619पूर्ण,	/* Winकरोw2 start X (*2) */
	अणु0x0008, 0x861aपूर्ण,	/* Winकरोw2 start Y (*2) */
	अणु0x00ff, 0x8615पूर्ण,	/* High lum thresh क्रम white balance */
	अणु0x0000, 0x8616पूर्ण,	/* Low lum thresh क्रम white balance */
	अणु0x0012, 0x8700पूर्ण,	/* Clock speed 48Mhz/(2+2)/2= 6 Mhz */
	अणु0x0012, 0x8700पूर्ण,	/* Clock speed 48Mhz/(2+2)/2= 6 Mhz */
	/* READ अणु 0x0000, 0x8656 पूर्ण -> 0000: 61  */
	अणु0x0028, 0x8802पूर्ण,    /* 375 Khz SSI घड़ी, SSI r/w sync with VSYNC */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 28  */
	अणु0x1f28, 0x8802पूर्ण,    /* 375 Khz SSI घड़ी, SSI r/w sync with VSYNC */
	अणु0x0010, 0x8801पूर्ण,	/* SSI reg addr */
	अणु0x003e, 0x8800पूर्ण,	/* SSI data to ग_लिखो */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	अणु0x0028, 0x8802पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 28  */
	अणु0x1f28, 0x8802पूर्ण,
	अणु0x0000, 0x8801पूर्ण,
	अणु0x001f, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	अणु0x0001, 0x8602पूर्ण,    /* optical black level क्रम user settning = 1 */

	/* Original: */
	अणु0x0023, 0x8700पूर्ण,	/* Clock speed 48Mhz/(3+2)/4= 2.4 Mhz */
	अणु0x000f, 0x8602पूर्ण,    /* optical black level क्रम user settning = 15 */

	अणु0x0028, 0x8802पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 28  */
	अणु0x1f28, 0x8802पूर्ण,
	अणु0x0010, 0x8801पूर्ण,
	अणु0x007b, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	अणु0x002f, 0x8651पूर्ण,	/* R gain क्रम white balance ... */
	अणु0x0080, 0x8653पूर्ण,
	/* READ अणु 0x0000, 0x8655 पूर्ण -> 0000: 00  */
	अणु0x0000, 0x8655पूर्ण,

	अणु0x0030, 0x8112पूर्ण,	/* Video drop enable, ISO streaming enable */
	अणु0x0020, 0x8112पूर्ण,	/* Video drop enable, ISO streaming disable */
	/* UNKNOWN सूचीECTION (URB_FUNCTION_SELECT_INTERFACE: (ALT=0) ) */
	अणुपूर्ण
पूर्ण;

/*
 * Initialization data क्रम Intel EasyPC Camera CS110
 */
अटल स्थिर u16 spca508cs110_init_data[][2] = अणु
	अणु0x0000, 0x870bपूर्ण,	/* Reset CTL3 */
	अणु0x0003, 0x8111पूर्ण,	/* Soft Reset compression, memory, TG & CDSP */
	अणु0x0000, 0x8111पूर्ण,	/* Normal operation on reset */
	अणु0x0090, 0x8110पूर्ण,
		 /* External Clock 2x & Synchronous Serial Interface Output */
	अणु0x0020, 0x8112पूर्ण,	/* Video Drop packet enable */
	अणु0x0000, 0x8114पूर्ण,	/* Software GPIO output data */
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0003, 0x8114पूर्ण,

	/* Initial sequence Synchronous Serial Interface */
	अणु0x000f, 0x8402पूर्ण,	/* Memory bank Address */
	अणु0x0000, 0x8403पूर्ण,	/* Memory bank Address */
	अणु0x00ba, 0x8804पूर्ण,	/* SSI Slave address */
	अणु0x0010, 0x8802पूर्ण,	/* 93.75kHz SSI Clock Two DataByte */
	अणु0x0010, 0x8802पूर्ण,	/* 93.75kHz SSI Clock two DataByte */

	अणु0x0001, 0x8801पूर्ण,
	अणु0x000a, 0x8805पूर्ण,	/* a - NWG: Dunno what this is about */
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0010, 0x8802पूर्ण,

	अणु0x0002, 0x8801पूर्ण,
	अणु0x0000, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0010, 0x8802पूर्ण,

	अणु0x0003, 0x8801पूर्ण,
	अणु0x0027, 0x8805पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	अणु0x0010, 0x8802पूर्ण,

	अणु0x0004, 0x8801पूर्ण,
	अणु0x0065, 0x8805पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	अणु0x0010, 0x8802पूर्ण,

	अणु0x0005, 0x8801पूर्ण,
	अणु0x0003, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0010, 0x8802पूर्ण,

	अणु0x0006, 0x8801पूर्ण,
	अणु0x001c, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0010, 0x8802पूर्ण,

	अणु0x0007, 0x8801पूर्ण,
	अणु0x002a, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0010, 0x8802पूर्ण,

	अणु0x0002, 0x8704पूर्ण,	/* External input CKIx1 */
	अणु0x0001, 0x8606पूर्ण,    /* 1 Line memory Read Counter (H) Result: (d)410 */
	अणु0x009a, 0x8600पूर्ण,	/* Line memory Read Counter (L) */
	अणु0x0001, 0x865bपूर्ण,	/* 1 Horizontal Offset क्रम Valid Pixel(L) */
	अणु0x0003, 0x865cपूर्ण,	/* 3 Vertical Offset क्रम Valid Lines(L) */
	अणु0x0058, 0x865dपूर्ण,	/* 58 Horizontal Valid Pixel Winकरोw(L) */

	अणु0x0006, 0x8660पूर्ण,	/* Nibble data + input order */

	अणु0x000a, 0x8602पूर्ण,	/* Optical black level set to 0x0a */
	अणु0x0000, 0x8603पूर्ण,	/* Optical black level Offset */

/*	अणु0x0000, 0x8611पूर्ण,	 * 0 R  Offset क्रम white Balance */
/*	अणु0x0000, 0x8612पूर्ण,	 * 1 Gr Offset क्रम white Balance */
/*	अणु0x0000, 0x8613पूर्ण,	 * 1f B  Offset क्रम white Balance */
/*	अणु0x0000, 0x8614पूर्ण,	 * f0 Gb Offset क्रम white Balance */

	अणु0x0040, 0x8651पूर्ण,   /* 2b BLUE gain क्रम white balance  good at all 60 */
	अणु0x0030, 0x8652पूर्ण,	/* 41 Gr Gain क्रम white Balance (L) */
	अणु0x0035, 0x8653पूर्ण,	/* 26 RED gain क्रम white balance */
	अणु0x0035, 0x8654पूर्ण,	/* 40Gb Gain क्रम white Balance (L) */
	अणु0x0041, 0x863fपूर्ण,
	      /* Fixed Gamma correction enabled (makes colours look better) */

	अणु0x0000, 0x8655पूर्ण,
		/* High bits क्रम white balance*****brightness control*** */
	अणुपूर्ण
पूर्ण;

अटल स्थिर u16 spca508_sightcam_init_data[][2] = अणु
/* This line seems to setup the frame/canvas */
	अणु0x000f, 0x8402पूर्ण,

/* These 6 lines are needed to startup the webcam */
	अणु0x0090, 0x8110पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0003, 0x8114पूर्ण,
	अणु0x0080, 0x8804पूर्ण,

/* This part seems to make the pictures darker? (स्वतःbrightness?) */
	अणु0x0001, 0x8801पूर्ण,
	अणु0x0004, 0x8800पूर्ण,
	अणु0x0003, 0x8801पूर्ण,
	अणु0x00e0, 0x8800पूर्ण,
	अणु0x0004, 0x8801पूर्ण,
	अणु0x00b4, 0x8800पूर्ण,
	अणु0x0005, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,

	अणु0x0006, 0x8801पूर्ण,
	अणु0x00e0, 0x8800पूर्ण,
	अणु0x0007, 0x8801पूर्ण,
	अणु0x000c, 0x8800पूर्ण,

/* This section is just needed, it probably
 * करोes something like the previous section,
 * but the cam won't start if it's not included.
 */
	अणु0x0014, 0x8801पूर्ण,
	अणु0x0008, 0x8800पूर्ण,
	अणु0x0015, 0x8801पूर्ण,
	अणु0x0067, 0x8800पूर्ण,
	अणु0x0016, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0017, 0x8801पूर्ण,
	अणु0x0020, 0x8800पूर्ण,
	अणु0x0018, 0x8801पूर्ण,
	अणु0x0044, 0x8800पूर्ण,

/* Makes the picture darker - and the
 * cam won't start अगर not included
 */
	अणु0x001e, 0x8801पूर्ण,
	अणु0x00ea, 0x8800पूर्ण,
	अणु0x001f, 0x8801पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	अणु0x0003, 0x8801पूर्ण,
	अणु0x00e0, 0x8800पूर्ण,

/* seems to place the colors ontop of each other #1 */
	अणु0x0006, 0x8704पूर्ण,
	अणु0x0001, 0x870cपूर्ण,
	अणु0x0016, 0x8600पूर्ण,
	अणु0x0002, 0x8606पूर्ण,

/* अगर not included the pictures becomes _very_ dark */
	अणु0x0064, 0x8607पूर्ण,
	अणु0x003a, 0x8601पूर्ण,
	अणु0x0000, 0x8602पूर्ण,

/* seems to place the colors ontop of each other #2 */
	अणु0x0016, 0x8600पूर्ण,
	अणु0x0018, 0x8617पूर्ण,
	अणु0x0008, 0x8618पूर्ण,
	अणु0x00a1, 0x8656पूर्ण,

/* webcam won't start अगर not included */
	अणु0x0007, 0x865bपूर्ण,
	अणु0x0001, 0x865cपूर्ण,
	अणु0x0058, 0x865dपूर्ण,
	अणु0x0048, 0x865eपूर्ण,

/* adjusts the colors */
	अणु0x0049, 0x8651पूर्ण,
	अणु0x0040, 0x8652पूर्ण,
	अणु0x004c, 0x8653पूर्ण,
	अणु0x0040, 0x8654पूर्ण,
	अणुपूर्ण
पूर्ण;

अटल स्थिर u16 spca508_sightcam2_init_data[][2] = अणु
	अणु0x0020, 0x8112पूर्ण,

	अणु0x000f, 0x8402पूर्ण,
	अणु0x0000, 0x8403पूर्ण,

	अणु0x0008, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x0009, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x000a, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x000b, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x000c, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x000d, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x000e, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x0007, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x000f, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,

	अणु0x0018, 0x8660पूर्ण,
	अणु0x0010, 0x8201पूर्ण,

	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x0011, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,

	अणु0x0000, 0x86b0पूर्ण,
	अणु0x0034, 0x86b1पूर्ण,
	अणु0x0000, 0x86b2पूर्ण,
	अणु0x0049, 0x86b3पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,

	अणु0x0012, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,
	अणु0x0013, 0x8201पूर्ण,
	अणु0x0008, 0x8200पूर्ण,
	अणु0x0001, 0x8200पूर्ण,

	अणु0x0001, 0x86b0पूर्ण,
	अणु0x00aa, 0x86b1पूर्ण,
	अणु0x0000, 0x86b2पूर्ण,
	अणु0x00e4, 0x86b3पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,

	अणु0x0018, 0x8660पूर्ण,

	अणु0x0090, 0x8110पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0003, 0x8114पूर्ण,

	अणु0x0080, 0x8804पूर्ण,
	अणु0x0003, 0x8801पूर्ण,
	अणु0x0012, 0x8800पूर्ण,
	अणु0x0004, 0x8801पूर्ण,
	अणु0x0005, 0x8800पूर्ण,
	अणु0x0005, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0007, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0008, 0x8801पूर्ण,
	अणु0x0005, 0x8800पूर्ण,
	अणु0x000a, 0x8700पूर्ण,
	अणु0x000e, 0x8801पूर्ण,
	अणु0x0004, 0x8800पूर्ण,
	अणु0x0005, 0x8801पूर्ण,
	अणु0x0047, 0x8800पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0007, 0x8801पूर्ण,
	अणु0x00c0, 0x8800पूर्ण,
	अणु0x0008, 0x8801पूर्ण,
	अणु0x0003, 0x8800पूर्ण,
	अणु0x0013, 0x8801पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	अणु0x0009, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000a, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000b, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000c, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000e, 0x8801पूर्ण,
	अणु0x0004, 0x8800पूर्ण,
	अणु0x000f, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0010, 0x8801पूर्ण,
	अणु0x0006, 0x8800पूर्ण,
	अणु0x0011, 0x8801पूर्ण,
	अणु0x0006, 0x8800पूर्ण,
	अणु0x0012, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0013, 0x8801पूर्ण,
	अणु0x0001, 0x8800पूर्ण,

	अणु0x000a, 0x8700पूर्ण,
	अणु0x0000, 0x8702पूर्ण,
	अणु0x0000, 0x8703पूर्ण,
	अणु0x00c2, 0x8704पूर्ण,
	अणु0x0001, 0x870cपूर्ण,

	अणु0x0044, 0x8600पूर्ण,
	अणु0x0002, 0x8606पूर्ण,
	अणु0x0064, 0x8607पूर्ण,
	अणु0x003a, 0x8601पूर्ण,
	अणु0x0008, 0x8602पूर्ण,
	अणु0x0044, 0x8600पूर्ण,
	अणु0x0018, 0x8617पूर्ण,
	अणु0x0008, 0x8618पूर्ण,
	अणु0x00a1, 0x8656पूर्ण,
	अणु0x0004, 0x865bपूर्ण,
	अणु0x0002, 0x865cपूर्ण,
	अणु0x0058, 0x865dपूर्ण,
	अणु0x0048, 0x865eपूर्ण,
	अणु0x0012, 0x8608पूर्ण,
	अणु0x002c, 0x8609पूर्ण,
	अणु0x0002, 0x860aपूर्ण,
	अणु0x002c, 0x860bपूर्ण,
	अणु0x00db, 0x860cपूर्ण,
	अणु0x00f9, 0x860dपूर्ण,
	अणु0x00f1, 0x860eपूर्ण,
	अणु0x00e3, 0x860fपूर्ण,
	अणु0x002c, 0x8610पूर्ण,
	अणु0x006c, 0x8651पूर्ण,
	अणु0x0041, 0x8652पूर्ण,
	अणु0x0059, 0x8653पूर्ण,
	अणु0x0040, 0x8654पूर्ण,
	अणु0x00fa, 0x8611पूर्ण,
	अणु0x00ff, 0x8612पूर्ण,
	अणु0x00f8, 0x8613पूर्ण,
	अणु0x0000, 0x8614पूर्ण,
	अणु0x0001, 0x863fपूर्ण,
	अणु0x0000, 0x8640पूर्ण,
	अणु0x0026, 0x8641पूर्ण,
	अणु0x0045, 0x8642पूर्ण,
	अणु0x0060, 0x8643पूर्ण,
	अणु0x0075, 0x8644पूर्ण,
	अणु0x0088, 0x8645पूर्ण,
	अणु0x009b, 0x8646पूर्ण,
	अणु0x00b0, 0x8647पूर्ण,
	अणु0x00c5, 0x8648पूर्ण,
	अणु0x00d2, 0x8649पूर्ण,
	अणु0x00dc, 0x864aपूर्ण,
	अणु0x00e5, 0x864bपूर्ण,
	अणु0x00eb, 0x864cपूर्ण,
	अणु0x00f0, 0x864dपूर्ण,
	अणु0x00f6, 0x864eपूर्ण,
	अणु0x00fa, 0x864fपूर्ण,
	अणु0x00ff, 0x8650पूर्ण,
	अणु0x0060, 0x8657पूर्ण,
	अणु0x0010, 0x8658पूर्ण,
	अणु0x0018, 0x8659पूर्ण,
	अणु0x0005, 0x865aपूर्ण,
	अणु0x0018, 0x8660पूर्ण,
	अणु0x0003, 0x8509पूर्ण,
	अणु0x0011, 0x850aपूर्ण,
	अणु0x0032, 0x850bपूर्ण,
	अणु0x0010, 0x850cपूर्ण,
	अणु0x0021, 0x850dपूर्ण,
	अणु0x0001, 0x8500पूर्ण,
	अणु0x0000, 0x8508पूर्ण,
	अणु0x0012, 0x8608पूर्ण,
	अणु0x002c, 0x8609पूर्ण,
	अणु0x0002, 0x860aपूर्ण,
	अणु0x0039, 0x860bपूर्ण,
	अणु0x00d0, 0x860cपूर्ण,
	अणु0x00f7, 0x860dपूर्ण,
	अणु0x00ed, 0x860eपूर्ण,
	अणु0x00db, 0x860fपूर्ण,
	अणु0x0039, 0x8610पूर्ण,
	अणु0x0012, 0x8657पूर्ण,
	अणु0x000c, 0x8619पूर्ण,
	अणु0x0004, 0x861aपूर्ण,
	अणु0x00a1, 0x8656पूर्ण,
	अणु0x00c8, 0x8615पूर्ण,
	अणु0x0032, 0x8616पूर्ण,

	अणु0x0030, 0x8112पूर्ण,
	अणु0x0020, 0x8112पूर्ण,
	अणु0x0020, 0x8112पूर्ण,
	अणु0x000f, 0x8402पूर्ण,
	अणु0x0000, 0x8403पूर्ण,

	अणु0x0090, 0x8110पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0003, 0x8114पूर्ण,
	अणु0x0080, 0x8804पूर्ण,

	अणु0x0003, 0x8801पूर्ण,
	अणु0x0012, 0x8800पूर्ण,
	अणु0x0004, 0x8801पूर्ण,
	अणु0x0005, 0x8800पूर्ण,
	अणु0x0005, 0x8801पूर्ण,
	अणु0x0047, 0x8800पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0007, 0x8801पूर्ण,
	अणु0x00c0, 0x8800पूर्ण,
	अणु0x0008, 0x8801पूर्ण,
	अणु0x0003, 0x8800पूर्ण,
	अणु0x000a, 0x8700पूर्ण,
	अणु0x000e, 0x8801पूर्ण,
	अणु0x0004, 0x8800पूर्ण,
	अणु0x0005, 0x8801पूर्ण,
	अणु0x0047, 0x8800पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0007, 0x8801पूर्ण,
	अणु0x00c0, 0x8800पूर्ण,
	अणु0x0008, 0x8801पूर्ण,
	अणु0x0003, 0x8800पूर्ण,
	अणु0x0013, 0x8801पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	अणु0x0009, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000a, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000b, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000c, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x000e, 0x8801पूर्ण,
	अणु0x0004, 0x8800पूर्ण,
	अणु0x000f, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0010, 0x8801पूर्ण,
	अणु0x0006, 0x8800पूर्ण,
	अणु0x0011, 0x8801पूर्ण,
	अणु0x0006, 0x8800पूर्ण,
	अणु0x0012, 0x8801पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	अणु0x0013, 0x8801पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	अणु0x000a, 0x8700पूर्ण,
	अणु0x0000, 0x8702पूर्ण,
	अणु0x0000, 0x8703पूर्ण,
	अणु0x00c2, 0x8704पूर्ण,
	अणु0x0001, 0x870cपूर्ण,
	अणु0x0044, 0x8600पूर्ण,
	अणु0x0002, 0x8606पूर्ण,
	अणु0x0064, 0x8607पूर्ण,
	अणु0x003a, 0x8601पूर्ण,
	अणु0x0008, 0x8602पूर्ण,
	अणु0x0044, 0x8600पूर्ण,
	अणु0x0018, 0x8617पूर्ण,
	अणु0x0008, 0x8618पूर्ण,
	अणु0x00a1, 0x8656पूर्ण,
	अणु0x0004, 0x865bपूर्ण,
	अणु0x0002, 0x865cपूर्ण,
	अणु0x0058, 0x865dपूर्ण,
	अणु0x0048, 0x865eपूर्ण,
	अणु0x0012, 0x8608पूर्ण,
	अणु0x002c, 0x8609पूर्ण,
	अणु0x0002, 0x860aपूर्ण,
	अणु0x002c, 0x860bपूर्ण,
	अणु0x00db, 0x860cपूर्ण,
	अणु0x00f9, 0x860dपूर्ण,
	अणु0x00f1, 0x860eपूर्ण,
	अणु0x00e3, 0x860fपूर्ण,
	अणु0x002c, 0x8610पूर्ण,
	अणु0x006c, 0x8651पूर्ण,
	अणु0x0041, 0x8652पूर्ण,
	अणु0x0059, 0x8653पूर्ण,
	अणु0x0040, 0x8654पूर्ण,
	अणु0x00fa, 0x8611पूर्ण,
	अणु0x00ff, 0x8612पूर्ण,
	अणु0x00f8, 0x8613पूर्ण,
	अणु0x0000, 0x8614पूर्ण,
	अणु0x0001, 0x863fपूर्ण,
	अणु0x0000, 0x8640पूर्ण,
	अणु0x0026, 0x8641पूर्ण,
	अणु0x0045, 0x8642पूर्ण,
	अणु0x0060, 0x8643पूर्ण,
	अणु0x0075, 0x8644पूर्ण,
	अणु0x0088, 0x8645पूर्ण,
	अणु0x009b, 0x8646पूर्ण,
	अणु0x00b0, 0x8647पूर्ण,
	अणु0x00c5, 0x8648पूर्ण,
	अणु0x00d2, 0x8649पूर्ण,
	अणु0x00dc, 0x864aपूर्ण,
	अणु0x00e5, 0x864bपूर्ण,
	अणु0x00eb, 0x864cपूर्ण,
	अणु0x00f0, 0x864dपूर्ण,
	अणु0x00f6, 0x864eपूर्ण,
	अणु0x00fa, 0x864fपूर्ण,
	अणु0x00ff, 0x8650पूर्ण,
	अणु0x0060, 0x8657पूर्ण,
	अणु0x0010, 0x8658पूर्ण,
	अणु0x0018, 0x8659पूर्ण,
	अणु0x0005, 0x865aपूर्ण,
	अणु0x0018, 0x8660पूर्ण,
	अणु0x0003, 0x8509पूर्ण,
	अणु0x0011, 0x850aपूर्ण,
	अणु0x0032, 0x850bपूर्ण,
	अणु0x0010, 0x850cपूर्ण,
	अणु0x0021, 0x850dपूर्ण,
	अणु0x0001, 0x8500पूर्ण,
	अणु0x0000, 0x8508पूर्ण,

	अणु0x0012, 0x8608पूर्ण,
	अणु0x002c, 0x8609पूर्ण,
	अणु0x0002, 0x860aपूर्ण,
	अणु0x0039, 0x860bपूर्ण,
	अणु0x00d0, 0x860cपूर्ण,
	अणु0x00f7, 0x860dपूर्ण,
	अणु0x00ed, 0x860eपूर्ण,
	अणु0x00db, 0x860fपूर्ण,
	अणु0x0039, 0x8610पूर्ण,
	अणु0x0012, 0x8657पूर्ण,
	अणु0x0064, 0x8619पूर्ण,

/* This line starts it all, it is not needed here */
/* since it has been build पूर्णांकo the driver */
/* jfm: करोn't start now */
/*	अणु0x0030, 0x8112पूर्ण, */
	अणुपूर्ण
पूर्ण;

/*
 * Initialization data क्रम Creative Webcam Vista
 */
अटल स्थिर u16 spca508_vista_init_data[][2] = अणु
	अणु0x0008, 0x8200पूर्ण,	/* Clear रेजिस्टर */
	अणु0x0000, 0x870bपूर्ण,	/* Reset CTL3 */
	अणु0x0020, 0x8112पूर्ण,	/* Video Drop packet enable */
	अणु0x0003, 0x8111पूर्ण,	/* Soft Reset compression, memory, TG & CDSP */
	अणु0x0000, 0x8110पूर्ण,	/* Disable everything */
	अणु0x0000, 0x8114पूर्ण,	/* Software GPIO output data */
	अणु0x0000, 0x8114पूर्ण,

	अणु0x0003, 0x8111पूर्ण,
	अणु0x0000, 0x8111पूर्ण,
	अणु0x0090, 0x8110पूर्ण,    /* Enable: SSI output, External 2X घड़ी output */
	अणु0x0020, 0x8112पूर्ण,
	अणु0x0000, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0001, 0x8114पूर्ण,
	अणु0x0003, 0x8114पूर्ण,

	अणु0x000f, 0x8402पूर्ण,	/* Memory bank Address */
	अणु0x0000, 0x8403पूर्ण,	/* Memory bank Address */
	अणु0x00ba, 0x8804पूर्ण,	/* SSI Slave address */
	अणु0x0010, 0x8802पूर्ण,	/* 93.75kHz SSI Clock Two DataByte */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,	/* Will ग_लिखो 2 bytes (DATA1+DATA2) */
	अणु0x0020, 0x8801पूर्ण,	/* Register address क्रम SSI पढ़ो/ग_लिखो */
	अणु0x0044, 0x8805पूर्ण,	/* DATA2 */
	अणु0x0004, 0x8800पूर्ण,	/* DATA1 -> ग_लिखो triggered */
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0009, 0x8801पूर्ण,
	अणु0x0042, 0x8805पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x003c, 0x8801पूर्ण,
	अणु0x0001, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0001, 0x8801पूर्ण,
	अणु0x000a, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0002, 0x8801पूर्ण,
	अणु0x0000, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0003, 0x8801पूर्ण,
	अणु0x0027, 0x8805पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0004, 0x8801पूर्ण,
	अणु0x0065, 0x8805पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0005, 0x8801पूर्ण,
	अणु0x0003, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0006, 0x8801पूर्ण,
	अणु0x001c, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0007, 0x8801पूर्ण,
	अणु0x002a, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x000e, 0x8801पूर्ण,
	अणु0x0000, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0028, 0x8801पूर्ण,
	अणु0x002e, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0039, 0x8801पूर्ण,
	अणु0x0013, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x003b, 0x8801पूर्ण,
	अणु0x000c, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0035, 0x8801पूर्ण,
	अणु0x0028, 0x8805पूर्ण,
	अणु0x0000, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */
	/* READ अणु 0x0001, 0x8802 पूर्ण -> 0000: 10  */
	अणु0x0010, 0x8802पूर्ण,
	अणु0x0009, 0x8801पूर्ण,
	अणु0x0042, 0x8805पूर्ण,
	अणु0x0001, 0x8800पूर्ण,
	/* READ अणु 0x0001, 0x8803 पूर्ण -> 0000: 00  */

	अणु0x0050, 0x8703पूर्ण,
	अणु0x0002, 0x8704पूर्ण,	/* External input CKIx1 */
	अणु0x0001, 0x870cपूर्ण,	/* Select CKOx2 output */
	अणु0x009a, 0x8600पूर्ण,	/* Line memory Read Counter (L) */
	अणु0x0001, 0x8606पूर्ण,    /* 1 Line memory Read Counter (H) Result: (d)410 */
	अणु0x0023, 0x8601पूर्ण,
	अणु0x0010, 0x8602पूर्ण,
	अणु0x000a, 0x8603पूर्ण,
	अणु0x009a, 0x8600पूर्ण,
	अणु0x0001, 0x865bपूर्ण,	/* 1 Horizontal Offset क्रम Valid Pixel(L) */
	अणु0x0003, 0x865cपूर्ण,	/* Vertical offset क्रम valid lines (L) */
	अणु0x0058, 0x865dपूर्ण,	/* Horizontal valid pixels winकरोw (L) */
	अणु0x0048, 0x865eपूर्ण,	/* Vertical valid lines winकरोw (L) */
	अणु0x0000, 0x865fपूर्ण,

	अणु0x0006, 0x8660पूर्ण,
		    /* Enable nibble data input, select nibble input order */

	अणु0x0013, 0x8608पूर्ण,	/* A11 Coeficients क्रम color correction */
	अणु0x0028, 0x8609पूर्ण,
		    /* Note: these values are confirmed at the end of array */
	अणु0x0005, 0x860aपूर्ण,	/* ... */
	अणु0x0025, 0x860bपूर्ण,
	अणु0x00e1, 0x860cपूर्ण,
	अणु0x00fa, 0x860dपूर्ण,
	अणु0x00f4, 0x860eपूर्ण,
	अणु0x00e8, 0x860fपूर्ण,
	अणु0x0025, 0x8610पूर्ण,	/* A33 Coef. */
	अणु0x00fc, 0x8611पूर्ण,	/* White balance offset: R */
	अणु0x0001, 0x8612पूर्ण,	/* White balance offset: Gr */
	अणु0x00fe, 0x8613पूर्ण,	/* White balance offset: B */
	अणु0x0000, 0x8614पूर्ण,	/* White balance offset: Gb */

	अणु0x0064, 0x8651पूर्ण,	/* R gain क्रम white balance (L) */
	अणु0x0040, 0x8652पूर्ण,	/* Gr gain क्रम white balance (L) */
	अणु0x0066, 0x8653पूर्ण,	/* B gain क्रम white balance (L) */
	अणु0x0040, 0x8654पूर्ण,	/* Gb gain क्रम white balance (L) */
	अणु0x0001, 0x863fपूर्ण,	/* Enable fixed gamma correction */

	अणु0x00a1, 0x8656पूर्ण,	/* Size - Winकरोw1: 256x256, Winकरोw2: 128x128,
				 * UV भागision: UV no change,
				 * Enable New edge enhancement */
	अणु0x0018, 0x8657पूर्ण,	/* Edge gain high threshold */
	अणु0x0020, 0x8658पूर्ण,	/* Edge gain low threshold */
	अणु0x000a, 0x8659पूर्ण,	/* Edge bandwidth high threshold */
	अणु0x0005, 0x865aपूर्ण,	/* Edge bandwidth low threshold */
	अणु0x0064, 0x8607पूर्ण,	/* UV filter enable */

	अणु0x0016, 0x8660पूर्ण,
	अणु0x0000, 0x86b0पूर्ण,	/* Bad pixels compensation address */
	अणु0x00dc, 0x86b1पूर्ण,	/* X coord क्रम bad pixels compensation (L) */
	अणु0x0000, 0x86b2पूर्ण,
	अणु0x0009, 0x86b3पूर्ण,	/* Y coord क्रम bad pixels compensation (L) */
	अणु0x0000, 0x86b4पूर्ण,

	अणु0x0001, 0x86b0पूर्ण,
	अणु0x00f5, 0x86b1पूर्ण,
	अणु0x0000, 0x86b2पूर्ण,
	अणु0x00c6, 0x86b3पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,

	अणु0x0002, 0x86b0पूर्ण,
	अणु0x001c, 0x86b1पूर्ण,
	अणु0x0001, 0x86b2पूर्ण,
	अणु0x00d7, 0x86b3पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,

	अणु0x0003, 0x86b0पूर्ण,
	अणु0x001c, 0x86b1पूर्ण,
	अणु0x0001, 0x86b2पूर्ण,
	अणु0x00d8, 0x86b3पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,

	अणु0x0004, 0x86b0पूर्ण,
	अणु0x001d, 0x86b1पूर्ण,
	अणु0x0001, 0x86b2पूर्ण,
	अणु0x00d8, 0x86b3पूर्ण,
	अणु0x0000, 0x86b4पूर्ण,
	अणु0x001e, 0x8660पूर्ण,

	/* READ अणु 0x0000, 0x8608 पूर्ण -> 0000: 13  */
	/* READ अणु 0x0000, 0x8609 पूर्ण -> 0000: 28  */
	/* READ अणु 0x0000, 0x8610 पूर्ण -> 0000: 05  */
	/* READ अणु 0x0000, 0x8611 पूर्ण -> 0000: 25  */
	/* READ अणु 0x0000, 0x8612 पूर्ण -> 0000: e1  */
	/* READ अणु 0x0000, 0x8613 पूर्ण -> 0000: fa  */
	/* READ अणु 0x0000, 0x8614 पूर्ण -> 0000: f4  */
	/* READ अणु 0x0000, 0x8615 पूर्ण -> 0000: e8  */
	/* READ अणु 0x0000, 0x8616 पूर्ण -> 0000: 25  */
	अणुपूर्ण
पूर्ण;

अटल पूर्णांक reg_ग_लिखो(काष्ठा gspca_dev *gspca_dev, u16 index, u16 value)
अणु
	पूर्णांक ret;
	काष्ठा usb_device *dev = gspca_dev->dev;

	ret = usb_control_msg(dev,
			usb_sndctrlpipe(dev, 0),
			0,		/* request */
			USB_TYPE_VENDOR | USB_RECIP_DEVICE,
			value, index, शून्य, 0, 500);
	gspca_dbg(gspca_dev, D_USBO, "reg write i:0x%04x = 0x%02x\n",
		  index, value);
	अगर (ret < 0)
		pr_err("reg write: error %d\n", ret);
	वापस ret;
पूर्ण

/* पढ़ो 1 byte */
/* वापसs: negative is error, pos or zero is data */
अटल पूर्णांक reg_पढ़ो(काष्ठा gspca_dev *gspca_dev,
			u16 index)	/* wIndex */
अणु
	पूर्णांक ret;

	ret = usb_control_msg(gspca_dev->dev,
			usb_rcvctrlpipe(gspca_dev->dev, 0),
			0,			/* रेजिस्टर */
			USB_सूची_IN | USB_TYPE_VENDOR | USB_RECIP_DEVICE,
			0,		/* value */
			index,
			gspca_dev->usb_buf, 1,
			500);			/* समयout */
	gspca_dbg(gspca_dev, D_USBI, "reg read i:%04x --> %02x\n",
		  index, gspca_dev->usb_buf[0]);
	अगर (ret < 0) अणु
		pr_err("reg_read err %d\n", ret);
		वापस ret;
	पूर्ण
	वापस gspca_dev->usb_buf[0];
पूर्ण

/* send 1 or 2 bytes to the sensor via the Synchronous Serial Interface */
अटल पूर्णांक ssi_w(काष्ठा gspca_dev *gspca_dev,
		u16 reg, u16 val)
अणु
	पूर्णांक ret, retry;

	ret = reg_ग_लिखो(gspca_dev, 0x8802, reg >> 8);
	अगर (ret < 0)
		जाओ out;
	ret = reg_ग_लिखो(gspca_dev, 0x8801, reg & 0x00ff);
	अगर (ret < 0)
		जाओ out;
	अगर ((reg & 0xff00) == 0x1000) अणु		/* अगर 2 bytes */
		ret = reg_ग_लिखो(gspca_dev, 0x8805, val & 0x00ff);
		अगर (ret < 0)
			जाओ out;
		val >>= 8;
	पूर्ण
	ret = reg_ग_लिखो(gspca_dev, 0x8800, val);
	अगर (ret < 0)
		जाओ out;

	/* poll until not busy */
	retry = 10;
	क्रम (;;) अणु
		ret = reg_पढ़ो(gspca_dev, 0x8803);
		अगर (ret < 0)
			अवरोध;
		अगर (gspca_dev->usb_buf[0] == 0)
			अवरोध;
		अगर (--retry <= 0) अणु
			gspca_err(gspca_dev, "ssi_w busy %02x\n",
				  gspca_dev->usb_buf[0]);
			ret = -1;
			अवरोध;
		पूर्ण
		msleep(8);
	पूर्ण

out:
	वापस ret;
पूर्ण

अटल पूर्णांक ग_लिखो_vector(काष्ठा gspca_dev *gspca_dev,
			स्थिर u16 (*data)[2])
अणु
	पूर्णांक ret = 0;

	जबतक ((*data)[1] != 0) अणु
		अगर ((*data)[1] & 0x8000) अणु
			अगर ((*data)[1] == 0xdd00)	/* delay */
				msleep((*data)[0]);
			अन्यथा
				ret = reg_ग_लिखो(gspca_dev, (*data)[1],
								(*data)[0]);
		पूर्ण अन्यथा अणु
			ret = ssi_w(gspca_dev, (*data)[1], (*data)[0]);
		पूर्ण
		अगर (ret < 0)
			अवरोध;
		data++;
	पूर्ण
	वापस ret;
पूर्ण

/* this function is called at probe समय */
अटल पूर्णांक sd_config(काष्ठा gspca_dev *gspca_dev,
			स्थिर काष्ठा usb_device_id *id)
अणु
	काष्ठा sd *sd = (काष्ठा sd *) gspca_dev;
	काष्ठा cam *cam;
	स्थिर u16 (*init_data)[2];
	अटल स्थिर u16 (*(init_data_tb[]))[2] = अणु
		spca508_vista_init_data,	/* CreativeVista 0 */
		spca508_sightcam_init_data,	/* HamaUSBSightcam 1 */
		spca508_sightcam2_init_data,	/* HamaUSBSightcam2 2 */
		spca508cs110_init_data,		/* IntelEasyPCCamera 3 */
		spca508cs110_init_data,		/* MicroInnovationIC200 4 */
		spca508_init_data,		/* ViewQuestVQ110 5 */
	पूर्ण;
	पूर्णांक data1, data2;

	/* Read from global रेजिस्टर the USB product and venकरोr IDs, just to
	 * prove that we can communicate with the device.  This works, which
	 * confirms at we are communicating properly and that the device
	 * is a 508. */
	data1 = reg_पढ़ो(gspca_dev, 0x8104);
	data2 = reg_पढ़ो(gspca_dev, 0x8105);
	gspca_dbg(gspca_dev, D_PROBE, "Webcam Vendor ID: 0x%02x%02x\n",
		  data2, data1);

	data1 = reg_पढ़ो(gspca_dev, 0x8106);
	data2 = reg_पढ़ो(gspca_dev, 0x8107);
	gspca_dbg(gspca_dev, D_PROBE, "Webcam Product ID: 0x%02x%02x\n",
		  data2, data1);

	data1 = reg_पढ़ो(gspca_dev, 0x8621);
	gspca_dbg(gspca_dev, D_PROBE, "Window 1 average luminance: %d\n",
		  data1);

	cam = &gspca_dev->cam;
	cam->cam_mode = sअगर_mode;
	cam->nmodes = ARRAY_SIZE(sअगर_mode);

	sd->subtype = id->driver_info;

	init_data = init_data_tb[sd->subtype];
	वापस ग_लिखो_vector(gspca_dev, init_data);
पूर्ण

/* this function is called at probe and resume समय */
अटल पूर्णांक sd_init(काष्ठा gspca_dev *gspca_dev)
अणु
	वापस 0;
पूर्ण

अटल पूर्णांक sd_start(काष्ठा gspca_dev *gspca_dev)
अणु
	पूर्णांक mode;

	mode = gspca_dev->cam.cam_mode[gspca_dev->curr_mode].priv;
	reg_ग_लिखो(gspca_dev, 0x8500, mode);
	चयन (mode) अणु
	हाल 0:
	हाल 1:
		reg_ग_लिखो(gspca_dev, 0x8700, 0x28); /* घड़ी */
		अवरोध;
	शेष:
/*	हाल 2: */
/*	हाल 3: */
		reg_ग_लिखो(gspca_dev, 0x8700, 0x23); /* घड़ी */
		अवरोध;
	पूर्ण
	reg_ग_लिखो(gspca_dev, 0x8112, 0x10 | 0x20);
	वापस 0;
पूर्ण

अटल व्योम sd_stopN(काष्ठा gspca_dev *gspca_dev)
अणु
	/* Video ISO disable, Video Drop Packet enable: */
	reg_ग_लिखो(gspca_dev, 0x8112, 0x20);
पूर्ण

अटल व्योम sd_pkt_scan(काष्ठा gspca_dev *gspca_dev,
			u8 *data,			/* isoc packet */
			पूर्णांक len)			/* iso packet length */
अणु
	चयन (data[0]) अणु
	हाल 0:				/* start of frame */
		gspca_frame_add(gspca_dev, LAST_PACKET, शून्य, 0);
		data += SPCA508_OFFSET_DATA;
		len -= SPCA508_OFFSET_DATA;
		gspca_frame_add(gspca_dev, FIRST_PACKET, data, len);
		अवरोध;
	हाल 0xff:			/* drop */
		अवरोध;
	शेष:
		data += 1;
		len -= 1;
		gspca_frame_add(gspca_dev, INTER_PACKET, data, len);
		अवरोध;
	पूर्ण
पूर्ण

अटल व्योम setbrightness(काष्ठा gspca_dev *gspca_dev, s32 brightness)
अणु
	/* MX seem contrast */
	reg_ग_लिखो(gspca_dev, 0x8651, brightness);
	reg_ग_लिखो(gspca_dev, 0x8652, brightness);
	reg_ग_लिखो(gspca_dev, 0x8653, brightness);
	reg_ग_लिखो(gspca_dev, 0x8654, brightness);
पूर्ण

अटल पूर्णांक sd_s_ctrl(काष्ठा v4l2_ctrl *ctrl)
अणु
	काष्ठा gspca_dev *gspca_dev =
		container_of(ctrl->handler, काष्ठा gspca_dev, ctrl_handler);

	gspca_dev->usb_err = 0;

	अगर (!gspca_dev->streaming)
		वापस 0;

	चयन (ctrl->id) अणु
	हाल V4L2_CID_BRIGHTNESS:
		setbrightness(gspca_dev, ctrl->val);
		अवरोध;
	पूर्ण
	वापस gspca_dev->usb_err;
पूर्ण

अटल स्थिर काष्ठा v4l2_ctrl_ops sd_ctrl_ops = अणु
	.s_ctrl = sd_s_ctrl,
पूर्ण;

अटल पूर्णांक sd_init_controls(काष्ठा gspca_dev *gspca_dev)
अणु
	काष्ठा v4l2_ctrl_handler *hdl = &gspca_dev->ctrl_handler;

	gspca_dev->vdev.ctrl_handler = hdl;
	v4l2_ctrl_handler_init(hdl, 5);
	v4l2_ctrl_new_std(hdl, &sd_ctrl_ops,
			V4L2_CID_BRIGHTNESS, 0, 255, 1, 128);

	अगर (hdl->error) अणु
		pr_err("Could not initialize controls\n");
		वापस hdl->error;
	पूर्ण
	वापस 0;
पूर्ण

/* sub-driver description */
अटल स्थिर काष्ठा sd_desc sd_desc = अणु
	.name = MODULE_NAME,
	.config = sd_config,
	.init = sd_init,
	.init_controls = sd_init_controls,
	.start = sd_start,
	.stopN = sd_stopN,
	.pkt_scan = sd_pkt_scan,
पूर्ण;

/* -- module initialisation -- */
अटल स्थिर काष्ठा usb_device_id device_table[] = अणु
	अणुUSB_DEVICE(0x0130, 0x0130), .driver_info = HamaUSBSightcamपूर्ण,
	अणुUSB_DEVICE(0x041e, 0x4018), .driver_info = CreativeVistaपूर्ण,
	अणुUSB_DEVICE(0x0733, 0x0110), .driver_info = ViewQuestVQ110पूर्ण,
	अणुUSB_DEVICE(0x0af9, 0x0010), .driver_info = HamaUSBSightcamपूर्ण,
	अणुUSB_DEVICE(0x0af9, 0x0011), .driver_info = HamaUSBSightcam2पूर्ण,
	अणुUSB_DEVICE(0x8086, 0x0110), .driver_info = IntelEasyPCCameraपूर्ण,
	अणुपूर्ण
पूर्ण;
MODULE_DEVICE_TABLE(usb, device_table);

/* -- device connect -- */
अटल पूर्णांक sd_probe(काष्ठा usb_पूर्णांकerface *पूर्णांकf,
			स्थिर काष्ठा usb_device_id *id)
अणु
	वापस gspca_dev_probe(पूर्णांकf, id, &sd_desc, माप(काष्ठा sd),
				THIS_MODULE);
पूर्ण

अटल काष्ठा usb_driver sd_driver = अणु
	.name = MODULE_NAME,
	.id_table = device_table,
	.probe = sd_probe,
	.disconnect = gspca_disconnect,
#अगर_घोषित CONFIG_PM
	.suspend = gspca_suspend,
	.resume = gspca_resume,
	.reset_resume = gspca_resume,
#पूर्ण_अगर
पूर्ण;

module_usb_driver(sd_driver);
