<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _PA_STRING_H_
#घोषणा _PA_STRING_H_

#घोषणा __HAVE_ARCH_MEMSET
बाह्य व्योम * स_रखो(व्योम *, पूर्णांक, माप_प्रकार);

#घोषणा __HAVE_ARCH_MEMCPY
व्योम * स_नकल(व्योम * dest,स्थिर व्योम *src,माप_प्रकार count);

#घोषणा __HAVE_ARCH_STRLEN
बाह्य माप_प्रकार म_माप(स्थिर अक्षर *s);

#घोषणा __HAVE_ARCH_STRCPY
बाह्य अक्षर *म_नकल(अक्षर *dest, स्थिर अक्षर *src);

#घोषणा __HAVE_ARCH_STRNCPY
बाह्य अक्षर *म_नकलन(अक्षर *dest, स्थिर अक्षर *src, माप_प्रकार count);

#घोषणा __HAVE_ARCH_STRCAT
बाह्य अक्षर *म_जोड़ो(अक्षर *dest, स्थिर अक्षर *src);

#घोषणा __HAVE_ARCH_MEMSET
बाह्य व्योम *स_रखो(व्योम *, पूर्णांक, माप_प्रकार);

#पूर्ण_अगर
