<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 WITH Linux-syscall-note */

#अगर_अघोषित _CSKY_PTRACE_H
#घोषणा _CSKY_PTRACE_H

#अगर_अघोषित __ASSEMBLY__

काष्ठा pt_regs अणु
	अचिन्हित दीर्घ	tls;
	अचिन्हित दीर्घ	lr;
	अचिन्हित दीर्घ	pc;
	अचिन्हित दीर्घ	sr;
	अचिन्हित दीर्घ	usp;

	/*
	 * a0, a1, a2, a3:
	 * abiv1: r2, r3, r4, r5
	 * abiv2: r0, r1, r2, r3
	 */
	अचिन्हित दीर्घ	orig_a0;
	अचिन्हित दीर्घ	a0;
	अचिन्हित दीर्घ	a1;
	अचिन्हित दीर्घ	a2;
	अचिन्हित दीर्घ	a3;

	/*
	 * ABIV2: r4 ~ r13
	 * ABIV1: r6 ~ r14, r1
	 */
	अचिन्हित दीर्घ	regs[10];

#अगर defined(__CSKYABIV2__)
	/* r16 ~ r30 */
	अचिन्हित दीर्घ	exregs[15];

	अचिन्हित दीर्घ	rhi;
	अचिन्हित दीर्घ	rlo;
	अचिन्हित दीर्घ	dcsr;
#पूर्ण_अगर
पूर्ण;

काष्ठा user_fp अणु
	अचिन्हित दीर्घ	vr[96];
	अचिन्हित दीर्घ	fcr;
	अचिन्हित दीर्घ	fesr;
	अचिन्हित दीर्घ	fid;
	अचिन्हित दीर्घ	reserved;
पूर्ण;

#पूर्ण_अगर /* __ASSEMBLY__ */
#पूर्ण_अगर /* _CSKY_PTRACE_H */
