<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0
/*
 * Copyright (C) 2018 Texas Instruments Incorporated - https://www.ti.com/
 * Author: Jyri Sarha <jsarha@ti.com>
 */

#समावेश <linux/device.h>
#समावेश <linux/kernel.h>

#समावेश "tidss_scale_coefs.h"

/*
 * These are पूर्णांकerpolated with a custom python script from DSS5
 * (drivers/gpu/drm/omapdrm/dss/dispc_coef.c) coefficients.
 */
अटल स्थिर काष्ठा tidss_scale_coefs coef5_m32 = अणु
	.c2 = अणु 28, 34, 40, 46, 52, 58, 64, 70, 0, 2, 4, 8, 12, 16, 20, 24, पूर्ण,
	.c1 = अणु 132, 138, 144, 150, 156, 162, 168, 174, 76, 84, 92, 98, 104, 110, 116, 124, पूर्ण,
	.c0 = अणु 192, 192, 192, 190, 188, 186, 184, 182, 180, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m26 = अणु
	.c2 = अणु 24, 28, 32, 38, 44, 50, 56, 64, 0, 2, 4, 6, 8, 12, 16, 20, पूर्ण,
	.c1 = अणु 132, 138, 144, 152, 160, 166, 172, 178, 72, 80, 88, 94, 100, 108, 116, 124, पूर्ण,
	.c0 = अणु 200, 202, 204, 202, 200, 196, 192, 188, 184, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m22 = अणु
	.c2 = अणु 16, 20, 24, 30, 36, 42, 48, 56, 0, 0, 0, 2, 4, 8, 12, 14, पूर्ण,
	.c1 = अणु 132, 140, 148, 156, 164, 172, 180, 186, 64, 72, 80, 88, 96, 104, 112, 122, पूर्ण,
	.c0 = अणु 216, 216, 216, 214, 212, 208, 204, 198, 192, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m19 = अणु
	.c2 = अणु 12, 14, 16, 22, 28, 34, 40, 48, 0, 0, 0, 2, 4, 4, 4, 8, पूर्ण,
	.c1 = अणु 128, 140, 152, 160, 168, 176, 184, 192, 56, 64, 72, 82, 92, 100, 108, 118, पूर्ण,
	.c0 = अणु 232, 232, 232, 226, 220, 218, 216, 208, 200, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m16 = अणु
	.c2 = अणु 0, 2, 4, 8, 12, 18, 24, 32, 0, 0, 0, -2, -4, -4, -4, -2, पूर्ण,
	.c1 = अणु 124, 138, 152, 164, 176, 186, 196, 206, 40, 48, 56, 68, 80, 90, 100, 112, पूर्ण,
	.c0 = अणु 264, 262, 260, 254, 248, 242, 236, 226, 216, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m14 = अणु
	.c2 = अणु -8, -6, -4, -2, 0, 6, 12, 18, 0, -2, -4, -6, -8, -8, -8, -8, पूर्ण,
	.c1 = अणु 120, 134, 148, 164, 180, 194, 208, 220, 24, 32, 40, 52, 64, 78, 92, 106, पूर्ण,
	.c0 = अणु 288, 286, 284, 280, 276, 266, 256, 244, 232, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m13 = अणु
	.c2 = अणु -12, -12, -12, -10, -8, -4, 0, 6, 0, -2, -4, -6, -8, -10, -12, -12, पूर्ण,
	.c1 = अणु 112, 130, 148, 164, 180, 196, 212, 228, 12, 22, 32, 44, 56, 70, 84, 98, पूर्ण,
	.c0 = अणु 312, 308, 304, 298, 292, 282, 272, 258, 244, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m12 = अणु
	.c2 = अणु -16, -18, -20, -18, -16, -14, -12, -6, 0, -2, -4, -6, -8, -10, -12, -14, पूर्ण,
	.c1 = अणु 104, 124, 144, 164, 184, 202, 220, 238, 0, 10, 20, 30, 40, 56, 72, 88, पूर्ण,
	.c0 = अणु 336, 332, 328, 320, 312, 300, 288, 272, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m11 = अणु
	.c2 = अणु -20, -22, -24, -24, -24, -24, -24, -20, 0, -2, -4, -6, -8, -10, -12, -16, पूर्ण,
	.c1 = अणु 92, 114, 136, 158, 180, 204, 228, 250, -16, -8, 0, 12, 24, 38, 52, 72, पूर्ण,
	.c0 = अणु 368, 364, 360, 350, 340, 326, 312, 292, 272, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m10 = अणु
	.c2 = अणु -16, -20, -24, -28, -32, -34, -36, -34, 0, 0, 0, -2, -4, -8, -12, -14, पूर्ण,
	.c1 = अणु 72, 96, 120, 148, 176, 204, 232, 260, -32, -26, -20, -10, 0, 16, 32, 52, पूर्ण,
	.c0 = अणु 400, 398, 396, 384, 372, 354, 336, 312, 288, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m9 = अणु
	.c2 = अणु -12, -18, -24, -28, -32, -38, -44, -46, 0, 2, 4, 2, 0, -2, -4, -8, पूर्ण,
	.c1 = अणु 40, 68, 96, 128, 160, 196, 232, 268, -48, -46, -44, -36, -28, -14, 0, 20, पूर्ण,
	.c0 = अणु 456, 450, 444, 428, 412, 388, 364, 334, 304, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef5_m8 = अणु
	.c2 = अणु 0, -4, -8, -16, -24, -32, -40, -48, 0, 2, 4, 6, 8, 6, 4, 2, पूर्ण,
	.c1 = अणु 0, 28, 56, 94, 132, 176, 220, 266, -56, -60, -64, -62, -60, -50, -40, -20, पूर्ण,
	.c0 = अणु 512, 506, 500, 478, 456, 424, 392, 352, 312, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m32 = अणु
	.c1 = अणु 108, 92, 76, 62, 48, 36, 24, 140, 256, 236, 216, 198, 180, 162, 144, 126, पूर्ण,
	.c0 = अणु 296, 294, 292, 288, 284, 278, 272, 136, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m26 = अणु
	.c1 = अणु 104, 90, 76, 60, 44, 32, 20, 138, 256, 236, 216, 198, 180, 160, 140, 122, पूर्ण,
	.c0 = अणु 304, 300, 296, 292, 288, 282, 276, 138, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m22 = अणु
	.c1 = अणु 100, 84, 68, 54, 40, 30, 20, 138, 256, 236, 216, 196, 176, 156, 136, 118, पूर्ण,
	.c0 = अणु 312, 310, 308, 302, 296, 286, 276, 138, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m19 = अणु
	.c1 = अणु 96, 80, 64, 50, 36, 26, 16, 136, 256, 236, 216, 194, 172, 152, 132, 114, पूर्ण,
	.c0 = अणु 320, 318, 316, 310, 304, 292, 280, 140, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m16 = अणु
	.c1 = अणु 88, 72, 56, 44, 32, 22, 12, 134, 256, 234, 212, 190, 168, 148, 128, 108, पूर्ण,
	.c0 = अणु 336, 332, 328, 320, 312, 300, 288, 144, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m14 = अणु
	.c1 = अणु 80, 64, 48, 36, 24, 16, 8, 132, 256, 232, 208, 186, 164, 142, 120, 100, पूर्ण,
	.c0 = अणु 352, 348, 344, 334, 324, 310, 296, 148, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m13 = अणु
	.c1 = अणु 72, 56, 40, 30, 20, 12, 4, 130, 256, 232, 208, 184, 160, 136, 112, 92, पूर्ण,
	.c0 = अणु 368, 364, 360, 346, 332, 316, 300, 150, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m12 = अणु
	.c1 = अणु 64, 50, 36, 26, 16, 10, 4, 130, 256, 230, 204, 178, 152, 128, 104, 84, पूर्ण,
	.c0 = अणु 384, 378, 372, 358, 344, 324, 304, 152, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m11 = अणु
	.c1 = अणु 56, 40, 24, 16, 8, 4, 0, 128, 256, 228, 200, 172, 144, 120, 96, 76, पूर्ण,
	.c0 = अणु 400, 396, 392, 376, 360, 336, 312, 156, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m10 = अणु
	.c1 = अणु 40, 26, 12, 6, 0, -2, -4, 126, 256, 226, 196, 166, 136, 110, 84, 62, पूर्ण,
	.c0 = अणु 432, 424, 416, 396, 376, 348, 320, 160, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m9 = अणु
	.c1 = अणु 24, 12, 0, -4, -8, -8, -8, 124, 256, 222, 188, 154, 120, 92, 64, 44, पूर्ण,
	.c0 = अणु 464, 456, 448, 424, 400, 366, 332, 166, 256, पूर्ण,
पूर्ण;

अटल स्थिर काष्ठा tidss_scale_coefs coef3_m8 = अणु
	.c1 = अणु 0, -8, -16, -16, -16, -12, -8, 124, 256, 214, 172, 134, 96, 66, 36, 18, पूर्ण,
	.c0 = अणु 512, 502, 492, 462, 432, 390, 348, 174, 256, पूर्ण,
पूर्ण;

स्थिर काष्ठा tidss_scale_coefs *tidss_get_scale_coefs(काष्ठा device *dev,
						      u32 firinc,
						      bool five_taps)
अणु
	पूर्णांक i;
	पूर्णांक inc;
	अटल स्थिर काष्ठा अणु
		पूर्णांक mmin;
		पूर्णांक mmax;
		स्थिर काष्ठा tidss_scale_coefs *coef3;
		स्थिर काष्ठा tidss_scale_coefs *coef5;
		स्थिर अक्षर *name;
	पूर्ण coefs[] = अणु
		अणु 27, 32, &coef3_m32, &coef5_m32, "M32" पूर्ण,
		अणु 23, 26, &coef3_m26, &coef5_m26, "M26" पूर्ण,
		अणु 20, 22, &coef3_m22, &coef5_m22, "M22" पूर्ण,
		अणु 17, 19, &coef3_m19, &coef5_m19, "M19" पूर्ण,
		अणु 15, 16, &coef3_m16, &coef5_m16, "M16" पूर्ण,
		अणु 14, 14, &coef3_m14, &coef5_m14, "M14" पूर्ण,
		अणु 13, 13, &coef3_m13, &coef5_m13, "M13" पूर्ण,
		अणु 12, 12, &coef3_m12, &coef5_m12, "M12" पूर्ण,
		अणु 11, 11, &coef3_m11, &coef5_m11, "M11" पूर्ण,
		अणु 10, 10, &coef3_m10, &coef5_m10, "M10" पूर्ण,
		अणु  9,  9, &coef3_m9, &coef5_m9, "M9" पूर्ण,
		अणु  4,  8, &coef3_m8, &coef5_m8, "M8" पूर्ण,
		/*
		 * When upscaling more than two बार, blockiness and outlines
		 * around the image are observed when M8 tables are used. M11,
		 * M16 and M19 tables are used to prevent this.
		 */
		अणु  3,  3, &coef3_m11, &coef5_m11, "M11" पूर्ण,
		अणु  2,  2, &coef3_m16, &coef5_m16, "M16" पूर्ण,
		अणु  0,  1, &coef3_m19, &coef5_m19, "M19" पूर्ण,
	पूर्ण;

	/*
	 * inc is result of 0x200000 * in_size / out_size. This भागiding
	 * by 0x40000 scales it करोwn to 8 * in_size / out_size. After
	 * भागision the actual scaling factor is 8/inc.
	 */
	inc = firinc / 0x40000;
	क्रम (i = 0; i < ARRAY_SIZE(coefs); ++i) अणु
		अगर (inc >= coefs[i].mmin && inc <= coefs[i].mmax) अणु
			अगर (five_taps)
				वापस coefs[i].coef5;
			अन्यथा
				वापस coefs[i].coef3;
		पूर्ण
	पूर्ण

	dev_err(dev, "%s: Coefficients not found for firinc 0x%08x, inc %d\n",
		__func__, firinc, inc);

	वापस शून्य;
पूर्ण
