<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0
#घोषणा _GNU_SOURCE
#समावेश <त्रुटिसं.स>
#समावेश <fcntl.h>
#समावेश <सीमा.स>
#समावेश <मानकपन.स>
#समावेश <मानककोष.स>
#समावेश <unistd.h>
#समावेश <sys/types.h>
#समावेश <sys/स्थिति.स>

पूर्णांक मुख्य(पूर्णांक argc, अक्षर *argv[])
अणु
	पूर्णांक fd;
	माप_प्रकार size;
	sमाप_प्रकार spliced;

	अगर (argc < 2) अणु
		ख_लिखो(मानक_त्रुटि, "Usage: %s INPUT [BYTES]\n", argv[0]);
		वापस निकास_त्रुटि;
	पूर्ण

	fd = खोलो(argv[1], O_RDONLY);
	अगर (fd < 0) अणु
		लिखो_त्रुटि(argv[1]);
		वापस निकास_त्रुटि;
	पूर्ण

	अगर (argc == 3)
		size = म_से_द(argv[2]);
	अन्यथा अणु
		काष्ठा stat statbuf;

		अगर (ख_स्थिति(fd, &statbuf) < 0) अणु
			लिखो_त्रुटि(argv[1]);
			वापस निकास_त्रुटि;
		पूर्ण

		अगर (statbuf.st_size > पूर्णांक_उच्च) अणु
			ख_लिखो(मानक_त्रुटि, "%s: Too big\n", argv[1]);
			वापस निकास_त्रुटि;
		पूर्ण

		size = statbuf.st_size;
	पूर्ण

	/* splice(2) file to मानक_निकास. */
	spliced = splice(fd, शून्य, STDOUT_खाताNO, शून्य,
		      size, SPLICE_F_MOVE);
	अगर (spliced < 0) अणु
		लिखो_त्रुटि("splice");
		वापस निकास_त्रुटि;
	पूर्ण

	बंद(fd);
	वापस निकास_सफल;
पूर्ण
