<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-only */
/*
 *
 * Copyright (C) 2010 John Crispin <john@phrozen.org>
 */

#अगर_अघोषित _LTQ_CLK_H__
#घोषणा _LTQ_CLK_H__

#समावेश <linux/clkdev.h>

/* घड़ी speeds */
#घोषणा CLOCK_33M	33333333
#घोषणा CLOCK_60M	60000000
#घोषणा CLOCK_62_5M	62500000
#घोषणा CLOCK_83M	83333333
#घोषणा CLOCK_83_5M	83500000
#घोषणा CLOCK_98_304M	98304000
#घोषणा CLOCK_100M	100000000
#घोषणा CLOCK_111M	111111111
#घोषणा CLOCK_125M	125000000
#घोषणा CLOCK_133M	133333333
#घोषणा CLOCK_150M	150000000
#घोषणा CLOCK_166M	166666666
#घोषणा CLOCK_167M	166666667
#घोषणा CLOCK_196_608M	196608000
#घोषणा CLOCK_200M	200000000
#घोषणा CLOCK_222M	222000000
#घोषणा CLOCK_240M	240000000
#घोषणा CLOCK_250M	250000000
#घोषणा CLOCK_266M	266666666
#घोषणा CLOCK_288M	288888888
#घोषणा CLOCK_300M	300000000
#घोषणा CLOCK_333M	333333333
#घोषणा CLOCK_360M	360000000
#घोषणा CLOCK_393M	393215332
#घोषणा CLOCK_400M	400000000
#घोषणा CLOCK_432M	432000000
#घोषणा CLOCK_450M	450000000
#घोषणा CLOCK_500M	500000000
#घोषणा CLOCK_600M	600000000
#घोषणा CLOCK_666M	666666666
#घोषणा CLOCK_720M	720000000

/* घड़ी out speeds */
#घोषणा CLOCK_32_768K	32768
#घोषणा CLOCK_1_536M	1536000
#घोषणा CLOCK_2_5M	2500000
#घोषणा CLOCK_12M	12000000
#घोषणा CLOCK_24M	24000000
#घोषणा CLOCK_25M	25000000
#घोषणा CLOCK_30M	30000000
#घोषणा CLOCK_40M	40000000
#घोषणा CLOCK_48M	48000000
#घोषणा CLOCK_50M	50000000
#घोषणा CLOCK_60M	60000000

काष्ठा clk अणु
	काष्ठा clk_lookup cl;
	अचिन्हित दीर्घ rate;
	अचिन्हित दीर्घ *rates;
	अचिन्हित पूर्णांक module;
	अचिन्हित पूर्णांक bits;
	अचिन्हित दीर्घ (*get_rate) (व्योम);
	पूर्णांक (*enable) (काष्ठा clk *clk);
	व्योम (*disable) (काष्ठा clk *clk);
	पूर्णांक (*activate) (काष्ठा clk *clk);
	व्योम (*deactivate) (काष्ठा clk *clk);
	व्योम (*reboot) (काष्ठा clk *clk);
पूर्ण;

बाह्य व्योम clkdev_add_अटल(अचिन्हित दीर्घ cpu, अचिन्हित दीर्घ fpi,
				अचिन्हित दीर्घ io, अचिन्हित दीर्घ ppe);

बाह्य अचिन्हित दीर्घ ltq_danube_cpu_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_danube_fpi_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_danube_pp32_hz(व्योम);

बाह्य अचिन्हित दीर्घ ltq_ar9_cpu_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_ar9_fpi_hz(व्योम);

बाह्य अचिन्हित दीर्घ ltq_vr9_cpu_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_vr9_fpi_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_vr9_pp32_hz(व्योम);

बाह्य अचिन्हित दीर्घ ltq_ar10_cpu_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_ar10_fpi_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_ar10_pp32_hz(व्योम);

बाह्य अचिन्हित दीर्घ ltq_grx390_cpu_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_grx390_fpi_hz(व्योम);
बाह्य अचिन्हित दीर्घ ltq_grx390_pp32_hz(व्योम);

#पूर्ण_अगर
