<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित __AR2315_H
#घोषणा __AR2315_H

#अगर_घोषित CONFIG_SOC_AR2315

व्योम ar2315_arch_init_irq(व्योम);
व्योम ar2315_init_devices(व्योम);
व्योम ar2315_plat_समय_init(व्योम);
व्योम ar2315_plat_mem_setup(व्योम);
व्योम ar2315_arch_init(व्योम);

#अन्यथा

अटल अंतरभूत व्योम ar2315_arch_init_irq(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar2315_init_devices(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar2315_plat_समय_init(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar2315_plat_mem_setup(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar2315_arch_init(व्योम) अणुपूर्ण

#पूर्ण_अगर

#पूर्ण_अगर	/* __AR2315_H */
