<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित __AR5312_H
#घोषणा __AR5312_H

#अगर_घोषित CONFIG_SOC_AR5312

व्योम ar5312_arch_init_irq(व्योम);
व्योम ar5312_init_devices(व्योम);
व्योम ar5312_plat_समय_init(व्योम);
व्योम ar5312_plat_mem_setup(व्योम);
व्योम ar5312_arch_init(व्योम);

#अन्यथा

अटल अंतरभूत व्योम ar5312_arch_init_irq(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar5312_init_devices(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar5312_plat_समय_init(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar5312_plat_mem_setup(व्योम) अणुपूर्ण
अटल अंतरभूत व्योम ar5312_arch_init(व्योम) अणुपूर्ण

#पूर्ण_अगर

#पूर्ण_अगर	/* __AR5312_H */
