<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _PPC_BOOT_SWAB_H_
#घोषणा _PPC_BOOT_SWAB_H_

अटल अंतरभूत u16 swab16(u16 x)
अणु
	वापस  ((x & (u16)0x00ffU) << 8) |
		((x & (u16)0xff00U) >> 8);
पूर्ण

अटल अंतरभूत u32 swab32(u32 x)
अणु
	वापस  ((x & (u32)0x000000ffUL) << 24) |
		((x & (u32)0x0000ff00UL) <<  8) |
		((x & (u32)0x00ff0000UL) >>  8) |
		((x & (u32)0xff000000UL) >> 24);
पूर्ण

अटल अंतरभूत u64 swab64(u64 x)
अणु
	वापस  (u64)((x & (u64)0x00000000000000ffULL) << 56) |
		(u64)((x & (u64)0x000000000000ff00ULL) << 40) |
		(u64)((x & (u64)0x0000000000ff0000ULL) << 24) |
		(u64)((x & (u64)0x00000000ff000000ULL) <<  8) |
		(u64)((x & (u64)0x000000ff00000000ULL) >>  8) |
		(u64)((x & (u64)0x0000ff0000000000ULL) >> 24) |
		(u64)((x & (u64)0x00ff000000000000ULL) >> 40) |
		(u64)((x & (u64)0xff00000000000000ULL) >> 56);
पूर्ण
#पूर्ण_अगर /* _PPC_BOOT_SWAB_H_ */
