<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _TYPES_H_
#घोषणा _TYPES_H_

#समावेश <stdbool.h>

#घोषणा ARRAY_SIZE(x) (माप(x) / माप((x)[0]))

प्रकार अचिन्हित अक्षर		u8;
प्रकार अचिन्हित लघु		u16;
प्रकार अचिन्हित पूर्णांक		u32;
प्रकार अचिन्हित दीर्घ दीर्घ	u64;
प्रकार चिन्हित अक्षर		s8;
प्रकार लघु			s16;
प्रकार पूर्णांक			s32;
प्रकार दीर्घ दीर्घ		s64;

/* required क्रम opal-api.h */
प्रकार u8  uपूर्णांक8_t;
प्रकार u16 uपूर्णांक16_t;
प्रकार u32 uपूर्णांक32_t;
प्रकार u64 uपूर्णांक64_t;
प्रकार s8  पूर्णांक8_t;
प्रकार s16 पूर्णांक16_t;
प्रकार s32 पूर्णांक32_t;
प्रकार s64 पूर्णांक64_t;

#घोषणा min(x,y) (अणु \
	typeof(x) _x = (x);	\
	typeof(y) _y = (y);	\
	(व्योम) (&_x == &_y);	\
	_x < _y ? _x : _y; पूर्ण)

#घोषणा max(x,y) (अणु \
	typeof(x) _x = (x);	\
	typeof(y) _y = (y);	\
	(व्योम) (&_x == &_y);	\
	_x > _y ? _x : _y; पूर्ण)

#घोषणा min_t(type, a, b) min(((type) a), ((type) b))
#घोषणा max_t(type, a, b) max(((type) a), ((type) b))

प्रकार पूर्णांक bool;

#अगर_अघोषित true
#घोषणा true 1
#पूर्ण_अगर

#अगर_अघोषित false
#घोषणा false 0
#पूर्ण_अगर
#पूर्ण_अगर /* _TYPES_H_ */
