<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित _H8300_IO_H
#घोषणा _H8300_IO_H

#अगर_घोषित __KERNEL__

#समावेश <linux/types.h>

/* H8/300 पूर्णांकernal I/O functions */

#घोषणा __raw_पढ़ोb __raw_पढ़ोb
अटल अंतरभूत u8 __raw_पढ़ोb(स्थिर अस्थिर व्योम __iomem *addr)
अणु
	वापस *(अस्थिर u8 *)addr;
पूर्ण

#घोषणा __raw_पढ़ोw __raw_पढ़ोw
अटल अंतरभूत u16 __raw_पढ़ोw(स्थिर अस्थिर व्योम __iomem *addr)
अणु
	वापस *(अस्थिर u16 *)addr;
पूर्ण

#घोषणा __raw_पढ़ोl __raw_पढ़ोl
अटल अंतरभूत u32  __raw_पढ़ोl(स्थिर अस्थिर व्योम __iomem *addr)
अणु
	वापस *(अस्थिर u32 *)addr;
पूर्ण

#घोषणा __raw_ग_लिखोb __raw_ग_लिखोb
अटल अंतरभूत व्योम __raw_ग_लिखोb(u8 b, स्थिर अस्थिर व्योम __iomem *addr)
अणु
	*(अस्थिर u8 *)addr = b;
पूर्ण

#घोषणा __raw_ग_लिखोw __raw_ग_लिखोw
अटल अंतरभूत व्योम __raw_ग_लिखोw(u16 b, स्थिर अस्थिर व्योम __iomem *addr)
अणु
	*(अस्थिर u16 *)addr = b;
पूर्ण

#घोषणा __raw_ग_लिखोl __raw_ग_लिखोl
अटल अंतरभूत व्योम __raw_ग_लिखोl(u32 b, स्थिर अस्थिर व्योम __iomem *addr)
अणु
	*(अस्थिर u32 *)addr = b;
पूर्ण

अटल अंतरभूत व्योम ctrl_bclr(पूर्णांक b, व्योम __iomem *addr)
अणु
	अगर (__builtin_स्थिरant_p(b))
		__यंत्र__("bclr %1,%0" : "+WU"(*(u8 *)addr): "i"(b));
	अन्यथा
		__यंत्र__("bclr %w1,%0" : "+WU"(*(u8 *)addr): "r"(b));
पूर्ण

अटल अंतरभूत व्योम ctrl_bset(पूर्णांक b, व्योम __iomem *addr)
अणु
	अगर (__builtin_स्थिरant_p(b))
		__यंत्र__("bset %1,%0" : "+WU"(*(u8 *)addr): "i"(b));
	अन्यथा
		__यंत्र__("bset %w1,%0" : "+WU"(*(u8 *)addr): "r"(b));
पूर्ण

#समावेश <यंत्र-generic/पन.स>

#पूर्ण_अगर /* __KERNEL__ */

#पूर्ण_अगर /* _H8300_IO_H */
