<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0 */
#अगर_अघोषित BOOT_STRING_H
#घोषणा BOOT_STRING_H

/* Undef any of these macros coming from string_32.h. */
#अघोषित स_नकल
#अघोषित स_रखो
#अघोषित स_भेद

व्योम *स_नकल(व्योम *dst, स्थिर व्योम *src, माप_प्रकार len);
व्योम *स_रखो(व्योम *dst, पूर्णांक c, माप_प्रकार len);
पूर्णांक स_भेद(स्थिर व्योम *s1, स्थिर व्योम *s2, माप_प्रकार len);

/* Access builtin version by शेष. */
#घोषणा स_नकल(d,s,l) __builtin_स_नकल(d,s,l)
#घोषणा स_रखो(d,c,l) __builtin_स_रखो(d,c,l)
#घोषणा स_भेद	__builtin_स_भेद

बाह्य पूर्णांक म_भेद(स्थिर अक्षर *str1, स्थिर अक्षर *str2);
बाह्य पूर्णांक म_भेदन(स्थिर अक्षर *cs, स्थिर अक्षर *ct, माप_प्रकार count);
बाह्य माप_प्रकार म_माप(स्थिर अक्षर *s);
बाह्य अक्षर *म_माला(स्थिर अक्षर *s1, स्थिर अक्षर *s2);
बाह्य अक्षर *म_अक्षर(स्थिर अक्षर *s, पूर्णांक c);
बाह्य माप_प्रकार strnlen(स्थिर अक्षर *s, माप_प्रकार maxlen);
बाह्य अचिन्हित पूर्णांक atou(स्थिर अक्षर *s);
बाह्य अचिन्हित दीर्घ दीर्घ simple_म_से_अदीर्घl(स्थिर अक्षर *cp, अक्षर **endp,
					  अचिन्हित पूर्णांक base);

पूर्णांक kम_से_अदीर्घl(स्थिर अक्षर *s, अचिन्हित पूर्णांक base, अचिन्हित दीर्घ दीर्घ *res);
पूर्णांक boot_kम_से_अदीर्घ(स्थिर अक्षर *s, अचिन्हित पूर्णांक base, अचिन्हित दीर्घ *res);
#पूर्ण_अगर /* BOOT_STRING_H */
