<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-only */
/******************************************************************************
*******************************************************************************
**
**  Copyright (C) Sistina Software, Inc.  1997-2003  All rights reserved.
**  Copyright (C) 2004-2005 Red Hat, Inc.  All rights reserved.
**
**
*******************************************************************************
******************************************************************************/

#अगर_अघोषित __MIDCOMMS_DOT_H__
#घोषणा __MIDCOMMS_DOT_H__

पूर्णांक dlm_process_incoming_buffer(पूर्णांक nodeid, अचिन्हित अक्षर *buf, पूर्णांक buflen);

#पूर्ण_अगर				/* __MIDCOMMS_DOT_H__ */

