<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-only */
/******************************************************************************
*******************************************************************************
**
**  Copyright (C) 2005 Red Hat, Inc.  All rights reserved.
**
**
*******************************************************************************
******************************************************************************/

#अगर_अघोषित __UTIL_DOT_H__
#घोषणा __UTIL_DOT_H__

व्योम dlm_message_out(काष्ठा dlm_message *ms);
व्योम dlm_message_in(काष्ठा dlm_message *ms);
व्योम dlm_rcom_out(काष्ठा dlm_rcom *rc);
व्योम dlm_rcom_in(काष्ठा dlm_rcom *rc);

#पूर्ण_अगर

