<शैली गुरु>
/*
 * RF Buffer handling functions
 *
 * Copyright (c) 2009 Nick Kossअगरidis <mickflemm@gmail.com>
 *
 * Permission to use, copy, modअगरy, and distribute this software क्रम any
 * purpose with or without fee is hereby granted, provided that the above
 * copyright notice and this permission notice appear in all copies.
 *
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
 * ANY SPECIAL, सूचीECT, INसूचीECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
 * ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
 * OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 *
 */


/**
 * DOC: RF Buffer रेजिस्टरs
 *
 * There are some special रेजिस्टरs on the RF chip
 * that control various operation settings related mostly to
 * the analog parts (channel, gain adjusपंचांगent etc).
 *
 * We करोn't ग_लिखो on those रेजिस्टरs directly but
 * we send a data packet on the chip, using a special रेजिस्टर,
 * that holds all the settings we need. After we've sent the
 * data packet, we ग_लिखो on another special रेजिस्टर to notअगरy hw
 * to apply the settings. This is करोne so that control रेजिस्टरs
 * can be dynamically programmed during operation and the settings
 * are applied faster on the hw.
 *
 * We call each data packet an "RF Bank" and all the data we ग_लिखो
 * (all RF Banks) "RF Buffer". This file holds initial RF Buffer
 * data क्रम the dअगरferent RF chips, and various info to match RF
 * Buffer offsets with specअगरic RF रेजिस्टरs so that we can access
 * them. We tweak these settings on rfregs_init function.
 *
 * Also check out reg.h and U.S. Patent 6677779 B1 (about buffer
 * रेजिस्टरs and control रेजिस्टरs):
 *
 * https://www.google.com/patents?id=qNURAAAAEBAJ
 */


/**
 * काष्ठा ath5k_ini_rfbuffer - Initial RF Buffer settings
 * @rfb_bank: RF Bank number
 * @rfb_ctrl_रेजिस्टर: RF Buffer control रेजिस्टर
 * @rfb_mode_data: RF Buffer data क्रम each mode
 *
 * Struct to hold शेष mode specअगरic RF
 * रेजिस्टर values (RF Banks) क्रम each chip.
 */
काष्ठा ath5k_ini_rfbuffer अणु
	u8	rfb_bank;
	u16	rfb_ctrl_रेजिस्टर;
	u32	rfb_mode_data[3];
पूर्ण;

/**
 * काष्ठा ath5k_rfb_field - An RF Buffer field (रेजिस्टर/value)
 * @len: Field length
 * @pos: Offset on the raw packet
 * @col: Used क्रम shअगरting
 *
 * Struct to hold RF Buffer field
 * infos used to access certain RF
 * analog रेजिस्टरs
 */
काष्ठा ath5k_rfb_field अणु
	u8	len;
	u16	pos;
	u8	col;
पूर्ण;

/**
 * काष्ठा ath5k_rf_reg - RF analog रेजिस्टर definition
 * @bank: RF Buffer Bank number
 * @index: Register's index on ath5k_rf_regx_idx
 * @field: The &काष्ठा ath5k_rfb_field
 *
 * We use this काष्ठा to define the set of RF रेजिस्टरs
 * on each chip that we want to tweak. Some RF रेजिस्टरs
 * are common between dअगरferent chip versions so this saves
 * us space and complनिकासy because we can refer to an rf
 * रेजिस्टर by it's index no matter what chip we work with
 * as दीर्घ as it has that रेजिस्टर.
 */
काष्ठा ath5k_rf_reg अणु
	u8			bank;
	u8			index;
	काष्ठा ath5k_rfb_field	field;
पूर्ण;

/**
 * क्रमागत ath5k_rf_regs_idx - Map RF रेजिस्टरs to indexes
 *
 * We करो this to handle common bits and make our
 * lअगरe easier by using an index क्रम each रेजिस्टर
 * instead of a full rfb_field
 */
क्रमागत ath5k_rf_regs_idx अणु
	/* BANK 2 */
	AR5K_RF_TURBO = 0,
	/* BANK 6 */
	AR5K_RF_OB_2GHZ,
	AR5K_RF_OB_5GHZ,
	AR5K_RF_DB_2GHZ,
	AR5K_RF_DB_5GHZ,
	AR5K_RF_FIXED_BIAS_A,
	AR5K_RF_FIXED_BIAS_B,
	AR5K_RF_PWD_XPD,
	AR5K_RF_XPD_SEL,
	AR5K_RF_XPD_GAIN,
	AR5K_RF_PD_GAIN_LO,
	AR5K_RF_PD_GAIN_HI,
	AR5K_RF_HIGH_VC_CP,
	AR5K_RF_MID_VC_CP,
	AR5K_RF_LOW_VC_CP,
	AR5K_RF_PUSH_UP,
	AR5K_RF_PAD2GND,
	AR5K_RF_XB2_LVL,
	AR5K_RF_XB5_LVL,
	AR5K_RF_PWD_ICLOBUF_2G,
	AR5K_RF_PWD_84,
	AR5K_RF_PWD_90,
	AR5K_RF_PWD_130,
	AR5K_RF_PWD_131,
	AR5K_RF_PWD_132,
	AR5K_RF_PWD_136,
	AR5K_RF_PWD_137,
	AR5K_RF_PWD_138,
	AR5K_RF_PWD_166,
	AR5K_RF_PWD_167,
	AR5K_RF_DERBY_CHAN_SEL_MODE,
	/* BANK 7 */
	AR5K_RF_GAIN_I,
	AR5K_RF_PLO_SEL,
	AR5K_RF_RFGAIN_SEL,
	AR5K_RF_RFGAIN_STEP,
	AR5K_RF_WAIT_S,
	AR5K_RF_WAIT_I,
	AR5K_RF_MAX_TIME,
	AR5K_RF_MIXVGA_OVR,
	AR5K_RF_MIXGAIN_OVR,
	AR5K_RF_MIXGAIN_STEP,
	AR5K_RF_PD_DELAY_A,
	AR5K_RF_PD_DELAY_B,
	AR5K_RF_PD_DELAY_XR,
	AR5K_RF_PD_PERIOD_A,
	AR5K_RF_PD_PERIOD_B,
	AR5K_RF_PD_PERIOD_XR,
पूर्ण;


/*******************\
* RF5111 (Sombrero) *
\*******************/

/* BANK 2				len  pos col */
#घोषणा	AR5K_RF5111_RF_TURBO		अणु 1, 3,   0 पूर्ण

/* BANK 6				len  pos col */
#घोषणा	AR5K_RF5111_OB_2GHZ		अणु 3, 119, 0 पूर्ण
#घोषणा	AR5K_RF5111_DB_2GHZ		अणु 3, 122, 0 पूर्ण

#घोषणा	AR5K_RF5111_OB_5GHZ		अणु 3, 104, 0 पूर्ण
#घोषणा	AR5K_RF5111_DB_5GHZ		अणु 3, 107, 0 पूर्ण

#घोषणा	AR5K_RF5111_PWD_XPD		अणु 1, 95,  0 पूर्ण
#घोषणा	AR5K_RF5111_XPD_GAIN		अणु 4, 96,  0 पूर्ण

/* Access to PWD रेजिस्टरs */
#घोषणा AR5K_RF5111_PWD(_n)		अणु 1, (135 - _n), 3 पूर्ण

/* BANK 7				len  pos col */
#घोषणा	AR5K_RF5111_GAIN_I		अणु 6, 29,  0 पूर्ण
#घोषणा	AR5K_RF5111_PLO_SEL		अणु 1, 4,   0 पूर्ण
#घोषणा	AR5K_RF5111_RFGAIN_SEL		अणु 1, 36,  0 पूर्ण
#घोषणा AR5K_RF5111_RFGAIN_STEP		अणु 6, 37,  0 पूर्ण
/* Only on AR5212 BaseBand and up */
#घोषणा	AR5K_RF5111_WAIT_S		अणु 5, 19,  0 पूर्ण
#घोषणा	AR5K_RF5111_WAIT_I		अणु 5, 24,  0 पूर्ण
#घोषणा	AR5K_RF5111_MAX_TIME		अणु 2, 49,  0 पूर्ण

अटल स्थिर काष्ठा ath5k_rf_reg rf_regs_5111[] = अणु
	अणु2, AR5K_RF_TURBO,		AR5K_RF5111_RF_TURBOपूर्ण,
	अणु6, AR5K_RF_OB_2GHZ,		AR5K_RF5111_OB_2GHZपूर्ण,
	अणु6, AR5K_RF_DB_2GHZ,		AR5K_RF5111_DB_2GHZपूर्ण,
	अणु6, AR5K_RF_OB_5GHZ,		AR5K_RF5111_OB_5GHZपूर्ण,
	अणु6, AR5K_RF_DB_5GHZ,		AR5K_RF5111_DB_5GHZपूर्ण,
	अणु6, AR5K_RF_PWD_XPD,		AR5K_RF5111_PWD_XPDपूर्ण,
	अणु6, AR5K_RF_XPD_GAIN,		AR5K_RF5111_XPD_GAINपूर्ण,
	अणु6, AR5K_RF_PWD_84,		AR5K_RF5111_PWD(84)पूर्ण,
	अणु6, AR5K_RF_PWD_90,		AR5K_RF5111_PWD(90)पूर्ण,
	अणु7, AR5K_RF_GAIN_I,		AR5K_RF5111_GAIN_Iपूर्ण,
	अणु7, AR5K_RF_PLO_SEL,		AR5K_RF5111_PLO_SELपूर्ण,
	अणु7, AR5K_RF_RFGAIN_SEL,		AR5K_RF5111_RFGAIN_SELपूर्ण,
	अणु7, AR5K_RF_RFGAIN_STEP,	AR5K_RF5111_RFGAIN_STEPपूर्ण,
	अणु7, AR5K_RF_WAIT_S,		AR5K_RF5111_WAIT_Sपूर्ण,
	अणु7, AR5K_RF_WAIT_I,		AR5K_RF5111_WAIT_Iपूर्ण,
	अणु7, AR5K_RF_MAX_TIME,		AR5K_RF5111_MAX_TIMEपूर्ण
पूर्ण;

/* Default mode specअगरic settings */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_5111[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00380000, 0x00380000, 0x00380000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x00000000, 0x000000c0, 0x00000080 पूर्ण पूर्ण,
	अणु 0, 0x989c, अणु 0x000400f9, 0x000400ff, 0x000400fd पूर्ण पूर्ण,
	अणु 0, 0x98d4, अणु 0x00000000, 0x00000004, 0x00000004 पूर्ण पूर्ण,
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d4, अणु 0x00000010, 0x00000010, 0x00000010 पूर्ण पूर्ण,
	अणु 3, 0x98d8, अणु 0x00601068, 0x00601068, 0x00601068 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x10000000, 0x10000000, 0x10000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x04000000, 0x04000000, 0x04000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x0a000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x003800c0, 0x023800c0, 0x003800c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00020006, 0x00000006, 0x00020006 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000089, 0x00000089, 0x00000089 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000000a0, 0x000000a0, 0x000000a0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00040007, 0x00040007, 0x00040007 पूर्ण पूर्ण,
	अणु 6, 0x98d4, अणु 0x0000001a, 0x0000001a, 0x0000001a पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000040, 0x00000040, 0x00000040 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000010, 0x00000010, 0x00000010 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000008, 0x00000008, 0x00000008 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x0000004f, 0x0000004f, 0x0000004f पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000f1, 0x00000061, 0x000000f1 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x0000904f, 0x0000904c, 0x0000904f पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x0000125a, 0x0000129a, 0x0000125a पूर्ण पूर्ण,
	अणु 7, 0x98cc, अणु 0x0000000e, 0x0000000f, 0x0000000e पूर्ण पूर्ण,
पूर्ण;



/***********************\
* RF5112/RF2112 (Derby) *
\***********************/

/* BANK 2 (Common)			len  pos col */
#घोषणा	AR5K_RF5112X_RF_TURBO		अणु 1, 1,   2 पूर्ण

/* BANK 7 (Common)			len  pos col */
#घोषणा	AR5K_RF5112X_GAIN_I		अणु 6, 14,  0 पूर्ण
#घोषणा	AR5K_RF5112X_MIXVGA_OVR		अणु 1, 36,  0 पूर्ण
#घोषणा	AR5K_RF5112X_MIXGAIN_OVR	अणु 2, 37,  0 पूर्ण
#घोषणा AR5K_RF5112X_MIXGAIN_STEP	अणु 4, 32,  0 पूर्ण
#घोषणा	AR5K_RF5112X_PD_DELAY_A		अणु 4, 58,  0 पूर्ण
#घोषणा	AR5K_RF5112X_PD_DELAY_B		अणु 4, 62,  0 पूर्ण
#घोषणा	AR5K_RF5112X_PD_DELAY_XR	अणु 4, 66,  0 पूर्ण
#घोषणा	AR5K_RF5112X_PD_PERIOD_A	अणु 4, 70,  0 पूर्ण
#घोषणा	AR5K_RF5112X_PD_PERIOD_B	अणु 4, 74,  0 पूर्ण
#घोषणा	AR5K_RF5112X_PD_PERIOD_XR	अणु 4, 78,  0 पूर्ण

/* RFX112 (Derby 1) */

/* BANK 6				len  pos col */
#घोषणा	AR5K_RF5112_OB_2GHZ		अणु 3, 269, 0 पूर्ण
#घोषणा	AR5K_RF5112_DB_2GHZ		अणु 3, 272, 0 पूर्ण

#घोषणा	AR5K_RF5112_OB_5GHZ		अणु 3, 261, 0 पूर्ण
#घोषणा	AR5K_RF5112_DB_5GHZ		अणु 3, 264, 0 पूर्ण

#घोषणा	AR5K_RF5112_FIXED_BIAS_A	अणु 1, 260, 0 पूर्ण
#घोषणा	AR5K_RF5112_FIXED_BIAS_B	अणु 1, 259, 0 पूर्ण

#घोषणा	AR5K_RF5112_XPD_SEL		अणु 1, 284, 0 पूर्ण
#घोषणा	AR5K_RF5112_XPD_GAIN		अणु 2, 252, 0 पूर्ण

/* Access to PWD रेजिस्टरs */
#घोषणा AR5K_RF5112_PWD(_n)		अणु 1, (302 - _n), 3 पूर्ण

अटल स्थिर काष्ठा ath5k_rf_reg rf_regs_5112[] = अणु
	अणु2, AR5K_RF_TURBO,		AR5K_RF5112X_RF_TURBOपूर्ण,
	अणु6, AR5K_RF_OB_2GHZ,		AR5K_RF5112_OB_2GHZपूर्ण,
	अणु6, AR5K_RF_DB_2GHZ,		AR5K_RF5112_DB_2GHZपूर्ण,
	अणु6, AR5K_RF_OB_5GHZ,		AR5K_RF5112_OB_5GHZपूर्ण,
	अणु6, AR5K_RF_DB_5GHZ,		AR5K_RF5112_DB_5GHZपूर्ण,
	अणु6, AR5K_RF_FIXED_BIAS_A,	AR5K_RF5112_FIXED_BIAS_Aपूर्ण,
	अणु6, AR5K_RF_FIXED_BIAS_B,	AR5K_RF5112_FIXED_BIAS_Bपूर्ण,
	अणु6, AR5K_RF_XPD_SEL,		AR5K_RF5112_XPD_SELपूर्ण,
	अणु6, AR5K_RF_XPD_GAIN,		AR5K_RF5112_XPD_GAINपूर्ण,
	अणु6, AR5K_RF_PWD_130,		AR5K_RF5112_PWD(130)पूर्ण,
	अणु6, AR5K_RF_PWD_131,		AR5K_RF5112_PWD(131)पूर्ण,
	अणु6, AR5K_RF_PWD_132,		AR5K_RF5112_PWD(132)पूर्ण,
	अणु6, AR5K_RF_PWD_136,		AR5K_RF5112_PWD(136)पूर्ण,
	अणु6, AR5K_RF_PWD_137,		AR5K_RF5112_PWD(137)पूर्ण,
	अणु6, AR5K_RF_PWD_138,		AR5K_RF5112_PWD(138)पूर्ण,
	अणु7, AR5K_RF_GAIN_I,		AR5K_RF5112X_GAIN_Iपूर्ण,
	अणु7, AR5K_RF_MIXVGA_OVR,		AR5K_RF5112X_MIXVGA_OVRपूर्ण,
	अणु7, AR5K_RF_MIXGAIN_OVR,	AR5K_RF5112X_MIXGAIN_OVRपूर्ण,
	अणु7, AR5K_RF_MIXGAIN_STEP,	AR5K_RF5112X_MIXGAIN_STEPपूर्ण,
	अणु7, AR5K_RF_PD_DELAY_A,		AR5K_RF5112X_PD_DELAY_Aपूर्ण,
	अणु7, AR5K_RF_PD_DELAY_B,		AR5K_RF5112X_PD_DELAY_Bपूर्ण,
	अणु7, AR5K_RF_PD_DELAY_XR,	AR5K_RF5112X_PD_DELAY_XRपूर्ण,
	अणु7, AR5K_RF_PD_PERIOD_A,	AR5K_RF5112X_PD_PERIOD_Aपूर्ण,
	अणु7, AR5K_RF_PD_PERIOD_B,	AR5K_RF5112X_PD_PERIOD_Bपूर्ण,
	अणु7, AR5K_RF_PD_PERIOD_XR,	AR5K_RF5112X_PD_PERIOD_XRपूर्ण,
पूर्ण;

/* Default mode specअगरic settings */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_5112[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x03060408, 0x03060408, 0x03060408 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a0c0c0, 0x00e0c0c0, 0x00e0c0c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00a00000, 0x00a00000, 0x00a00000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000a0000, 0x000a0000, 0x000a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00660000, 0x00660000, 0x00660000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00db0000, 0x00db0000, 0x00db0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00f10000, 0x00f10000, 0x00f10000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00120000, 0x00120000, 0x00120000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00120000, 0x00120000, 0x00120000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00730000, 0x00730000, 0x00730000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000c0000, 0x000c0000, 0x000c0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00ff0000, 0x00ff0000, 0x00ff0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00ff0000, 0x00ff0000, 0x00ff0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x008b0000, 0x008b0000, 0x008b0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00600000, 0x00600000, 0x00600000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000c0000, 0x000c0000, 0x000c0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00840000, 0x00840000, 0x00840000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00640000, 0x00640000, 0x00640000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00200000, 0x00200000, 0x00200000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00240000, 0x00240000, 0x00240000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00250000, 0x00250000, 0x00250000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00110000, 0x00110000, 0x00110000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00110000, 0x00110000, 0x00110000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00510000, 0x00510000, 0x00510000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x1c040000, 0x1c040000, 0x1c040000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000a0000, 0x000a0000, 0x000a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00a10000, 0x00a10000, 0x00a10000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00400000, 0x00400000, 0x00400000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x03090000, 0x03090000, 0x03090000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x06000000, 0x06000000, 0x06000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000000b0, 0x000000a8, 0x000000a8 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0000002e, 0x0000002e, 0x0000002e पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x006c4a41, 0x006c4af1, 0x006c4a61 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0050892a, 0x0050892b, 0x0050892b पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00842400, 0x00842400, 0x00842400 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00c69200, 0x00c69200, 0x00c69200 पूर्ण पूर्ण,
	अणु 6, 0x98d0, अणु 0x0002000c, 0x0002000c, 0x0002000c पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000094, 0x00000094, 0x00000094 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000091, 0x00000091, 0x00000091 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x0000000a, 0x00000012, 0x00000012 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000080, 0x00000080, 0x00000080 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000c1, 0x000000c1, 0x000000c1 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000060, 0x00000060, 0x00000060 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000f0, 0x000000f0, 0x000000f0 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000022, 0x00000022, 0x00000022 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000092, 0x00000092, 0x00000092 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000d4, 0x000000d4, 0x000000d4 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000014cc, 0x000014cc, 0x000014cc पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x0000048c, 0x0000048c, 0x0000048c पूर्ण पूर्ण,
	अणु 7, 0x98c4, अणु 0x00000003, 0x00000003, 0x00000003 पूर्ण पूर्ण,
पूर्ण;

/* RFX112A (Derby 2) */

/* BANK 6				len  pos col */
#घोषणा	AR5K_RF5112A_OB_2GHZ		अणु 3, 287, 0 पूर्ण
#घोषणा	AR5K_RF5112A_DB_2GHZ		अणु 3, 290, 0 पूर्ण

#घोषणा	AR5K_RF5112A_OB_5GHZ		अणु 3, 279, 0 पूर्ण
#घोषणा	AR5K_RF5112A_DB_5GHZ		अणु 3, 282, 0 पूर्ण

#घोषणा	AR5K_RF5112A_FIXED_BIAS_A	अणु 1, 278, 0 पूर्ण
#घोषणा	AR5K_RF5112A_FIXED_BIAS_B	अणु 1, 277, 0 पूर्ण

#घोषणा	AR5K_RF5112A_XPD_SEL		अणु 1, 302, 0 पूर्ण
#घोषणा	AR5K_RF5112A_PDGAINLO		अणु 2, 270, 0 पूर्ण
#घोषणा	AR5K_RF5112A_PDGAINHI		अणु 2, 257, 0 पूर्ण

/* Access to PWD रेजिस्टरs */
#घोषणा AR5K_RF5112A_PWD(_n)		अणु 1, (306 - _n), 3 पूर्ण

/* Voltage regulators */
#घोषणा	AR5K_RF5112A_HIGH_VC_CP		अणु 2, 90,  2 पूर्ण
#घोषणा	AR5K_RF5112A_MID_VC_CP		अणु 2, 92,  2 पूर्ण
#घोषणा	AR5K_RF5112A_LOW_VC_CP		अणु 2, 94,  2 पूर्ण
#घोषणा	AR5K_RF5112A_PUSH_UP		अणु 1, 254,  2 पूर्ण

/* Power consumption */
#घोषणा	AR5K_RF5112A_PAD2GND		अणु 1, 281, 1 पूर्ण
#घोषणा	AR5K_RF5112A_XB2_LVL		अणु 2, 1,	  3 पूर्ण
#घोषणा	AR5K_RF5112A_XB5_LVL		अणु 2, 3,	  3 पूर्ण

अटल स्थिर काष्ठा ath5k_rf_reg rf_regs_5112a[] = अणु
	अणु2, AR5K_RF_TURBO,		AR5K_RF5112X_RF_TURBOपूर्ण,
	अणु6, AR5K_RF_OB_2GHZ,		AR5K_RF5112A_OB_2GHZपूर्ण,
	अणु6, AR5K_RF_DB_2GHZ,		AR5K_RF5112A_DB_2GHZपूर्ण,
	अणु6, AR5K_RF_OB_5GHZ,		AR5K_RF5112A_OB_5GHZपूर्ण,
	अणु6, AR5K_RF_DB_5GHZ,		AR5K_RF5112A_DB_5GHZपूर्ण,
	अणु6, AR5K_RF_FIXED_BIAS_A,	AR5K_RF5112A_FIXED_BIAS_Aपूर्ण,
	अणु6, AR5K_RF_FIXED_BIAS_B,	AR5K_RF5112A_FIXED_BIAS_Bपूर्ण,
	अणु6, AR5K_RF_XPD_SEL,		AR5K_RF5112A_XPD_SELपूर्ण,
	अणु6, AR5K_RF_PD_GAIN_LO,		AR5K_RF5112A_PDGAINLOपूर्ण,
	अणु6, AR5K_RF_PD_GAIN_HI,		AR5K_RF5112A_PDGAINHIपूर्ण,
	अणु6, AR5K_RF_PWD_130,		AR5K_RF5112A_PWD(130)पूर्ण,
	अणु6, AR5K_RF_PWD_131,		AR5K_RF5112A_PWD(131)पूर्ण,
	अणु6, AR5K_RF_PWD_132,		AR5K_RF5112A_PWD(132)पूर्ण,
	अणु6, AR5K_RF_PWD_136,		AR5K_RF5112A_PWD(136)पूर्ण,
	अणु6, AR5K_RF_PWD_137,		AR5K_RF5112A_PWD(137)पूर्ण,
	अणु6, AR5K_RF_PWD_138,		AR5K_RF5112A_PWD(138)पूर्ण,
	अणु6, AR5K_RF_PWD_166,		AR5K_RF5112A_PWD(166)पूर्ण,
	अणु6, AR5K_RF_PWD_167,		AR5K_RF5112A_PWD(167)पूर्ण,
	अणु6, AR5K_RF_HIGH_VC_CP,		AR5K_RF5112A_HIGH_VC_CPपूर्ण,
	अणु6, AR5K_RF_MID_VC_CP,		AR5K_RF5112A_MID_VC_CPपूर्ण,
	अणु6, AR5K_RF_LOW_VC_CP,		AR5K_RF5112A_LOW_VC_CPपूर्ण,
	अणु6, AR5K_RF_PUSH_UP,		AR5K_RF5112A_PUSH_UPपूर्ण,
	अणु6, AR5K_RF_PAD2GND,		AR5K_RF5112A_PAD2GNDपूर्ण,
	अणु6, AR5K_RF_XB2_LVL,		AR5K_RF5112A_XB2_LVLपूर्ण,
	अणु6, AR5K_RF_XB5_LVL,		AR5K_RF5112A_XB5_LVLपूर्ण,
	अणु7, AR5K_RF_GAIN_I,		AR5K_RF5112X_GAIN_Iपूर्ण,
	अणु7, AR5K_RF_MIXVGA_OVR,		AR5K_RF5112X_MIXVGA_OVRपूर्ण,
	अणु7, AR5K_RF_MIXGAIN_OVR,	AR5K_RF5112X_MIXGAIN_OVRपूर्ण,
	अणु7, AR5K_RF_MIXGAIN_STEP,	AR5K_RF5112X_MIXGAIN_STEPपूर्ण,
	अणु7, AR5K_RF_PD_DELAY_A,		AR5K_RF5112X_PD_DELAY_Aपूर्ण,
	अणु7, AR5K_RF_PD_DELAY_B,		AR5K_RF5112X_PD_DELAY_Bपूर्ण,
	अणु7, AR5K_RF_PD_DELAY_XR,	AR5K_RF5112X_PD_DELAY_XRपूर्ण,
	अणु7, AR5K_RF_PD_PERIOD_A,	AR5K_RF5112X_PD_PERIOD_Aपूर्ण,
	अणु7, AR5K_RF_PD_PERIOD_B,	AR5K_RF5112X_PD_PERIOD_Bपूर्ण,
	अणु7, AR5K_RF_PD_PERIOD_XR,	AR5K_RF5112X_PD_PERIOD_XRपूर्ण,
पूर्ण;

/* Default mode specअगरic settings */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_5112a[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x03060408, 0x03060408, 0x03060408 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a020c0, 0x00e020c0, 0x00e020c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0f000000, 0x0f000000, 0x0f000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00800000, 0x00800000, 0x00800000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x002a0000, 0x002a0000, 0x002a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00010000, 0x00010000, 0x00010000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00180000, 0x00180000, 0x00180000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00600000, 0x006e0000, 0x006e0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00c70000, 0x00c70000, 0x00c70000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x004b0000, 0x004b0000, 0x004b0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x04480000, 0x04480000, 0x04480000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x004c0000, 0x004c0000, 0x004c0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00e40000, 0x00e40000, 0x00e40000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00fc0000, 0x00fc0000, 0x00fc0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00ff0000, 0x00ff0000, 0x00ff0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x043f0000, 0x043f0000, 0x043f0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000c0000, 0x000c0000, 0x000c0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x02190000, 0x02190000, 0x02190000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00240000, 0x00240000, 0x00240000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00b40000, 0x00b40000, 0x00b40000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00990000, 0x00990000, 0x00990000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00500000, 0x00500000, 0x00500000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x002a0000, 0x002a0000, 0x002a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00120000, 0x00120000, 0x00120000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0xc0320000, 0xc0320000, 0xc0320000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x01740000, 0x01740000, 0x01740000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00110000, 0x00110000, 0x00110000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x86280000, 0x86280000, 0x86280000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x31840000, 0x31840000, 0x31840000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00f20080, 0x00f20080, 0x00f20080 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00270019, 0x00270019, 0x00270019 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000003, 0x00000003, 0x00000003 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000000b2, 0x000000b2, 0x000000b2 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00b02084, 0x00b02084, 0x00b02084 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x004125a4, 0x004125a4, 0x004125a4 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00119220, 0x00119220, 0x00119220 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x001a4800, 0x001a4800, 0x001a4800 पूर्ण पूर्ण,
	अणु 6, 0x98d8, अणु 0x000b0230, 0x000b0230, 0x000b0230 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000094, 0x00000094, 0x00000094 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000091, 0x00000091, 0x00000091 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000012, 0x00000012, 0x00000012 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000080, 0x00000080, 0x00000080 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000d9, 0x000000d9, 0x000000d9 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000060, 0x00000060, 0x00000060 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000f0, 0x000000f0, 0x000000f0 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000a2, 0x000000a2, 0x000000a2 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000052, 0x00000052, 0x00000052 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000000d4, 0x000000d4, 0x000000d4 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x000014cc, 0x000014cc, 0x000014cc पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x0000048c, 0x0000048c, 0x0000048c पूर्ण पूर्ण,
	अणु 7, 0x98c4, अणु 0x00000003, 0x00000003, 0x00000003 पूर्ण पूर्ण,
पूर्ण;



/******************\
* RF2413 (Grअगरfin) *
\******************/

/* BANK 2				len  pos col */
#घोषणा AR5K_RF2413_RF_TURBO		अणु 1, 1,   2 पूर्ण

/* BANK 6				len  pos col */
#घोषणा	AR5K_RF2413_OB_2GHZ		अणु 3, 168, 0 पूर्ण
#घोषणा	AR5K_RF2413_DB_2GHZ		अणु 3, 165, 0 पूर्ण

अटल स्थिर काष्ठा ath5k_rf_reg rf_regs_2413[] = अणु
	अणु2, AR5K_RF_TURBO,		AR5K_RF2413_RF_TURBOपूर्ण,
	अणु6, AR5K_RF_OB_2GHZ,		AR5K_RF2413_OB_2GHZपूर्ण,
	अणु6, AR5K_RF_DB_2GHZ,		AR5K_RF2413_DB_2GHZपूर्ण,
पूर्ण;

/* Default mode specअगरic settings
 * XXX: a/aTurbo ???
 */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_2413[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x02001408, 0x02001408, 0x02001408 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a020c0, 0x00e020c0, 0x00e020c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0xf0000000, 0xf0000000, 0xf0000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x03000000, 0x03000000, 0x03000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x40400000, 0x40400000, 0x40400000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x65050000, 0x65050000, 0x65050000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00420000, 0x00420000, 0x00420000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00b50000, 0x00b50000, 0x00b50000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00030000, 0x00030000, 0x00030000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00f70000, 0x00f70000, 0x00f70000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x009d0000, 0x009d0000, 0x009d0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00220000, 0x00220000, 0x00220000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x04220000, 0x04220000, 0x04220000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00230018, 0x00230018, 0x00230018 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00280000, 0x00280060, 0x00280060 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x005000c0, 0x005000c3, 0x005000c3 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0004007f, 0x0004007f, 0x0004007f पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000458, 0x00000458, 0x00000458 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0000c000, 0x0000c000, 0x0000c000 पूर्ण पूर्ण,
	अणु 6, 0x98d8, अणु 0x00400230, 0x00400230, 0x00400230 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00006400, 0x00006400, 0x00006400 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000800, 0x00000800, 0x00000800 पूर्ण पूर्ण,
	अणु 7, 0x98cc, अणु 0x0000000e, 0x0000000e, 0x0000000e पूर्ण पूर्ण,
पूर्ण;



/***************************\
* RF2315/RF2316 (Cobra SoC) *
\***************************/

/* BANK 2				len  pos col */
#घोषणा	AR5K_RF2316_RF_TURBO		अणु 1, 1,   2 पूर्ण

/* BANK 6				len  pos col */
#घोषणा	AR5K_RF2316_OB_2GHZ		अणु 3, 178, 0 पूर्ण
#घोषणा	AR5K_RF2316_DB_2GHZ		अणु 3, 175, 0 पूर्ण

अटल स्थिर काष्ठा ath5k_rf_reg rf_regs_2316[] = अणु
	अणु2, AR5K_RF_TURBO,		AR5K_RF2316_RF_TURBOपूर्ण,
	अणु6, AR5K_RF_OB_2GHZ,		AR5K_RF2316_OB_2GHZपूर्ण,
	अणु6, AR5K_RF_DB_2GHZ,		AR5K_RF2316_DB_2GHZपूर्ण,
पूर्ण;

/* Default mode specअगरic settings */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_2316[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x02001408, 0x02001408, 0x02001408 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a020c0, 0x00e020c0, 0x00e020c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0xc0000000, 0xc0000000, 0xc0000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0f000000, 0x0f000000, 0x0f000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x02000000, 0x02000000, 0x02000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0xf8000000, 0xf8000000, 0xf8000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x95150000, 0x95150000, 0x95150000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0xc1000000, 0xc1000000, 0xc1000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00080000, 0x00080000, 0x00080000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00d50000, 0x00d50000, 0x00d50000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000e0000, 0x000e0000, 0x000e0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00dc0000, 0x00dc0000, 0x00dc0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00770000, 0x00770000, 0x00770000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x008a0000, 0x008a0000, 0x008a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x10880000, 0x10880000, 0x10880000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x008c0060, 0x008c0060, 0x008c0060 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00a00000, 0x00a00080, 0x00a00080 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00400000, 0x0040000d, 0x0040000d पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00110400, 0x00110400, 0x00110400 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000060, 0x00000060, 0x00000060 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000001, 0x00000001, 0x00000001 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000b00, 0x00000b00, 0x00000b00 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000be8, 0x00000be8, 0x00000be8 पूर्ण पूर्ण,
	अणु 6, 0x98c0, अणु 0x00010000, 0x00010000, 0x00010000 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00006400, 0x00006400, 0x00006400 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000800, 0x00000800, 0x00000800 पूर्ण पूर्ण,
	अणु 7, 0x98cc, अणु 0x0000000e, 0x0000000e, 0x0000000e पूर्ण पूर्ण,
पूर्ण;



/******************************\
* RF5413/RF5424 (Eagle/Conकरोr) *
\******************************/

/* BANK 6				len  pos col */
#घोषणा	AR5K_RF5413_OB_2GHZ		अणु 3, 241, 0 पूर्ण
#घोषणा	AR5K_RF5413_DB_2GHZ		अणु 3, 238, 0 पूर्ण

#घोषणा	AR5K_RF5413_OB_5GHZ		अणु 3, 247, 0 पूर्ण
#घोषणा	AR5K_RF5413_DB_5GHZ		अणु 3, 244, 0 पूर्ण

#घोषणा	AR5K_RF5413_PWD_ICLOBUF2G	अणु 3, 131, 3 पूर्ण
#घोषणा	AR5K_RF5413_DERBY_CHAN_SEL_MODE	अणु 1, 291, 2 पूर्ण

अटल स्थिर काष्ठा ath5k_rf_reg rf_regs_5413[] = अणु
	अणु6, AR5K_RF_OB_2GHZ,		 AR5K_RF5413_OB_2GHZपूर्ण,
	अणु6, AR5K_RF_DB_2GHZ,		 AR5K_RF5413_DB_2GHZपूर्ण,
	अणु6, AR5K_RF_OB_5GHZ,		 AR5K_RF5413_OB_5GHZपूर्ण,
	अणु6, AR5K_RF_DB_5GHZ,		 AR5K_RF5413_DB_5GHZपूर्ण,
	अणु6, AR5K_RF_PWD_ICLOBUF_2G,	 AR5K_RF5413_PWD_ICLOBUF2Gपूर्ण,
	अणु6, AR5K_RF_DERBY_CHAN_SEL_MODE, AR5K_RF5413_DERBY_CHAN_SEL_MODEपूर्ण,
पूर्ण;

/* Default mode specअगरic settings */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_5413[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x00000008, 0x00000008, 0x00000008 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a000c0, 0x00e000c0, 0x00e000c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x33000000, 0x33000000, 0x33000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x01000000, 0x01000000, 0x01000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x1f000000, 0x1f000000, 0x1f000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00b80000, 0x00b80000, 0x00b80000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00b70000, 0x00b70000, 0x00b70000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00840000, 0x00840000, 0x00840000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00980000, 0x00980000, 0x00980000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00c00000, 0x00c00000, 0x00c00000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00ff0000, 0x00ff0000, 0x00ff0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00ff0000, 0x00ff0000, 0x00ff0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00ff0000, 0x00ff0000, 0x00ff0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00ff0000, 0x00ff0000, 0x00ff0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00d70000, 0x00d70000, 0x00d70000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00610000, 0x00610000, 0x00610000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00fe0000, 0x00fe0000, 0x00fe0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00de0000, 0x00de0000, 0x00de0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x007f0000, 0x007f0000, 0x007f0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x043d0000, 0x043d0000, 0x043d0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00770000, 0x00770000, 0x00770000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00440000, 0x00440000, 0x00440000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00980000, 0x00980000, 0x00980000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00100080, 0x00100080, 0x00100080 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0005c034, 0x0005c034, 0x0005c034 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x003100f0, 0x003100f0, 0x003100f0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000c011f, 0x000c011f, 0x000c011f पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00510040, 0x00510040, 0x00510040 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x005000da, 0x005000da, 0x005000da पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00004044, 0x00004044, 0x00004044 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x000060c0, 0x000060c0, 0x000060c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00002c00, 0x00003600, 0x00003600 पूर्ण पूर्ण,
	अणु 6, 0x98c8, अणु 0x00000403, 0x00040403, 0x00040403 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00006400, 0x00006400, 0x00006400 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000800, 0x00000800, 0x00000800 पूर्ण पूर्ण,
	अणु 7, 0x98cc, अणु 0x0000000e, 0x0000000e, 0x0000000e पूर्ण पूर्ण,
पूर्ण;



/***************************\
* RF2425/RF2417 (Swan/Nala) *
* AR2317 (Spider SoC)       *
\***************************/

/* BANK 2				len  pos col */
#घोषणा AR5K_RF2425_RF_TURBO		अणु 1, 1,   2 पूर्ण

/* BANK 6				len  pos col */
#घोषणा	AR5K_RF2425_OB_2GHZ		अणु 3, 193, 0 पूर्ण
#घोषणा	AR5K_RF2425_DB_2GHZ		अणु 3, 190, 0 पूर्ण

अटल स्थिर काष्ठा ath5k_rf_reg rf_regs_2425[] = अणु
	अणु2, AR5K_RF_TURBO,		AR5K_RF2425_RF_TURBOपूर्ण,
	अणु6, AR5K_RF_OB_2GHZ,		AR5K_RF2425_OB_2GHZपूर्ण,
	अणु6, AR5K_RF_DB_2GHZ,		AR5K_RF2425_DB_2GHZपूर्ण,
पूर्ण;

/* Default mode specअगरic settings
 */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_2425[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x02001408, 0x02001408, 0x02001408 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a020c0, 0x00e020c0, 0x00e020c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x10000000, 0x10000000, 0x10000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x002a0000, 0x002a0000, 0x002a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00100000, 0x00100000, 0x00100000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00020000, 0x00020000, 0x00020000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00730000, 0x00730000, 0x00730000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00f80000, 0x00f80000, 0x00f80000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00e70000, 0x00e70000, 0x00e70000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00140000, 0x00140000, 0x00140000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00910040, 0x00910040, 0x00910040 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0007001a, 0x0007001a, 0x0007001a पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00410000, 0x00410000, 0x00410000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00810000, 0x00810060, 0x00810060 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00020800, 0x00020803, 0x00020803 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00001660, 0x00001660, 0x00001660 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00001688, 0x00001688, 0x00001688 पूर्ण पूर्ण,
	अणु 6, 0x98c4, अणु 0x00000001, 0x00000001, 0x00000001 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00006400, 0x00006400, 0x00006400 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000800, 0x00000800, 0x00000800 पूर्ण पूर्ण,
	अणु 7, 0x98cc, अणु 0x0000000e, 0x0000000e, 0x0000000e पूर्ण पूर्ण,
पूर्ण;

/*
 * TODO: Handle the few dअगरferences with swan during
 * bank modअगरication and get rid of this
 */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_2317[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x02001408, 0x02001408, 0x02001408 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a020c0, 0x00e020c0, 0x00e020c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x10000000, 0x10000000, 0x10000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x002a0000, 0x002a0000, 0x002a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00100000, 0x00100000, 0x00100000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00020000, 0x00020000, 0x00020000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00730000, 0x00730000, 0x00730000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00f80000, 0x00f80000, 0x00f80000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00e70000, 0x00e70000, 0x00e70000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00140100, 0x00140100, 0x00140100 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00910040, 0x00910040, 0x00910040 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0007001a, 0x0007001a, 0x0007001a पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00410000, 0x00410000, 0x00410000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00810000, 0x00810060, 0x00810060 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00020800, 0x00020803, 0x00020803 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00001660, 0x00001660, 0x00001660 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00009688, 0x00009688, 0x00009688 पूर्ण पूर्ण,
	अणु 6, 0x98c4, अणु 0x00000001, 0x00000001, 0x00000001 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00006400, 0x00006400, 0x00006400 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000800, 0x00000800, 0x00000800 पूर्ण पूर्ण,
	अणु 7, 0x98cc, अणु 0x0000000e, 0x0000000e, 0x0000000e पूर्ण पूर्ण,
पूर्ण;

/*
 * TODO: Handle the few dअगरferences with swan during
 * bank modअगरication and get rid of this
 */
अटल स्थिर काष्ठा ath5k_ini_rfbuffer rfb_2417[] = अणु
	/* BANK / C.R.     A/XR         B           G      */
	अणु 1, 0x98d4, अणु 0x00000020, 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु 2, 0x98d0, अणु 0x02001408, 0x02001408, 0x02001408 पूर्ण पूर्ण,
	अणु 3, 0x98dc, अणु 0x00a020c0, 0x00e020c0, 0x00e020c0 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x10000000, 0x10000000, 0x10000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x002a0000, 0x002a0000, 0x002a0000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00100000, 0x00100000, 0x00100000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00020000, 0x00020000, 0x00020000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00730000, 0x00730000, 0x00730000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00f80000, 0x00f80000, 0x00f80000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00e70000, 0x80e70000, 0x80e70000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00140000, 0x00140000, 0x00140000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00910040, 0x00910040, 0x00910040 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x0007001a, 0x0207001a, 0x0207001a पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00410000, 0x00410000, 0x00410000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00810000, 0x00810060, 0x00810060 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00020800, 0x00020803, 0x00020803 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00000000, 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00001660, 0x00001660, 0x00001660 पूर्ण पूर्ण,
	अणु 6, 0x989c, अणु 0x00001688, 0x00001688, 0x00001688 पूर्ण पूर्ण,
	अणु 6, 0x98c4, अणु 0x00000001, 0x00000001, 0x00000001 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00006400, 0x00006400, 0x00006400 पूर्ण पूर्ण,
	अणु 7, 0x989c, अणु 0x00000800, 0x00000800, 0x00000800 पूर्ण पूर्ण,
	अणु 7, 0x98cc, अणु 0x0000000e, 0x0000000e, 0x0000000e पूर्ण पूर्ण,
पूर्ण;
