<शैली गुरु>
/*
 * RF Gain optimization
 *
 * Copyright (c) 2004-2009 Reyk Floeter <reyk@खोलोbsd.org>
 * Copyright (c) 2006-2009 Nick Kossअगरidis <mickflemm@gmail.com>
 *
 * Permission to use, copy, modअगरy, and distribute this software क्रम any
 * purpose with or without fee is hereby granted, provided that the above
 * copyright notice and this permission notice appear in all copies.
 *
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
 * ANY SPECIAL, सूचीECT, INसूचीECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
 * ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
 * OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 *
 */

/**
 * काष्ठा ath5k_ini_rfgain - RF Gain table
 * @rfg_रेजिस्टर: RF Gain रेजिस्टर address
 * @rfg_value: Register value क्रम 5 and 2GHz
 *
 * Mode-specअगरic RF Gain table (64bytes) क्रम RF5111/5112
 * (RF5110 only comes with AR5210 and only supports a/turbo a mode so initial
 * RF Gain values are included in AR5K_AR5210_INI)
 */
काष्ठा ath5k_ini_rfgain अणु
	u16	rfg_रेजिस्टर;
	u32	rfg_value[2];	/* [freq (see below)] */
पूर्ण;

/* Initial RF Gain settings क्रम RF5111 */
अटल स्थिर काष्ठा ath5k_ini_rfgain rfgain_5111[] = अणु
	/*			      5GHz	2GHz	*/
	अणु AR5K_RF_GAIN(0),	अणु 0x000001a9, 0x00000000 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(1),	अणु 0x000001e9, 0x00000040 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(2),	अणु 0x00000029, 0x00000080 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(3),	अणु 0x00000069, 0x00000150 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(4),	अणु 0x00000199, 0x00000190 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(5),	अणु 0x000001d9, 0x000001d0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(6),	अणु 0x00000019, 0x00000010 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(7),	अणु 0x00000059, 0x00000044 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(8),	अणु 0x00000099, 0x00000084 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(9),	अणु 0x000001a5, 0x00000148 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(10),	अणु 0x000001e5, 0x00000188 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(11),	अणु 0x00000025, 0x000001c8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(12),	अणु 0x000001c8, 0x00000014 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(13),	अणु 0x00000008, 0x00000042 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(14),	अणु 0x00000048, 0x00000082 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(15),	अणु 0x00000088, 0x00000178 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(16),	अणु 0x00000198, 0x000001b8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(17),	अणु 0x000001d8, 0x000001f8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(18),	अणु 0x00000018, 0x00000012 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(19),	अणु 0x00000058, 0x00000052 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(20),	अणु 0x00000098, 0x00000092 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(21),	अणु 0x000001a4, 0x0000017c पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(22),	अणु 0x000001e4, 0x000001bc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(23),	अणु 0x00000024, 0x000001fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(24),	अणु 0x00000064, 0x0000000a पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(25),	अणु 0x000000a4, 0x0000004a पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(26),	अणु 0x000000e4, 0x0000008a पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(27),	अणु 0x0000010a, 0x0000015a पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(28),	अणु 0x0000014a, 0x0000019a पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(29),	अणु 0x0000018a, 0x000001da पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(30),	अणु 0x000001ca, 0x0000000e पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(31),	अणु 0x0000000a, 0x0000004e पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(32),	अणु 0x0000004a, 0x0000008e पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(33),	अणु 0x0000008a, 0x0000015e पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(34),	अणु 0x000001ba, 0x0000019e पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(35),	अणु 0x000001fa, 0x000001de पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(36),	अणु 0x0000003a, 0x00000009 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(37),	अणु 0x0000007a, 0x00000049 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(38),	अणु 0x00000186, 0x00000089 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(39),	अणु 0x000001c6, 0x00000179 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(40),	अणु 0x00000006, 0x000001b9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(41),	अणु 0x00000046, 0x000001f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(42),	अणु 0x00000086, 0x00000039 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(43),	अणु 0x000000c6, 0x00000079 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(44),	अणु 0x000000c6, 0x000000b9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(45),	अणु 0x000000c6, 0x000001bd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(46),	अणु 0x000000c6, 0x000001fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(47),	अणु 0x000000c6, 0x0000003d पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(48),	अणु 0x000000c6, 0x0000007d पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(49),	अणु 0x000000c6, 0x000000bd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(50),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(51),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(52),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(53),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(54),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(55),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(56),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(57),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(58),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(59),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(60),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(61),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(62),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(63),	अणु 0x000000c6, 0x000000fd पूर्ण पूर्ण,
पूर्ण;

/* Initial RF Gain settings क्रम RF5112 */
अटल स्थिर काष्ठा ath5k_ini_rfgain rfgain_5112[] = अणु
	/*			      5GHz	2GHz	*/
	अणु AR5K_RF_GAIN(0),	अणु 0x00000007, 0x00000007 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(1),	अणु 0x00000047, 0x00000047 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(2),	अणु 0x00000087, 0x00000087 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(3),	अणु 0x000001a0, 0x000001a0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(4),	अणु 0x000001e0, 0x000001e0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(5),	अणु 0x00000020, 0x00000020 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(6),	अणु 0x00000060, 0x00000060 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(7),	अणु 0x000001a1, 0x000001a1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(8),	अणु 0x000001e1, 0x000001e1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(9),	अणु 0x00000021, 0x00000021 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(10),	अणु 0x00000061, 0x00000061 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(11),	अणु 0x00000162, 0x00000162 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(12),	अणु 0x000001a2, 0x000001a2 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(13),	अणु 0x000001e2, 0x000001e2 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(14),	अणु 0x00000022, 0x00000022 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(15),	अणु 0x00000062, 0x00000062 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(16),	अणु 0x00000163, 0x00000163 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(17),	अणु 0x000001a3, 0x000001a3 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(18),	अणु 0x000001e3, 0x000001e3 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(19),	अणु 0x00000023, 0x00000023 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(20),	अणु 0x00000063, 0x00000063 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(21),	अणु 0x00000184, 0x00000184 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(22),	अणु 0x000001c4, 0x000001c4 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(23),	अणु 0x00000004, 0x00000004 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(24),	अणु 0x000001ea, 0x0000000b पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(25),	अणु 0x0000002a, 0x0000004b पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(26),	अणु 0x0000006a, 0x0000008b पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(27),	अणु 0x000000aa, 0x000001ac पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(28),	अणु 0x000001ab, 0x000001ec पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(29),	अणु 0x000001eb, 0x0000002c पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(30),	अणु 0x0000002b, 0x00000012 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(31),	अणु 0x0000006b, 0x00000052 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(32),	अणु 0x000000ab, 0x00000092 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(33),	अणु 0x000001ac, 0x00000193 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(34),	अणु 0x000001ec, 0x000001d3 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(35),	अणु 0x0000002c, 0x00000013 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(36),	अणु 0x0000003a, 0x00000053 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(37),	अणु 0x0000007a, 0x00000093 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(38),	अणु 0x000000ba, 0x00000194 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(39),	अणु 0x000001bb, 0x000001d4 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(40),	अणु 0x000001fb, 0x00000014 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(41),	अणु 0x0000003b, 0x0000003a पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(42),	अणु 0x0000007b, 0x0000007a पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(43),	अणु 0x000000bb, 0x000000ba पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(44),	अणु 0x000001bc, 0x000001bb पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(45),	अणु 0x000001fc, 0x000001fb पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(46),	अणु 0x0000003c, 0x0000003b पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(47),	अणु 0x0000007c, 0x0000007b पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(48),	अणु 0x000000bc, 0x000000bb पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(49),	अणु 0x000000fc, 0x000001bc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(50),	अणु 0x000000fc, 0x000001fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(51),	अणु 0x000000fc, 0x0000003c पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(52),	अणु 0x000000fc, 0x0000007c पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(53),	अणु 0x000000fc, 0x000000bc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(54),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(55),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(56),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(57),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(58),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(59),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(60),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(61),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(62),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(63),	अणु 0x000000fc, 0x000000fc पूर्ण पूर्ण,
पूर्ण;

/* Initial RF Gain settings क्रम RF2413 */
अटल स्थिर काष्ठा ath5k_ini_rfgain rfgain_2413[] = अणु
	अणु AR5K_RF_GAIN(0),	अणु 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(1),	अणु 0x00000000, 0x00000040 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(2),	अणु 0x00000000, 0x00000080 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(3),	अणु 0x00000000, 0x00000181 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(4),	अणु 0x00000000, 0x000001c1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(5),	अणु 0x00000000, 0x00000001 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(6),	अणु 0x00000000, 0x00000041 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(7),	अणु 0x00000000, 0x00000081 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(8),	अणु 0x00000000, 0x00000168 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(9),	अणु 0x00000000, 0x000001a8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(10),	अणु 0x00000000, 0x000001e8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(11),	अणु 0x00000000, 0x00000028 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(12),	अणु 0x00000000, 0x00000068 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(13),	अणु 0x00000000, 0x00000189 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(14),	अणु 0x00000000, 0x000001c9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(15),	अणु 0x00000000, 0x00000009 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(16),	अणु 0x00000000, 0x00000049 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(17),	अणु 0x00000000, 0x00000089 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(18),	अणु 0x00000000, 0x00000190 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(19),	अणु 0x00000000, 0x000001d0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(20),	अणु 0x00000000, 0x00000010 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(21),	अणु 0x00000000, 0x00000050 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(22),	अणु 0x00000000, 0x00000090 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(23),	अणु 0x00000000, 0x00000191 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(24),	अणु 0x00000000, 0x000001d1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(25),	अणु 0x00000000, 0x00000011 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(26),	अणु 0x00000000, 0x00000051 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(27),	अणु 0x00000000, 0x00000091 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(28),	अणु 0x00000000, 0x00000178 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(29),	अणु 0x00000000, 0x000001b8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(30),	अणु 0x00000000, 0x000001f8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(31),	अणु 0x00000000, 0x00000038 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(32),	अणु 0x00000000, 0x00000078 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(33),	अणु 0x00000000, 0x00000199 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(34),	अणु 0x00000000, 0x000001d9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(35),	अणु 0x00000000, 0x00000019 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(36),	अणु 0x00000000, 0x00000059 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(37),	अणु 0x00000000, 0x00000099 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(38),	अणु 0x00000000, 0x000000d9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(39),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(40),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(41),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(42),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(43),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(44),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(45),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(46),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(47),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(48),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(49),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(50),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(51),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(52),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(53),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(54),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(55),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(56),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(57),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(58),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(59),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(60),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(61),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(62),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(63),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
पूर्ण;

/* Initial RF Gain settings क्रम AR2316 */
अटल स्थिर काष्ठा ath5k_ini_rfgain rfgain_2316[] = अणु
	अणु AR5K_RF_GAIN(0),	अणु 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(1),	अणु 0x00000000, 0x00000040 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(2),	अणु 0x00000000, 0x00000080 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(3),	अणु 0x00000000, 0x000000c0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(4),	अणु 0x00000000, 0x000000e0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(5),	अणु 0x00000000, 0x000000e0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(6),	अणु 0x00000000, 0x00000128 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(7),	अणु 0x00000000, 0x00000128 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(8),	अणु 0x00000000, 0x00000128 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(9),	अणु 0x00000000, 0x00000168 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(10),	अणु 0x00000000, 0x000001a8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(11),	अणु 0x00000000, 0x000001e8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(12),	अणु 0x00000000, 0x00000028 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(13),	अणु 0x00000000, 0x00000068 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(14),	अणु 0x00000000, 0x000000a8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(15),	अणु 0x00000000, 0x000000e8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(16),	अणु 0x00000000, 0x000000e8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(17),	अणु 0x00000000, 0x00000130 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(18),	अणु 0x00000000, 0x00000130 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(19),	अणु 0x00000000, 0x00000170 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(20),	अणु 0x00000000, 0x000001b0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(21),	अणु 0x00000000, 0x000001f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(22),	अणु 0x00000000, 0x00000030 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(23),	अणु 0x00000000, 0x00000070 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(24),	अणु 0x00000000, 0x000000b0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(25),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(26),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(27),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(28),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(29),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(30),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(31),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(32),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(33),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(34),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(35),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(36),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(37),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(38),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(39),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(40),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(41),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(42),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(43),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(44),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(45),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(46),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(47),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(48),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(49),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(50),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(51),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(52),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(53),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(54),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(55),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(56),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(57),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(58),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(59),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(60),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(61),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(62),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(63),	अणु 0x00000000, 0x000000f0 पूर्ण पूर्ण,
पूर्ण;


/* Initial RF Gain settings क्रम RF5413 */
अटल स्थिर काष्ठा ath5k_ini_rfgain rfgain_5413[] = अणु
	/*			      5GHz	2GHz	*/
	अणु AR5K_RF_GAIN(0),	अणु 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(1),	अणु 0x00000040, 0x00000040 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(2),	अणु 0x00000080, 0x00000080 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(3),	अणु 0x000001a1, 0x00000161 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(4),	अणु 0x000001e1, 0x000001a1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(5),	अणु 0x00000021, 0x000001e1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(6),	अणु 0x00000061, 0x00000021 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(7),	अणु 0x00000188, 0x00000061 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(8),	अणु 0x000001c8, 0x00000188 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(9),	अणु 0x00000008, 0x000001c8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(10),	अणु 0x00000048, 0x00000008 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(11),	अणु 0x00000088, 0x00000048 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(12),	अणु 0x000001a9, 0x00000088 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(13),	अणु 0x000001e9, 0x00000169 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(14),	अणु 0x00000029, 0x000001a9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(15),	अणु 0x00000069, 0x000001e9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(16),	अणु 0x000001d0, 0x00000029 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(17),	अणु 0x00000010, 0x00000069 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(18),	अणु 0x00000050, 0x00000190 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(19),	अणु 0x00000090, 0x000001d0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(20),	अणु 0x000001b1, 0x00000010 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(21),	अणु 0x000001f1, 0x00000050 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(22),	अणु 0x00000031, 0x00000090 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(23),	अणु 0x00000071, 0x00000171 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(24),	अणु 0x000001b8, 0x000001b1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(25),	अणु 0x000001f8, 0x000001f1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(26),	अणु 0x00000038, 0x00000031 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(27),	अणु 0x00000078, 0x00000071 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(28),	अणु 0x00000199, 0x00000198 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(29),	अणु 0x000001d9, 0x000001d8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(30),	अणु 0x00000019, 0x00000018 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(31),	अणु 0x00000059, 0x00000058 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(32),	अणु 0x00000099, 0x00000098 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(33),	अणु 0x000000d9, 0x00000179 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(34),	अणु 0x000000f9, 0x000001b9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(35),	अणु 0x000000f9, 0x000001f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(36),	अणु 0x000000f9, 0x00000039 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(37),	अणु 0x000000f9, 0x00000079 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(38),	अणु 0x000000f9, 0x000000b9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(39),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(40),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(41),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(42),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(43),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(44),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(45),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(46),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(47),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(48),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(49),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(50),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(51),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(52),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(53),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(54),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(55),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(56),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(57),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(58),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(59),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(60),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(61),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(62),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(63),	अणु 0x000000f9, 0x000000f9 पूर्ण पूर्ण,
पूर्ण;


/* Initial RF Gain settings क्रम RF2425 */
अटल स्थिर काष्ठा ath5k_ini_rfgain rfgain_2425[] = अणु
	अणु AR5K_RF_GAIN(0),	अणु 0x00000000, 0x00000000 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(1),	अणु 0x00000000, 0x00000040 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(2),	अणु 0x00000000, 0x00000080 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(3),	अणु 0x00000000, 0x00000181 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(4),	अणु 0x00000000, 0x000001c1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(5),	अणु 0x00000000, 0x00000001 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(6),	अणु 0x00000000, 0x00000041 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(7),	अणु 0x00000000, 0x00000081 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(8),	अणु 0x00000000, 0x00000188 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(9),	अणु 0x00000000, 0x000001c8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(10),	अणु 0x00000000, 0x00000008 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(11),	अणु 0x00000000, 0x00000048 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(12),	अणु 0x00000000, 0x00000088 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(13),	अणु 0x00000000, 0x00000189 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(14),	अणु 0x00000000, 0x000001c9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(15),	अणु 0x00000000, 0x00000009 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(16),	अणु 0x00000000, 0x00000049 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(17),	अणु 0x00000000, 0x00000089 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(18),	अणु 0x00000000, 0x000001b0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(19),	अणु 0x00000000, 0x000001f0 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(20),	अणु 0x00000000, 0x00000030 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(21),	अणु 0x00000000, 0x00000070 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(22),	अणु 0x00000000, 0x00000171 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(23),	अणु 0x00000000, 0x000001b1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(24),	अणु 0x00000000, 0x000001f1 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(25),	अणु 0x00000000, 0x00000031 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(26),	अणु 0x00000000, 0x00000071 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(27),	अणु 0x00000000, 0x000001b8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(28),	अणु 0x00000000, 0x000001f8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(29),	अणु 0x00000000, 0x00000038 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(30),	अणु 0x00000000, 0x00000078 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(31),	अणु 0x00000000, 0x000000b8 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(32),	अणु 0x00000000, 0x000001b9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(33),	अणु 0x00000000, 0x000001f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(34),	अणु 0x00000000, 0x00000039 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(35),	अणु 0x00000000, 0x00000079 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(36),	अणु 0x00000000, 0x000000b9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(37),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(38),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(39),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(40),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(41),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(42),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(43),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(44),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(45),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(46),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(47),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(48),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(49),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(50),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(51),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(52),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(53),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(54),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(55),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(56),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(57),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(58),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(59),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(60),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(61),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(62),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
	अणु AR5K_RF_GAIN(63),	अणु 0x00000000, 0x000000f9 पूर्ण पूर्ण,
पूर्ण;

#घोषणा AR5K_GAIN_CRN_FIX_BITS_5111		4
#घोषणा AR5K_GAIN_CRN_FIX_BITS_5112		7
#घोषणा AR5K_GAIN_CRN_MAX_FIX_BITS		AR5K_GAIN_CRN_FIX_BITS_5112
#घोषणा AR5K_GAIN_DYN_ADJUST_HI_MARGIN		15
#घोषणा AR5K_GAIN_DYN_ADJUST_LO_MARGIN		20
#घोषणा AR5K_GAIN_CCK_PROBE_CORR		5
#घोषणा AR5K_GAIN_CCK_OFDM_GAIN_DELTA		15
#घोषणा AR5K_GAIN_STEP_COUNT			10

/* Check अगर our current measurement is inside our
 * current variable attenuation winकरोw */
#घोषणा AR5K_GAIN_CHECK_ADJUST(_g)		\
	((_g)->g_current <= (_g)->g_low || (_g)->g_current >= (_g)->g_high)

/**
 * काष्ठा ath5k_gain_opt_step - An RF gain optimization step
 * @gos_param: Set of parameters
 * @gos_gain: Gain
 */
काष्ठा ath5k_gain_opt_step अणु
	s8				gos_param[AR5K_GAIN_CRN_MAX_FIX_BITS];
	s8				gos_gain;
पूर्ण;

/**
 * काष्ठा ath5k_gain_opt - RF Gain optimization ladder
 * @go_शेष: The शेष step
 * @go_steps_count: How many optimization steps
 * @go_step: Array of &काष्ठा ath5k_gain_opt_step
 */
काष्ठा ath5k_gain_opt अणु
	u8				go_शेष;
	u8				go_steps_count;
	स्थिर काष्ठा ath5k_gain_opt_step	go_step[AR5K_GAIN_STEP_COUNT];
पूर्ण;


/*
 * RF5111
 * Parameters on gos_param:
 * 1) Tx clip PHY रेजिस्टर
 * 2) PWD 90 RF रेजिस्टर
 * 3) PWD 84 RF रेजिस्टर
 * 4) RFGainSel RF रेजिस्टर
 */
अटल स्थिर काष्ठा ath5k_gain_opt rfgain_opt_5111 = अणु
	4,
	9,
	अणु
		अणु अणु 4, 1, 1, 1 पूर्ण, 6 पूर्ण,
		अणु अणु 4, 0, 1, 1 पूर्ण, 4 पूर्ण,
		अणु अणु 3, 1, 1, 1 पूर्ण, 3 पूर्ण,
		अणु अणु 4, 0, 0, 1 पूर्ण, 1 पूर्ण,
		अणु अणु 4, 1, 1, 0 पूर्ण, 0 पूर्ण,
		अणु अणु 4, 0, 1, 0 पूर्ण, -2 पूर्ण,
		अणु अणु 3, 1, 1, 0 पूर्ण, -3 पूर्ण,
		अणु अणु 4, 0, 0, 0 पूर्ण, -4 पूर्ण,
		अणु अणु 2, 1, 1, 0 पूर्ण, -6 पूर्ण
	पूर्ण
पूर्ण;

/*
 * RF5112
 * Parameters on gos_param:
 * 1) Mixgain ovr RF रेजिस्टर
 * 2) PWD 138 RF रेजिस्टर
 * 3) PWD 137 RF रेजिस्टर
 * 4) PWD 136 RF रेजिस्टर
 * 5) PWD 132 RF रेजिस्टर
 * 6) PWD 131 RF रेजिस्टर
 * 7) PWD 130 RF रेजिस्टर
 */
अटल स्थिर काष्ठा ath5k_gain_opt rfgain_opt_5112 = अणु
	1,
	8,
	अणु
		अणु अणु 3, 0, 0, 0, 0, 0, 0 पूर्ण, 6 पूर्ण,
		अणु अणु 2, 0, 0, 0, 0, 0, 0 पूर्ण, 0 पूर्ण,
		अणु अणु 1, 0, 0, 0, 0, 0, 0 पूर्ण, -3 पूर्ण,
		अणु अणु 0, 0, 0, 0, 0, 0, 0 पूर्ण, -6 पूर्ण,
		अणु अणु 0, 1, 1, 0, 0, 0, 0 पूर्ण, -8 पूर्ण,
		अणु अणु 0, 1, 1, 0, 1, 1, 0 पूर्ण, -10 पूर्ण,
		अणु अणु 0, 1, 0, 1, 1, 1, 0 पूर्ण, -13 पूर्ण,
		अणु अणु 0, 1, 0, 1, 1, 0, 1 पूर्ण, -16 पूर्ण,
	पूर्ण
पूर्ण;

