<शैली गुरु>
/* SPDX-License-Identअगरier: GPL-2.0-or-later */
/*
   cx231xx_conf-reg.h - driver क्रम Conexant Cx23100/101/102 USB
			video capture devices

   Copyright (C) 2008 <srinivasa.deevi at conexant करोt com>

 */

#अगर_अघोषित _POLARIS_REG_H_
#घोषणा _POLARIS_REG_H_

#घोषणा BOARD_CFG_STAT          0x0
#घोषणा TS_MODE_REG             0x4
#घोषणा TS1_CFG_REG             0x8
#घोषणा TS1_LENGTH_REG          0xc
#घोषणा TS2_CFG_REG             0x10
#घोषणा TS2_LENGTH_REG          0x14
#घोषणा EP_MODE_SET             0x18
#घोषणा CIR_PWR_PTN1            0x1c
#घोषणा CIR_PWR_PTN2            0x20
#घोषणा CIR_PWR_PTN3            0x24
#घोषणा CIR_PWR_MASK0           0x28
#घोषणा CIR_PWR_MASK1           0x2c
#घोषणा CIR_PWR_MASK2           0x30
#घोषणा CIR_GAIN                0x34
#घोषणा CIR_CAR_REG             0x38
#घोषणा CIR_OT_CFG1             0x40
#घोषणा CIR_OT_CFG2             0x44
#घोषणा GBULK_BIT_EN            0x68
#घोषणा PWR_CTL_EN              0x74

/* Polaris Endpoपूर्णांकs capture mask क्रम रेजिस्टर EP_MODE_SET */
#घोषणा ENABLE_EP1              0x01   /* Bit[0]=1 */
#घोषणा ENABLE_EP2              0x02   /* Bit[1]=1 */
#घोषणा ENABLE_EP3              0x04   /* Bit[2]=1 */
#घोषणा ENABLE_EP4              0x08   /* Bit[3]=1 */
#घोषणा ENABLE_EP5              0x10   /* Bit[4]=1 */
#घोषणा ENABLE_EP6              0x20   /* Bit[5]=1 */

/* Bit definition क्रम रेजिस्टर PWR_CTL_EN */
#घोषणा PWR_MODE_MASK           0x17f
#घोषणा PWR_AV_EN               0x08   /* bit3 */
#घोषणा PWR_ISO_EN              0x40   /* bit6 */
#घोषणा PWR_AV_MODE             0x30   /* bit4,5  */
#घोषणा PWR_TUNER_EN            0x04   /* bit2 */
#घोषणा PWR_DEMOD_EN            0x02   /* bit1 */
#घोषणा I2C_DEMOD_EN            0x01   /* bit0 */
#घोषणा PWR_RESETOUT_EN         0x100  /* bit8 */

क्रमागत AV_MODEअणु
	POLARIS_AVMODE_DEFAULT = 0,
	POLARIS_AVMODE_DIGITAL = 0x10,
	POLARIS_AVMODE_ANALOGT_TV = 0x20,
	POLARIS_AVMODE_ENXTERNAL_AV = 0x30,

पूर्ण;

/* Colibri Registers */

#घोषणा SINGLE_ENDED            0x0
#घोषणा LOW_IF                  0x4
#घोषणा EU_IF                   0x9
#घोषणा US_IF                   0xa

#घोषणा SUP_BLK_TUNE1           0x00
#घोषणा SUP_BLK_TUNE2           0x01
#घोषणा SUP_BLK_TUNE3           0x02
#घोषणा SUP_BLK_XTAL            0x03
#घोषणा SUP_BLK_PLL1            0x04
#घोषणा SUP_BLK_PLL2            0x05
#घोषणा SUP_BLK_PLL3            0x06
#घोषणा SUP_BLK_REF             0x07
#घोषणा SUP_BLK_PWRDN           0x08
#घोषणा SUP_BLK_TESTPAD         0x09
#घोषणा ADC_COM_INT5_STAB_REF   0x0a
#घोषणा ADC_COM_QUANT           0x0b
#घोषणा ADC_COM_BIAS1           0x0c
#घोषणा ADC_COM_BIAS2           0x0d
#घोषणा ADC_COM_BIAS3           0x0e
#घोषणा TESTBUS_CTRL            0x12

#घोषणा FLD_PWRDN_TUNING_BIAS	0x10
#घोषणा FLD_PWRDN_ENABLE_PLL	0x08
#घोषणा FLD_PWRDN_PD_BANDGAP	0x04
#घोषणा FLD_PWRDN_PD_BIAS	0x02
#घोषणा FLD_PWRDN_PD_TUNECK	0x01


#घोषणा ADC_STATUS_CH1          0x20
#घोषणा ADC_STATUS_CH2          0x40
#घोषणा ADC_STATUS_CH3          0x60

#घोषणा ADC_STATUS2_CH1         0x21
#घोषणा ADC_STATUS2_CH2         0x41
#घोषणा ADC_STATUS2_CH3         0x61

#घोषणा ADC_CAL_ATEST_CH1       0x22
#घोषणा ADC_CAL_ATEST_CH2       0x42
#घोषणा ADC_CAL_ATEST_CH3       0x62

#घोषणा ADC_PWRDN_CLAMP_CH1     0x23
#घोषणा ADC_PWRDN_CLAMP_CH2     0x43
#घोषणा ADC_PWRDN_CLAMP_CH3     0x63

#घोषणा ADC_CTRL_DAC23_CH1      0x24
#घोषणा ADC_CTRL_DAC23_CH2      0x44
#घोषणा ADC_CTRL_DAC23_CH3      0x64

#घोषणा ADC_CTRL_DAC1_CH1       0x25
#घोषणा ADC_CTRL_DAC1_CH2       0x45
#घोषणा ADC_CTRL_DAC1_CH3       0x65

#घोषणा ADC_DCSERVO_DEM_CH1     0x26
#घोषणा ADC_DCSERVO_DEM_CH2     0x46
#घोषणा ADC_DCSERVO_DEM_CH3     0x66

#घोषणा ADC_FB_FRCRST_CH1       0x27
#घोषणा ADC_FB_FRCRST_CH2       0x47
#घोषणा ADC_FB_FRCRST_CH3       0x67

#घोषणा ADC_INPUT_CH1           0x28
#घोषणा ADC_INPUT_CH2           0x48
#घोषणा ADC_INPUT_CH3           0x68
#घोषणा INPUT_SEL_MASK          0x30   /* [5:4] in_sel */

#घोषणा ADC_NTF_PRECLMP_EN_CH1  0x29
#घोषणा ADC_NTF_PRECLMP_EN_CH2  0x49
#घोषणा ADC_NTF_PRECLMP_EN_CH3  0x69

#घोषणा ADC_QGAIN_RES_TRM_CH1   0x2a
#घोषणा ADC_QGAIN_RES_TRM_CH2   0x4a
#घोषणा ADC_QGAIN_RES_TRM_CH3   0x6a

#घोषणा ADC_SOC_PRECLMP_TERM_CH1    0x2b
#घोषणा ADC_SOC_PRECLMP_TERM_CH2    0x4b
#घोषणा ADC_SOC_PRECLMP_TERM_CH3    0x6b

#घोषणा TESTBUS_CTRL_CH1        0x32
#घोषणा TESTBUS_CTRL_CH2        0x52
#घोषणा TESTBUS_CTRL_CH3        0x72

/******************************************************************************
			    * DIF रेजिस्टरs *
 ******************************************************************************/
#घोषणा      सूचीECT_IF_REVB_BASE  0x00300

/*****************************************************************************/
#घोषणा      DIF_PLL_FREQ_WORD        (सूचीECT_IF_REVB_BASE + 0x00000000)
/*****************************************************************************/
#घोषणा      FLD_DIF_PLL_LOCK                           0x80000000
/*  Reserved                                [30:29] */
#घोषणा      FLD_DIF_PLL_FREE_RUN                       0x10000000
#घोषणा      FLD_DIF_PLL_FREQ                           0x0fffffff

/*****************************************************************************/
#घोषणा      DIF_PLL_CTRL             (सूचीECT_IF_REVB_BASE + 0x00000004)
/*****************************************************************************/
#घोषणा      FLD_DIF_KD_PD                              0xff000000
/*  Reserved                             [23:20] */
#घोषणा      FLD_DIF_KDS_PD                             0x000f0000
#घोषणा      FLD_DIF_KI_PD                              0x0000ff00
/*  Reserved                             [7:4] */
#घोषणा      FLD_DIF_KIS_PD                             0x0000000f

/*****************************************************************************/
#घोषणा      DIF_PLL_CTRL1            (सूचीECT_IF_REVB_BASE + 0x00000008)
/*****************************************************************************/
#घोषणा      FLD_DIF_KD_FD                              0xff000000
/*  Reserved                             [23:20] */
#घोषणा      FLD_DIF_KDS_FD                             0x000f0000
#घोषणा      FLD_DIF_KI_FD                              0x0000ff00
#घोषणा      FLD_DIF_SIG_PROP_SZ                        0x000000f0
#घोषणा      FLD_DIF_KIS_FD                             0x0000000f

/*****************************************************************************/
#घोषणा      DIF_PLL_CTRL2            (सूचीECT_IF_REVB_BASE + 0x0000000c)
/*****************************************************************************/
#घोषणा      FLD_DIF_PLL_AGC_REF                        0xfff00000
#घोषणा      FLD_DIF_PLL_AGC_KI                         0x000f0000
/*  Reserved                             [15] */
#घोषणा      FLD_DIF_FREQ_LIMIT                         0x00007000
#घोषणा      FLD_DIF_K_FD                               0x00000f00
#घोषणा      FLD_DIF_DOWNSMPL_FD                        0x000000ff

/*****************************************************************************/
#घोषणा      DIF_PLL_CTRL3            (सूचीECT_IF_REVB_BASE + 0x00000010)
/*****************************************************************************/
/*  Reserved                             [31:16] */
#घोषणा      FLD_DIF_PLL_AGC_EN                         0x00008000
/*  Reserved                             [14:12] */
#घोषणा      FLD_DIF_PLL_MAN_GAIN                       0x00000fff

/*****************************************************************************/
#घोषणा      DIF_AGC_IF_REF           (सूचीECT_IF_REVB_BASE + 0x00000014)
/*****************************************************************************/
#घोषणा      FLD_DIF_K_AGC_RF                           0xf0000000
#घोषणा      FLD_DIF_K_AGC_IF                           0x0f000000
#घोषणा      FLD_DIF_K_AGC_INT                          0x00f00000
/*  Reserved                             [19:12] */
#घोषणा      FLD_DIF_IF_REF                             0x00000fff

/*****************************************************************************/
#घोषणा      DIF_AGC_CTRL_IF          (सूचीECT_IF_REVB_BASE + 0x00000018)
/*****************************************************************************/
#घोषणा      FLD_DIF_IF_MAX                             0xff000000
#घोषणा      FLD_DIF_IF_MIN                             0x00ff0000
#घोषणा      FLD_DIF_IF_AGC                             0x0000ffff

/*****************************************************************************/
#घोषणा      DIF_AGC_CTRL_INT         (सूचीECT_IF_REVB_BASE + 0x0000001c)
/*****************************************************************************/
#घोषणा      FLD_DIF_पूर्णांक_उच्च                            0xff000000
#घोषणा      FLD_DIF_पूर्णांक_न्यून                            0x00ff0000
#घोषणा      FLD_DIF_INT_AGC                            0x0000ffff

/*****************************************************************************/
#घोषणा      DIF_AGC_CTRL_RF          (सूचीECT_IF_REVB_BASE + 0x00000020)
/*****************************************************************************/
#घोषणा      FLD_DIF_RF_MAX                             0xff000000
#घोषणा      FLD_DIF_RF_MIN                             0x00ff0000
#घोषणा      FLD_DIF_RF_AGC                             0x0000ffff

/*****************************************************************************/
#घोषणा      DIF_AGC_IF_INT_CURRENT   (सूचीECT_IF_REVB_BASE + 0x00000024)
/*****************************************************************************/
#घोषणा      FLD_DIF_IF_AGC_IN                          0xffff0000
#घोषणा      FLD_DIF_INT_AGC_IN                         0x0000ffff

/*****************************************************************************/
#घोषणा      DIF_AGC_RF_CURRENT       (सूचीECT_IF_REVB_BASE + 0x00000028)
/*****************************************************************************/
/*  Reserved                            [31:16] */
#घोषणा      FLD_DIF_RF_AGC_IN                          0x0000ffff

/*****************************************************************************/
#घोषणा      DIF_VIDEO_AGC_CTRL       (सूचीECT_IF_REVB_BASE + 0x0000002c)
/*****************************************************************************/
#घोषणा      FLD_DIF_AFD                                0xc0000000
#घोषणा      FLD_DIF_K_VID_AGC                          0x30000000
#घोषणा      FLD_DIF_LINE_LENGTH                        0x0fff0000
#घोषणा      FLD_DIF_AGC_GAIN                           0x0000ffff

/*****************************************************************************/
#घोषणा      DIF_VID_AUD_OVERRIDE     (सूचीECT_IF_REVB_BASE + 0x00000030)
/*****************************************************************************/
#घोषणा      FLD_DIF_AUDIO_AGC_OVERRIDE                 0x80000000
/*  Reserved                             [30:30] */
#घोषणा      FLD_DIF_AUDIO_MAN_GAIN                     0x3f000000
/*  Reserved                             [23:17] */
#घोषणा      FLD_DIF_VID_AGC_OVERRIDE                   0x00010000
#घोषणा      FLD_DIF_VID_MAN_GAIN                       0x0000ffff

/*****************************************************************************/
#घोषणा      DIF_AV_SEP_CTRL          (सूचीECT_IF_REVB_BASE + 0x00000034)
/*****************************************************************************/
#घोषणा      FLD_DIF_LPF_FREQ                           0xc0000000
#घोषणा      FLD_DIF_AV_PHASE_INC                       0x3f000000
#घोषणा      FLD_DIF_AUDIO_FREQ                         0x00ffffff

/*****************************************************************************/
#घोषणा      DIF_COMP_FLT_CTRL        (सूचीECT_IF_REVB_BASE + 0x00000038)
/*****************************************************************************/
/*  Reserved                            [31:24] */
#घोषणा      FLD_DIF_IIR23_R2                           0x00ff0000
#घोषणा      FLD_DIF_IIR23_R1                           0x0000ff00
#घोषणा      FLD_DIF_IIR1_R1                            0x000000ff

/*****************************************************************************/
#घोषणा      DIF_MISC_CTRL            (सूचीECT_IF_REVB_BASE + 0x0000003c)
/*****************************************************************************/
#घोषणा      FLD_DIF_DIF_BYPASS                         0x80000000
#घोषणा      FLD_DIF_FM_NYQ_GAIN                        0x40000000
#घोषणा      FLD_DIF_RF_AGC_ENA                         0x20000000
#घोषणा      FLD_DIF_INT_AGC_ENA                        0x10000000
#घोषणा      FLD_DIF_IF_AGC_ENA                         0x08000000
#घोषणा      FLD_DIF_FORCE_RF_IF_LOCK                   0x04000000
#घोषणा      FLD_DIF_VIDEO_AGC_ENA                      0x02000000
#घोषणा      FLD_DIF_RF_AGC_INV                         0x01000000
#घोषणा      FLD_DIF_INT_AGC_INV                        0x00800000
#घोषणा      FLD_DIF_IF_AGC_INV                         0x00400000
#घोषणा      FLD_DIF_SPEC_INV                           0x00200000
#घोषणा      FLD_DIF_AUD_FULL_BW                        0x00100000
#घोषणा      FLD_DIF_AUD_SRC_SEL                        0x00080000
/*  Reserved                             [18] */
#घोषणा      FLD_DIF_IF_FREQ                            0x00030000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_TIP_OFFSET                         0x00003f00
/*  Reserved                             [7:5] */
#घोषणा      FLD_DIF_DITHER_ENA                         0x00000010
/*  Reserved                             [3:1] */
#घोषणा      FLD_DIF_RF_IF_LOCK                         0x00000001

/*****************************************************************************/
#घोषणा      DIF_SRC_PHASE_INC        (सूचीECT_IF_REVB_BASE + 0x00000040)
/*****************************************************************************/
/*  Reserved                             [31:29] */
#घोषणा      FLD_DIF_PHASE_INC                          0x1fffffff

/*****************************************************************************/
#घोषणा      DIF_SRC_GAIN_CONTROL     (सूचीECT_IF_REVB_BASE + 0x00000044)
/*****************************************************************************/
/*  Reserved                             [31:16] */
#घोषणा      FLD_DIF_SRC_KI                             0x0000ff00
#घोषणा      FLD_DIF_SRC_KD                             0x000000ff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF01          (सूचीECT_IF_REVB_BASE + 0x00000048)
/*****************************************************************************/
/*  Reserved                             [31:19] */
#घोषणा      FLD_DIF_BPF_COEFF_0                        0x00070000
/*  Reserved                             [15:4] */
#घोषणा      FLD_DIF_BPF_COEFF_1                        0x0000000f

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF23          (सूचीECT_IF_REVB_BASE + 0x0000004c)
/*****************************************************************************/
/*  Reserved                             [31:22] */
#घोषणा      FLD_DIF_BPF_COEFF_2                        0x003f0000
/*  Reserved                             [15:7] */
#घोषणा      FLD_DIF_BPF_COEFF_3                        0x0000007f

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF45          (सूचीECT_IF_REVB_BASE + 0x00000050)
/*****************************************************************************/
/*  Reserved                             [31:24] */
#घोषणा      FLD_DIF_BPF_COEFF_4                        0x00ff0000
/*  Reserved                             [15:8] */
#घोषणा      FLD_DIF_BPF_COEFF_5                        0x000000ff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF67          (सूचीECT_IF_REVB_BASE + 0x00000054)
/*****************************************************************************/
/*  Reserved                             [31:25] */
#घोषणा      FLD_DIF_BPF_COEFF_6                        0x01ff0000
/*  Reserved                             [15:9] */
#घोषणा      FLD_DIF_BPF_COEFF_7                        0x000001ff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF89          (सूचीECT_IF_REVB_BASE + 0x00000058)
/*****************************************************************************/
/*  Reserved                             [31:26] */
#घोषणा      FLD_DIF_BPF_COEFF_8                        0x03ff0000
/*  Reserved                             [15:10] */
#घोषणा      FLD_DIF_BPF_COEFF_9                        0x000003ff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF1011        (सूचीECT_IF_REVB_BASE + 0x0000005c)
/*****************************************************************************/
/*  Reserved                             [31:27] */
#घोषणा      FLD_DIF_BPF_COEFF_10                       0x07ff0000
/*  Reserved                             [15:11] */
#घोषणा      FLD_DIF_BPF_COEFF_11                       0x000007ff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF1213        (सूचीECT_IF_REVB_BASE + 0x00000060)
/*****************************************************************************/
/*  Reserved                             [31:27] */
#घोषणा      FLD_DIF_BPF_COEFF_12                       0x07ff0000
/*  Reserved                             [15:12] */
#घोषणा      FLD_DIF_BPF_COEFF_13                       0x00000fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF1415        (सूचीECT_IF_REVB_BASE + 0x00000064)
/*****************************************************************************/
/*  Reserved                             [31:28] */
#घोषणा      FLD_DIF_BPF_COEFF_14                       0x0fff0000
/*  Reserved                             [15:12] */
#घोषणा      FLD_DIF_BPF_COEFF_15                       0x00000fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF1617        (सूचीECT_IF_REVB_BASE + 0x00000068)
/*****************************************************************************/
/*  Reserved                             [31:29] */
#घोषणा      FLD_DIF_BPF_COEFF_16                       0x1fff0000
/*  Reserved                             [15:13] */
#घोषणा      FLD_DIF_BPF_COEFF_17                       0x00001fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF1819        (सूचीECT_IF_REVB_BASE + 0x0000006c)
/*****************************************************************************/
/*  Reserved                             [31:29] */
#घोषणा      FLD_DIF_BPF_COEFF_18                       0x1fff0000
/*  Reserved                             [15:13] */
#घोषणा      FLD_DIF_BPF_COEFF_19                       0x00001fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF2021        (सूचीECT_IF_REVB_BASE + 0x00000070)
/*****************************************************************************/
/*  Reserved                             [31:29] */
#घोषणा      FLD_DIF_BPF_COEFF_20                       0x1fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_21                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF2223        (सूचीECT_IF_REVB_BASE + 0x00000074)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_22                       0x3fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_23                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF2425        (सूचीECT_IF_REVB_BASE + 0x00000078)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_24                       0x3fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_25                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF2627        (सूचीECT_IF_REVB_BASE + 0x0000007c)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_26                       0x3fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_27                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF2829        (सूचीECT_IF_REVB_BASE + 0x00000080)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_28                       0x3fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_29                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF3031        (सूचीECT_IF_REVB_BASE + 0x00000084)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_30                       0x3fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_31                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF3233        (सूचीECT_IF_REVB_BASE + 0x00000088)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_32                       0x3fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_33                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF3435        (सूचीECT_IF_REVB_BASE + 0x0000008c)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_34                       0x3fff0000
/*  Reserved                             [15:14] */
#घोषणा      FLD_DIF_BPF_COEFF_35                       0x00003fff

/*****************************************************************************/
#घोषणा      DIF_BPF_COEFF36          (सूचीECT_IF_REVB_BASE + 0x00000090)
/*****************************************************************************/
/*  Reserved                             [31:30] */
#घोषणा      FLD_DIF_BPF_COEFF_36                       0x3fff0000
/*  Reserved                             [15:0] */

/*****************************************************************************/
#घोषणा      DIF_RPT_VARIANCE         (सूचीECT_IF_REVB_BASE + 0x00000094)
/*****************************************************************************/
/*  Reserved                             [31:20] */
#घोषणा      FLD_DIF_RPT_VARIANCE                       0x000fffff

/*****************************************************************************/
#घोषणा      DIF_SOFT_RST_CTRL_REVB       (सूचीECT_IF_REVB_BASE + 0x00000098)
/*****************************************************************************/
/*  Reserved                             [31:8] */
#घोषणा      FLD_DIF_DIF_SOFT_RST                       0x00000080
#घोषणा      FLD_DIF_DIF_REG_RST_MSK                    0x00000040
#घोषणा      FLD_DIF_AGC_RST_MSK                        0x00000020
#घोषणा      FLD_DIF_CMP_RST_MSK                        0x00000010
#घोषणा      FLD_DIF_AVS_RST_MSK                        0x00000008
#घोषणा      FLD_DIF_NYQ_RST_MSK                        0x00000004
#घोषणा      FLD_DIF_DIF_SRC_RST_MSK                    0x00000002
#घोषणा      FLD_DIF_PLL_RST_MSK                        0x00000001

/*****************************************************************************/
#घोषणा      DIF_PLL_FREQ_ERR         (सूचीECT_IF_REVB_BASE + 0x0000009c)
/*****************************************************************************/
/*  Reserved                             [31:25] */
#घोषणा      FLD_DIF_CTL_IP                             0x01ffffff

#पूर्ण_अगर
