<शैली गुरु>
// SPDX-License-Identअगरier: GPL-2.0
#समावेश <मानकपन.स>
#समावेश <मानक_निवेशt.h>
#समावेश <मानककोष.स>
#समावेश <unistd.h>
#समावेश <sys/types.h>
#समावेश <sys/स्थिति.स>
#समावेश <fcntl.h>
#समावेश <त्रुटिसं.स>
#समावेश <माला.स>

पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv)
अणु
	स्थिर अक्षर *path;
	अक्षर buf[4];
	पूर्णांक fd, rc;

	अगर (argc < 2) अणु
		ख_लिखो(मानक_त्रुटि, "usage: %s <path>\n", argv[0]);
		वापस निकास_त्रुटि;
	पूर्ण

	path = argv[1];

	/* create a test variable */
	fd = खोलो(path, O_RDWR | O_CREAT, 0600);
	अगर (fd < 0) अणु
		लिखो_त्रुटि("open(O_WRONLY)");
		वापस निकास_त्रुटि;
	पूर्ण

	rc = पढ़ो(fd, buf, माप(buf));
	अगर (rc != 0) अणु
		ख_लिखो(मानक_त्रुटि, "Reading a new var should return EOF\n");
		वापस निकास_त्रुटि;
	पूर्ण

	वापस निकास_सफल;
पूर्ण
