<शैली गुरु>
#आशय once
#अघोषित न_संशोधन
#समावेश <निश्चित.स>
#समावेश <dirent.h>
#समावेश <त्रुटिसं.स>
#समावेश <stdbool.h>
#समावेश <मानककोष.स>
#समावेश <माला.स>
#समावेश <unistd.h>
#समावेश <sys/syscall.h>

अटल अंतरभूत pid_t sys_getpid(व्योम)
अणु
	वापस syscall(SYS_getpid);
पूर्ण

अटल अंतरभूत pid_t sys_gettid(व्योम)
अणु
	वापस syscall(SYS_gettid);
पूर्ण

अटल अंतरभूत bool streq(स्थिर अक्षर *s1, स्थिर अक्षर *s2)
अणु
	वापस म_भेद(s1, s2) == 0;
पूर्ण

अटल अचिन्हित दीर्घ दीर्घ xम_से_अदीर्घl(स्थिर अक्षर *p, अक्षर **end)
अणु
	अगर (*p == '0') अणु
		*end = (अक्षर *)p + 1;
		वापस 0;
	पूर्ण अन्यथा अगर ('1' <= *p && *p <= '9') अणु
		अचिन्हित दीर्घ दीर्घ val;

		त्रुटि_सं = 0;
		val = म_से_अदीर्घl(p, end, 10);
		निश्चित(त्रुटि_सं == 0);
		वापस val;
	पूर्ण अन्यथा
		निश्चित(0);
पूर्ण

अटल काष्ठा dirent *xसूची_पढ़ो(सूची *d)
अणु
	काष्ठा dirent *de;

	त्रुटि_सं = 0;
	de = सूची_पढ़ो(d);
	निश्चित(de || त्रुटि_सं == 0);
	वापस de;
पूर्ण
