<शैली गुरु>
// SPDX-License-Identअगरier: (LGPL-2.1 OR BSD-2-Clause)

काष्ठा S अणु
	पूर्णांक	a;
	पूर्णांक	b;
	पूर्णांक	c;
पूर्ण;

जोड़ U अणु
	पूर्णांक	a;
	पूर्णांक	b;
	पूर्णांक	c;
पूर्ण;

काष्ठा S1 अणु
	पूर्णांक	a;
	पूर्णांक	b;
	पूर्णांक	c;
पूर्ण;

जोड़ U1 अणु
	पूर्णांक	a;
	पूर्णांक	b;
	पूर्णांक	c;
पूर्ण;

प्रकार पूर्णांक T;
प्रकार पूर्णांक S;
प्रकार पूर्णांक U;
प्रकार पूर्णांक T1;
प्रकार पूर्णांक S1;
प्रकार पूर्णांक U1;

काष्ठा root_काष्ठा अणु
	S		m_1;
	T		m_2;
	U		m_3;
	S1		m_4;
	T1		m_5;
	U1		m_6;
	काष्ठा S	m_7;
	काष्ठा S1	m_8;
	जोड़  U	m_9;
	जोड़  U1	m_10;
पूर्ण;

पूर्णांक func(काष्ठा root_काष्ठा *root)
अणु
	वापस 0;
पूर्ण
